/*
 * PDB file: ntkrnlmp.pdb
 * Image architecture: AMD64 (0x8664)
 *
 * Dumped by pdbex tool v0.18, by wbenny
 */

struct _IMAGE_INFO;
enum _ADJUST_REASON;
enum MCA_EXCEPTION_TYPE;
enum _PPM_PERF_ACTION;
enum POWER_MESSAGE_TYPE;
enum _IOP_RESERVE_IRP_TYPE;
enum _CONFIGURATION_TYPE;
enum TEST_HOOK_CALLBACK_ENUM;
enum POWER_SETTING_REGISTRANT_TYPE;
enum _PARTITION_STYLE;
enum POWER_POLICY_DEVICE_TYPE;
struct _LDR_DLL_LOADED_NOTIFICATION_DATA;
enum _THERMAL_CHANNEL;
enum _FT_PARTITION_STATE;
struct _UNICODE_STRING;
struct _PLUGPLAY_CONTROL_DEVICE_CONTROL_DATA;
enum MONITOR_MESSAGE_TYPE;
enum _CC_TEST_EVENT_TYPE;
struct _MMWSL;
enum _OB_PREOP_CALLBACK_STATUS;
enum _PFK_POWER_ACTION_PHASE_ID;
enum NETWORK_OPEN_LOCATION_QUALIFIER;
enum _TYPE_OF_MEMORY;
struct _LIST_ENTRY;
struct _KDEVICE_QUEUE_ENTRY;
struct _WAIT_CONTEXT_BLOCK;
struct _KDEVICE_QUEUE;
struct _KDPC;
struct _DISPATCHER_HEADER;
struct _KEVENT;
struct _DEVICE_OBJECT;
enum _BUS_DATA_TYPE;
enum FT_TYPE;
struct _EMP_LAZY_CALLBACK_BLOCK;
enum _EXCEPTION_DISPOSITION;
enum _SYSTEM_POWER_STATE;
enum _HEADLESS_TERM_SERIAL_PORT;
enum _TIMER_SET_INFORMATION_CLASS;
enum _SECTION_INHERIT;
enum _PCW_CALLBACK_TYPE;
enum _ETW_SESSION_NOTIFICATION_TYPE;
enum _MMFLUSH_TYPE;
struct _PERFINFO_VIRTUAL_ALLOC;
enum _WORKER_FUNCTION;
enum _TPM_BOOT_ENTROPY_RESULT_CODE;
struct _GUID;
enum _TRANSACTIONMANAGER_INFORMATION_CLASS;
struct _GENERIC_MAPPING;
enum _POOL_TYPE;
struct _OBJECT_TYPE_INITIALIZER;
enum _ETW_PROVIDER_STATE;

struct _PREFETCHER_INFORMATION;
struct _PF_METADATA_RECORD;
struct _PF_SECTION_RECORD;
struct _PF_PAGE_RECORD;
struct _REGISTRY_MEMORY_RUN;
struct _PF_SESSION_INFO;
struct _PF_EVENT_VIRTUAL_FREE;
struct _PF_APPLAUNCH_DATA;
struct _PF_FOREGROUND_PROCESS_INFO;
struct _PF_EVENT_HARDFAULT_TS;
struct _LZNT1_FORMAT;
struct _LZNT1_HIBER_WORKSPACE;
union _COMPRESSED_CHUNK_HEADER;
struct _SYSTEM_HOTPATCH_MODULE_QUERY_PARAMETERS32;
struct _MI_MEMORY_NODE;
struct _MI_NODE_COST;
struct _DPC_LOG_INFO;
struct _PFP_PREFETCH_REQUEST_VERIFY;
struct ct_values_s;
struct _MICROCODE_UPDATE_LOCK;
struct _MCUPDATE_CONTEXT;
struct _CM_ALLOC_PAGE;
struct _RTL_NORMALIZATION_LIST;
struct _RTL_NORMALIZATION_LIST_ENTRY;
struct _InbvProgressState;
struct _BT_PROGRESS_INDICATOR;
struct _CM_VIRTUAL_REPLICATION_STACK;
struct _CM_SID_TO_HIVE_MAPPING;
struct _PFFB_ALLOCATION;
struct _RGBQUAD;
struct _SYSTEMTIME;
struct _REG_TZI_FORMAT;
struct _STORAGE_QUERY_VIRTUAL_DISK_SYMBOLIC_LINK_LEV1_REQUEST;
struct _EXP_SL_KMEM_CACHE_PROVIDER;
struct _PFBL_TRACE_INFO;
struct _POOL_DPC_CONTEXT;
struct _HEADLESS_GLOBALS;
struct _KTMOBJECT_NAMESPACE_CONTEXT;
struct _PSP_IFEO_PERF_OPTIONS;
struct _SYSTEM_FIRMWARE_TABLE_HANDLER_NODE;
struct _WDIP_SEM_MEMORY_BLOCK;
struct _BAPD_LIST_ITEM;
struct _KNMI_HANDLER_CALLBACK;
struct _BCryptBufferDesc;
struct _BCryptBuffer;
struct _BCRYPT_PROVIDER_NAME;
struct _MT_RESULT_HEADER;
struct _KSEC_BCRYPT_EX_FUNCTIONS;
struct _CRYPT_PROVIDER_REFS;
struct _CRYPT_PROVIDER_REF;
struct _CRYPT_IMAGE_REF;
struct _TRACKING_BUFFER;
struct _REMOTE_LINK_BUFFER;
struct _LINK_TRACKING_RESPONSE;
struct _LINK_TRACKING_MESSAGE;
struct _BL_LOG_ETW_EVENT;
struct _QueryDirPoolData;
struct _PERFDIAG_GLOBALS;
struct _PERFDIAG_ENABLE_FLAGS_QUERYBUFFER;
struct _CPPORT;
struct _CM_PARSE_CACHE_ENTRY;
struct _POP_SLEEP_DISABLE_ENTRY;
struct _MM_PAGE_ACCESS_ENTRY;
struct _DBGKP_ERROR_PORT;
struct _VOLUME_NUMBER;
struct _STORAGE_SURFACE_VIRTUAL_DISK_LEV1_REQUEST;
struct _VIRTUAL_DISK_EA_BUFFER;
struct _KI_INTINIT_REC;
struct _VERIFIER_STRING_INFO;
struct _WDIP_SEM_INFLIGHT_SCENARIO_TABLE;
struct _RAMDISK_CREATE_OPTIONS;
struct _RAMDISK_CREATE_INPUT;
struct VFWMI_DEVICE_EXTENSION;
struct _KERNSNAP_THREAD_DATA;
struct _LIVE_DUMP_DIAGNOSTIC;
struct _PACKED_BIOS_PARAMETER_BLOCK;
struct BIOS_PARAMETER_BLOCK;
struct _PACKED_BOOT_SECTOR;
struct _XIP_CONFIGURATION;
struct _VI_IO_CALLBACK_STATE;
struct tagSHIMCACHEHEADER;
struct _IOP_SESSION_WORKITEM;
struct _POP_WAKE_INFO;
struct _POP_WAKE_SOURCE_WORK;
struct tagFILEDIRECTORYATTRIBUTES;
struct CgFrame;
struct SkFrame;
struct KbFrame;
struct KhFrame;
struct DiFrame;
struct IhFrame;
struct KfFrame;
struct ShFrame;
struct RcFrame;
class <CrtImplementationDetails>::NativeDll;
class _LocaleUpdate;
struct _is_ctype_compatible;
struct setloc_struct;
struct LjFrame;
struct CaFrame;
struct sockaddr_dl;
struct _LSAP_ADT_OBJECT;
struct _LSAP_ADT_SOURCE;
struct _HEAP_LOCAL_SEGMENT_INFO;
struct _SEGMENT_OBJECT;
struct _HEAP_DEBUGGING_INFORMATION;

#include <pshpack1.h>
typedef struct _IMAGE_INFO
{
  union
  {
    /* 0x0000 */ unsigned long Properties;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long ImageAddressingMode : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned long SystemModeImage : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned long ImageMappedToAllPids : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned long ExtendedInfoPresent : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned long Reserved : 21; /* bit position: 11 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0004 */ long Padding_0;
  /* 0x0008 */ void* ImageBase;
  /* 0x0010 */ unsigned long ImageSelector;
  /* 0x0014 */ long Padding_1;
  /* 0x0018 */ unsigned __int64 ImageSize;
  /* 0x0020 */ unsigned long ImageSectionNumber;
  /* 0x0024 */ long __PADDING__[1];
} IMAGE_INFO, *PIMAGE_INFO; /* size: 0x0028 */

typedef enum _ADJUST_REASON
{
  AdjustNone = 0,
  AdjustUnwait = 1,
  AdjustBoost = 2,
} ADJUST_REASON, *PADJUST_REASON;

enum MCA_EXCEPTION_TYPE
{
  HAL_MCE_RECORD = 0,
  HAL_MCA_RECORD = 1,
};

typedef enum _PPM_PERF_ACTION
{
  PpmPerfActionRecordUtility = 0,
  PpmPerfActionReportUnparkedCore = 1,
  PpmPerfActionApplyDomainState = 2,
  PpmPerfActionForceApplyDomainState = 3,
  PpmPerfActionApplyProcessorState = 4,
  PpmPerfActionReportParkedCore = 5,
  PpmPerfActionMax = 6,
} PPM_PERF_ACTION, *PPPM_PERF_ACTION;

enum POWER_MESSAGE_TYPE
{
  PowerRegisterForPolicyChange = 0,
  PowerUnregisterForPolicyChange = 1,
  PowerRegisterForStateChange = 2,
  PowerUnregisterForStateChange = 3,
  PowerNotifyPolicyChanged = 4,
  PowerNotifyStateInitial = 5,
  PowerNotifyStateChanged = 6,
  PowerNotifyLegacyEvent = 7,
  PowerNotifyBrightnessChanges = 8,
  PowerRequestOverrideQuery = 9,
  PowerRequestOverrideCleanup = 10,
  PowerNotifyServiceInitialization = 11,
};

typedef enum _IOP_RESERVE_IRP_TYPE
{
  IopPagefileReadIrp = 0,
  IopPagefileWriteIrp = 1,
  IopNonPagefileWriteIrp = 2,
  IopMustSucceedIrp = 3,
} IOP_RESERVE_IRP_TYPE, *PIOP_RESERVE_IRP_TYPE;

typedef enum _CONFIGURATION_TYPE
{
  ArcSystem = 0,
  CentralProcessor = 1,
  FloatingPointProcessor = 2,
  PrimaryIcache = 3,
  PrimaryDcache = 4,
  SecondaryIcache = 5,
  SecondaryDcache = 6,
  SecondaryCache = 7,
  EisaAdapter = 8,
  TcAdapter = 9,
  ScsiAdapter = 10,
  DtiAdapter = 11,
  MultiFunctionAdapter = 12,
  DiskController = 13,
  TapeController = 14,
  CdromController = 15,
  WormController = 16,
  SerialController = 17,
  NetworkController = 18,
  DisplayController = 19,
  ParallelController = 20,
  PointerController = 21,
  KeyboardController = 22,
  AudioController = 23,
  OtherController = 24,
  DiskPeripheral = 25,
  FloppyDiskPeripheral = 26,
  TapePeripheral = 27,
  ModemPeripheral = 28,
  MonitorPeripheral = 29,
  PrinterPeripheral = 30,
  PointerPeripheral = 31,
  KeyboardPeripheral = 32,
  TerminalPeripheral = 33,
  OtherPeripheral = 34,
  LinePeripheral = 35,
  NetworkPeripheral = 36,
  SystemMemory = 37,
  DockingInformation = 38,
  RealModeIrqRoutingTable = 39,
  RealModePCIEnumeration = 40,
  MaximumType = 41,
} CONFIGURATION_TYPE, *PCONFIGURATION_TYPE;

enum TEST_HOOK_CALLBACK_ENUM
{
  POP_TH_CALLBACK_SIDLE = 0,
  POP_TH_CALLBACK_REGISTER_IDLE_DETECTION = 1,
  POP_TH_CALLBACK_IDLEDEVICE_NOTIFICATION = 2,
  POP_TH_CALLBACK_IDLEDEVICE_RESET_NOTIFICATION = 3,
  POP_TH_CALLBACK_MAX = 4,
};

enum POWER_SETTING_REGISTRANT_TYPE
{
  PowerRegisterFromWindow = 0,
  PowerRegisterFromService = 1,
  PowerRegisterFromKernelPo = 2,
  PowerRegisterFromUmpo = 3,
};

typedef enum _PARTITION_STYLE
{
  PARTITION_STYLE_MBR = 0,
  PARTITION_STYLE_GPT = 1,
  PARTITION_STYLE_RAW = 2,
} PARTITION_STYLE, *PPARTITION_STYLE;

enum POWER_POLICY_DEVICE_TYPE
{
  PolicyDeviceSystemButton = 0,
  PolicyDeviceThermalZone = 1,
  PolicyDeviceBattery = 2,
  PolicyDeviceMemory = 3,
  PolicyInitiatePowerActionAPI = 4,
  PolicySetPowerStateAPI = 5,
  PolicyImmediateDozeS4 = 6,
  PolicySystemIdle = 7,
  PolicyDeviceMax = 8,
};

typedef struct _LDR_DLL_LOADED_NOTIFICATION_DATA
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ long Padding_2;
  /* 0x0008 */ const struct _UNICODE_STRING* FullDllName;
  /* 0x0010 */ const struct _UNICODE_STRING* BaseDllName;
  /* 0x0018 */ void* DllBase;
  /* 0x0020 */ unsigned long SizeOfImage;
  /* 0x0024 */ long __PADDING__[1];
} LDR_DLL_LOADED_NOTIFICATION_DATA, *PLDR_DLL_LOADED_NOTIFICATION_DATA; /* size: 0x0028 */

typedef enum _THERMAL_CHANNEL
{
  Diagnostic = 0,
  Operational = 1,
  System = 2,
} THERMAL_CHANNEL, *PTHERMAL_CHANNEL;

typedef enum _FT_PARTITION_STATE
{
  Healthy = 0,
  Orphaned = 1,
  Regenerating = 2,
  Initializing = 3,
  SyncRedundantCopy = 4,
} FT_PARTITION_STATE, *PFT_PARTITION_STATE;

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ long Padding_3;
  /* 0x0008 */ unsigned short* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0010 */

typedef struct _PLUGPLAY_CONTROL_DEVICE_CONTROL_DATA
{
  /* 0x0000 */ struct _UNICODE_STRING DeviceInstance;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0014 */ long __PADDING__[1];
} PLUGPLAY_CONTROL_DEVICE_CONTROL_DATA, *PPLUGPLAY_CONTROL_DEVICE_CONTROL_DATA; /* size: 0x0018 */

enum MONITOR_MESSAGE_TYPE
{
  PowerMonitorBrightnessOverride = 0,
  PowerMonitorAlsOffset = 1,
};

typedef enum _CC_TEST_EVENT_TYPE
{
  FailHighPriorityMappings = 0,
  LimitTotalVACBEntries = 1,
  QueryVACBStatistics = 2,
} CC_TEST_EVENT_TYPE, *PCC_TEST_EVENT_TYPE;

typedef struct _MMWSL
{
  /* 0x0000 */ unsigned long FirstFree;
  /* 0x0004 */ unsigned long FirstDynamic;
  /* 0x0008 */ unsigned long LastEntry;
  /* 0x000c */ unsigned long NextSlot;
  /* 0x0010 */ struct _MMWSLE* Wsle;
  /* 0x0018 */ void* LowestPagableAddress;
  /* 0x0020 */ unsigned long LastInitializedWsle;
  /* 0x0024 */ unsigned long NextAgingSlot;
  /* 0x0028 */ unsigned long NumberOfCommittedPageTables;
  /* 0x002c */ unsigned long VadBitMapHint;
  /* 0x0030 */ unsigned long NonDirectCount;
  /* 0x0034 */ unsigned long LastVadBit;
  /* 0x0038 */ unsigned long MaximumLastVadBit;
  /* 0x003c */ unsigned long LastAllocationSizeHint;
  /* 0x0040 */ unsigned long LastAllocationSize;
  /* 0x0044 */ long Padding_4;
  /* 0x0048 */ struct _MMWSLE_NONDIRECT_HASH* NonDirectHash;
  /* 0x0050 */ struct _MMWSLE_HASH* HashTableStart;
  /* 0x0058 */ struct _MMWSLE_HASH* HighestPermittedHashAddress;
  /* 0x0060 */ unsigned long MaximumUserPageTablePages;
  /* 0x0064 */ unsigned long MaximumUserPageDirectoryPages;
  /* 0x0068 */ unsigned long* CommittedPageTables;
  /* 0x0070 */ unsigned long NumberOfCommittedPageDirectories;
  /* 0x0074 */ long Padding_5;
  /* 0x0078 */ unsigned __int64 CommittedPageDirectories[128];
  /* 0x0478 */ unsigned long NumberOfCommittedPageDirectoryParents;
  /* 0x047c */ long Padding_6;
  /* 0x0480 */ unsigned __int64 CommittedPageDirectoryParents[1];
} MMWSL, *PMMWSL; /* size: 0x0488 */

typedef enum _OB_PREOP_CALLBACK_STATUS
{
  OB_PREOP_SUCCESS = 0,
} OB_PREOP_CALLBACK_STATUS, *POB_PREOP_CALLBACK_STATUS;

typedef enum _PFK_POWER_ACTION_PHASE_ID
{
  PfKPowerActionNotifyForSleepPhase = 0,
  PfKPowerActionSleepSystemPhase = 1,
  PfKPowerActionWakeSystemPhase = 2,
  PfKPowerActionDriversResumePhase = 3,
  PfKPowerActionWLRemoveUIPhase = 4,
  PfKPowerActionServicesResumePhase = 5,
  PfKPowerActionAppsResumePhase = 6,
  PfKPowerActionTransitionComplete = 7,
  PfKPowerActionMaxPhase = 8,
} PFK_POWER_ACTION_PHASE_ID, *PPFK_POWER_ACTION_PHASE_ID;

enum NETWORK_OPEN_LOCATION_QUALIFIER
{
  NetworkOpenLocationAny = 0,
  NetworkOpenLocationRemote = 1,
  NetworkOpenLocationLoopback = 2,
};

typedef enum _TYPE_OF_MEMORY
{
  LoaderExceptionBlock = 0,
  LoaderSystemBlock = 1,
  LoaderFree = 2,
  LoaderBad = 3,
  LoaderLoadedProgram = 4,
  LoaderFirmwareTemporary = 5,
  LoaderFirmwarePermanent = 6,
  LoaderOsloaderHeap = 7,
  LoaderOsloaderStack = 8,
  LoaderSystemCode = 9,
  LoaderHalCode = 10,
  LoaderBootDriver = 11,
  LoaderConsoleInDriver = 12,
  LoaderConsoleOutDriver = 13,
  LoaderStartupDpcStack = 14,
  LoaderStartupKernelStack = 15,
  LoaderStartupPanicStack = 16,
  LoaderStartupPcrPage = 17,
  LoaderStartupPdrPage = 18,
  LoaderRegistryData = 19,
  LoaderMemoryData = 20,
  LoaderNlsData = 21,
  LoaderSpecialMemory = 22,
  LoaderBBTMemory = 23,
  LoaderReserve = 24,
  LoaderXIPRom = 25,
  LoaderHALCachedMemory = 26,
  LoaderLargePageFiller = 27,
  LoaderErrorLogMemory = 28,
  LoaderMaximum = 29,
} TYPE_OF_MEMORY, *PTYPE_OF_MEMORY;

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0008 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0010 */

typedef struct _KDEVICE_QUEUE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY DeviceListEntry;
  /* 0x0010 */ unsigned long SortKey;
  /* 0x0014 */ unsigned char Inserted;
  /* 0x0015 */ char __PADDING__[3];
} KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY; /* size: 0x0018 */

typedef struct _WAIT_CONTEXT_BLOCK
{
  /* 0x0000 */ struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;
  /* 0x0018 */ void* DeviceRoutine /* function */;
  /* 0x0020 */ void* DeviceContext;
  /* 0x0028 */ unsigned long NumberOfMapRegisters;
  /* 0x002c */ long Padding_7;
  /* 0x0030 */ void* DeviceObject;
  /* 0x0038 */ void* CurrentIrp;
  /* 0x0040 */ struct _KDPC* BufferChainingDpc;
} WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK; /* size: 0x0048 */

typedef struct _KDEVICE_QUEUE
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ long Padding_8;
  /* 0x0008 */ struct _LIST_ENTRY DeviceListHead;
  /* 0x0018 */ unsigned __int64 Lock;
  union
  {
    /* 0x0020 */ unsigned char Busy;
    struct /* bitfield */
    {
      /* 0x0020 */ __int64 Reserved : 8; /* bit position: 0 */
      /* 0x0020 */ __int64 Hint : 56; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0008 */
} KDEVICE_QUEUE, *PKDEVICE_QUEUE; /* size: 0x0028 */

typedef struct _KDPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Importance;
  /* 0x0002 */ volatile unsigned short Number;
  /* 0x0004 */ long Padding_9;
  /* 0x0008 */ struct _LIST_ENTRY DpcListEntry;
  /* 0x0018 */ void* DeferredRoutine /* function */;
  /* 0x0020 */ void* DeferredContext;
  /* 0x0028 */ void* SystemArgument1;
  /* 0x0030 */ void* SystemArgument2;
  /* 0x0038 */ void* DpcData;
} KDPC, *PKDPC; /* size: 0x0040 */

typedef struct _DISPATCHER_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char Type;
      union
      {
        /* 0x0001 */ unsigned char TimerControlFlags;
        struct /* bitfield */
        {
          /* 0x0001 */ unsigned char Absolute : 1; /* bit position: 0 */
          /* 0x0001 */ unsigned char Coalescable : 1; /* bit position: 1 */
          /* 0x0001 */ unsigned char KeepShifting : 1; /* bit position: 2 */
          /* 0x0001 */ unsigned char EncodedTolerableDelay : 5; /* bit position: 3 */
        }; /* bitfield */
        /* 0x0001 */ unsigned char Abandoned;
        struct
        {
          /* 0x0001 */ unsigned char Signalling;
          union
          {
            /* 0x0002 */ unsigned char ThreadControlFlags;
            struct /* bitfield */
            {
              /* 0x0002 */ unsigned char CpuThrottled : 1; /* bit position: 0 */
              /* 0x0002 */ unsigned char CycleProfiling : 1; /* bit position: 1 */
              /* 0x0002 */ unsigned char CounterProfiling : 1; /* bit position: 2 */
              /* 0x0002 */ unsigned char Reserved : 5; /* bit position: 3 */
            }; /* bitfield */
            /* 0x0002 */ unsigned char Hand;
            struct
            {
              /* 0x0002 */ unsigned char Size;
              union
              {
                /* 0x0003 */ unsigned char TimerMiscFlags;
                struct /* bitfield */
                {
                  /* 0x0003 */ unsigned char Index : 6; /* bit position: 0 */
                  /* 0x0003 */ unsigned char Inserted : 1; /* bit position: 6 */
                  /* 0x0003 */ volatile unsigned char Expired : 1; /* bit position: 7 */
                }; /* bitfield */
                /* 0x0003 */ unsigned char DebugActive;
                struct /* bitfield */
                {
                  /* 0x0003 */ unsigned char ActiveDR7 : 1; /* bit position: 0 */
                  /* 0x0003 */ unsigned char Instrumented : 1; /* bit position: 1 */
                  /* 0x0003 */ unsigned char Reserved2 : 4; /* bit position: 2 */
                  /* 0x0003 */ unsigned char UmsScheduled : 1; /* bit position: 6 */
                  /* 0x0003 */ unsigned char UmsPrimary : 1; /* bit position: 7 */
                }; /* bitfield */
                /* 0x0003 */ unsigned char DpcActive;
              }; /* size: 0x0001 */
            }; /* size: 0x0002 */
          }; /* size: 0x0002 */
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    /* 0x0000 */ volatile long Lock;
  }; /* size: 0x0004 */
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0018 */

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0018 */

typedef struct _DEVICE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long ReferenceCount;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0010 */ struct _DEVICE_OBJECT* NextDevice;
  /* 0x0018 */ struct _DEVICE_OBJECT* AttachedDevice;
  /* 0x0020 */ struct _IRP* CurrentIrp;
  /* 0x0028 */ struct _IO_TIMER* Timer;
  /* 0x0030 */ unsigned long Flags;
  /* 0x0034 */ unsigned long Characteristics;
  /* 0x0038 */ struct _VPB* Vpb;
  /* 0x0040 */ void* DeviceExtension;
  /* 0x0048 */ unsigned long DeviceType;
  /* 0x004c */ char StackSize;
  /* 0x004d */ char Padding_10[3];
  union
  {
    union
    {
      /* 0x0050 */ struct _LIST_ENTRY ListEntry;
      /* 0x0050 */ struct _WAIT_CONTEXT_BLOCK Wcb;
    }; /* size: 0x0048 */
  } /* size: 0x0048 */ Queue;
  /* 0x0098 */ unsigned long AlignmentRequirement;
  /* 0x009c */ long Padding_11;
  /* 0x00a0 */ struct _KDEVICE_QUEUE DeviceQueue;
  /* 0x00c8 */ struct _KDPC Dpc;
  /* 0x0108 */ unsigned long ActiveThreadCount;
  /* 0x010c */ long Padding_12;
  /* 0x0110 */ void* SecurityDescriptor;
  /* 0x0118 */ struct _KEVENT DeviceLock;
  /* 0x0130 */ unsigned short SectorSize;
  /* 0x0132 */ unsigned short Spare1;
  /* 0x0134 */ long Padding_13;
  /* 0x0138 */ struct _DEVOBJ_EXTENSION* DeviceObjectExtension;
  /* 0x0140 */ void* Reserved;
  /* 0x0148 */ long __PADDING__[2];
} DEVICE_OBJECT, *PDEVICE_OBJECT; /* size: 0x0150 */

typedef enum _BUS_DATA_TYPE
{
  ConfigurationSpaceUndefined = -1,
  Cmos = 0,
  EisaConfiguration = 1,
  Pos = 2,
  CbusConfiguration = 3,
  PCIConfiguration = 4,
  VMEConfiguration = 5,
  NuBusConfiguration = 6,
  PCMCIAConfiguration = 7,
  MPIConfiguration = 8,
  MPSAConfiguration = 9,
  PNPISAConfiguration = 10,
  SgiInternalConfiguration = 11,
  MaximumBusDataType = 12,
} BUS_DATA_TYPE, *PBUS_DATA_TYPE;

enum FT_TYPE
{
  Mirror = 0,
  Stripe = 1,
  StripeWithParity = 2,
  VolumeSet = 3,
  NotAnFtMember = 4,
  WholeDisk = 5,
};

typedef struct _EMP_LAZY_CALLBACK_BLOCK
{
  /* 0x0000 */ void* LazyCallback /* function */;
  /* 0x0008 */ void* LazyCallbackContext;
  /* 0x0010 */ struct _LIST_ENTRY EntryLazyCallbackList;
} EMP_LAZY_CALLBACK_BLOCK, *PEMP_LAZY_CALLBACK_BLOCK; /* size: 0x0020 */

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _SYSTEM_POWER_STATE
{
  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7,
} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _HEADLESS_TERM_SERIAL_PORT
{
  SerialPortUndefined = 0,
  ComPort1 = 1,
  ComPort2 = 2,
  ComPort3 = 3,
  ComPort4 = 4,
} HEADLESS_TERM_SERIAL_PORT, *PHEADLESS_TERM_SERIAL_PORT;

typedef enum _TIMER_SET_INFORMATION_CLASS
{
  TimerSetCoalescableTimer = 0,
  MaxTimerInfoClass = 1,
} TIMER_SET_INFORMATION_CLASS, *PTIMER_SET_INFORMATION_CLASS;

typedef enum _SECTION_INHERIT
{
  ViewShare = 1,
  ViewUnmap = 2,
} SECTION_INHERIT, *PSECTION_INHERIT;

typedef enum _PCW_CALLBACK_TYPE
{
  PcwCallbackAddCounter = 0,
  PcwCallbackRemoveCounter = 1,
  PcwCallbackEnumerateInstances = 2,
  PcwCallbackCollectData = 3,
} PCW_CALLBACK_TYPE, *PPCW_CALLBACK_TYPE;

typedef enum _ETW_SESSION_NOTIFICATION_TYPE
{
  EtwSessionNotificationMediaChanged = 1,
  EtwSessionNotificationSessionTerminated = 2,
  EtwSessionNotificationLogfileError = 3,
  EtwSessionNotificationRealtimeError = 4,
  EtwSessionNotificationSessionStarted = 5,
  EtwSessionNotificationMax = 6,
} ETW_SESSION_NOTIFICATION_TYPE, *PETW_SESSION_NOTIFICATION_TYPE;

typedef enum _MMFLUSH_TYPE
{
  MmFlushForDelete = 0,
  MmFlushForWrite = 1,
} MMFLUSH_TYPE, *PMMFLUSH_TYPE;

typedef struct _PERFINFO_VIRTUAL_ALLOC
{
  /* 0x0000 */ void* CapturedBase;
  /* 0x0008 */ unsigned __int64 CapturedRegionSize;
  /* 0x0010 */ unsigned long ProcessId;
  /* 0x0014 */ unsigned long Flags;
} PERFINFO_VIRTUAL_ALLOC, *PPERFINFO_VIRTUAL_ALLOC; /* size: 0x0018 */

typedef enum _WORKER_FUNCTION
{
  Noop = 0,
  ReadAhead = 1,
  WriteBehind = 2,
  LazyWriteScan = 3,
  EventSet = 4,
} WORKER_FUNCTION, *PWORKER_FUNCTION;

typedef enum _TPM_BOOT_ENTROPY_RESULT_CODE
{
  TpmBootEntropyStructureUninitialized = 0,
  TpmBootEntropyDisabledByPolicy = 1,
  TpmBootEntropyNoTpmFound = 2,
  TpmBootEntropyTpmError = 3,
  TpmBootEntropySuccess = 4,
} TPM_BOOT_ENTROPY_RESULT_CODE, *PTPM_BOOT_ENTROPY_RESULT_CODE;

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef enum _TRANSACTIONMANAGER_INFORMATION_CLASS
{
  TransactionManagerBasicInformation = 0,
  TransactionManagerLogInformation = 1,
  TransactionManagerLogPathInformation = 2,
  TransactionManagerRecoveryInformation = 4,
  TransactionManagerOnlineProbeInformation = 3,
  TransactionManagerOldestTransactionInformation = 5,
} TRANSACTIONMANAGER_INFORMATION_CLASS, *PTRANSACTIONMANAGER_INFORMATION_CLASS;

typedef struct _GENERIC_MAPPING
{
  /* 0x0000 */ unsigned long GenericRead;
  /* 0x0004 */ unsigned long GenericWrite;
  /* 0x0008 */ unsigned long GenericExecute;
  /* 0x000c */ unsigned long GenericAll;
} GENERIC_MAPPING, *PGENERIC_MAPPING; /* size: 0x0010 */

typedef enum _POOL_TYPE
{
  NonPagedPool = 0,
  PagedPool = 1,
  NonPagedPoolMustSucceed = 2,
  DontUseThisType = 3,
  NonPagedPoolCacheAligned = 4,
  PagedPoolCacheAligned = 5,
  NonPagedPoolCacheAlignedMustS = 6,
  MaxPoolType = 7,
  NonPagedPoolSession = 32,
  PagedPoolSession = 33,
  NonPagedPoolMustSucceedSession = 34,
  DontUseThisTypeSession = 35,
  NonPagedPoolCacheAlignedSession = 36,
  PagedPoolCacheAlignedSession = 37,
  NonPagedPoolCacheAlignedMustSSession = 38,
} POOL_TYPE, *PPOOL_TYPE;

typedef struct _OBJECT_TYPE_INITIALIZER
{
  /* 0x0000 */ unsigned short Length;
  union
  {
    /* 0x0002 */ unsigned char ObjectTypeFlags;
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned char CaseInsensitive : 1; /* bit position: 0 */
      /* 0x0002 */ unsigned char UnnamedObjectsOnly : 1; /* bit position: 1 */
      /* 0x0002 */ unsigned char UseDefaultObject : 1; /* bit position: 2 */
      /* 0x0002 */ unsigned char SecurityRequired : 1; /* bit position: 3 */
      /* 0x0002 */ unsigned char MaintainHandleCount : 1; /* bit position: 4 */
      /* 0x0002 */ unsigned char MaintainTypeList : 1; /* bit position: 5 */
      /* 0x0002 */ unsigned char SupportsObjectCallbacks : 1; /* bit position: 6 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0003 */ char Padding_14;
  /* 0x0004 */ unsigned long ObjectTypeCode;
  /* 0x0008 */ unsigned long InvalidAttributes;
  /* 0x000c */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x001c */ unsigned long ValidAccessMask;
  /* 0x0020 */ unsigned long RetainAccess;
  /* 0x0024 */ enum _POOL_TYPE PoolType;
  /* 0x0028 */ unsigned long DefaultPagedPoolCharge;
  /* 0x002c */ unsigned long DefaultNonPagedPoolCharge;
  /* 0x0030 */ void* DumpProcedure /* function */;
  /* 0x0038 */ void* OpenProcedure /* function */;
  /* 0x0040 */ void* CloseProcedure /* function */;
  /* 0x0048 */ void* DeleteProcedure /* function */;
  /* 0x0050 */ void* ParseProcedure /* function */;
  /* 0x0058 */ void* SecurityProcedure /* function */;
  /* 0x0060 */ void* QueryNameProcedure /* function */;
  /* 0x0068 */ void* OkayToCloseProcedure /* function */;
} OBJECT_TYPE_INITIALIZER, *POBJECT_TYPE_INITIALIZER; /* size: 0x0070 */

typedef enum _ETW_PROVIDER_STATE
{
  EtwProviderStateFree = 0,
  EtwProviderStateTransition = 1,
  EtwProviderStateActive = 2,
  EtwProviderStateMax = 3,
} ETW_PROVIDER_STATE, *PETW_PROVIDER_STATE;

typedef enum _WORKER_FACTORY_CALLBACK_CLASS
{
  WorkerFactoryCallbackNormal = 0,
  WorkerFactoryCallbackLongRunning = 1,
  WorkerFactoryCallbackIndependent = 2,
} WORKER_FACTORY_CALLBACK_CLASS, *PWORKER_FACTORY_CALLBACK_CLASS;

typedef struct _PS_CPU_QUOTA_QUERY_ENTRY
{
  /* 0x0000 */ unsigned long SessionId;
  /* 0x0004 */ unsigned long Weight;
} PS_CPU_QUOTA_QUERY_ENTRY, *PPS_CPU_QUOTA_QUERY_ENTRY; /* size: 0x0008 */

typedef enum _WHEA_ERROR_SEVERITY
{
  WheaErrSevRecoverable = 0,
  WheaErrSevFatal = 1,
  WheaErrSevCorrected = 2,
  WheaErrSevInformational = 3,
} WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

enum WMISERVICECODES
{
  WmiReadNotifications = 64,
  WmiGetNextRegistrant = 65,
  WmiOpenGuid = 66,
  WmiNotifyUser = 67,
  WmiGetAllRegistrant = 68,
  WmiGenerateEvent = 69,
  WmiTranslateFileHandle = 71,
  WmiGetVersion = 73,
  WmiCheckAccess = 74,
  WmiQueryAllMultiple = 75,
  WmiQuerySingleMultiple = 76,
  WmiEnumerateGuidList = 77,
  WmiQueryDataBlockInformation = 78,
  WmiOpenGuidForQuerySet = 79,
  WmiOpenGuidForEvents = 80,
  WmiReceiveNotif = 81,
  WmiEnableDisableTracelogProvider = 82,
  WmiRegisterGuids = 83,
  WmiSendDB = 84,
  WmiReplyDB = 85,
  WmiEnumerateMofResouces = 86,
  WmiUnregisterDP = 87,
  WmiEnumerateGuidListAndProperties = 88,
  WmiNotifyLanguageChange = 89,
  WmiMarkHandleAsClosed = 90,
  WmiRealtimeConnect = 91,
};

typedef enum _RTL_GENERIC_COMPARE_RESULTS
{
  GenericLessThan = 0,
  GenericGreaterThan = 1,
  GenericEqual = 2,
} RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

typedef enum _KINTERRUPT_POLARITY
{
  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptActiveLow = 2,
} KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

enum MARK_TYPE
{
  MARKTYPE_DELETED = 0,
  MARKTYPE_BOTTOM_OF_FDO_STACK = 1,
  MARKTYPE_DESIGNATED_FDO = 2,
  MARKTYPE_RAW_PDO = 3,
  MARKTYPE_DEVICE_CHECKED = 4,
  MARKTYPE_RELATION_PDO_EXAMINED = 5,
};

typedef enum _IO_QUERY_DEVICE_DATA_FORMAT
{
  IoQueryDeviceIdentifier = 0,
  IoQueryDeviceConfigurationData = 1,
  IoQueryDeviceComponentInformation = 2,
  IoQueryDeviceMaxData = 3,
} IO_QUERY_DEVICE_DATA_FORMAT, *PIO_QUERY_DEVICE_DATA_FORMAT;

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _ACPI_REG_TYPE
{
  PM1a_ENABLE = 0,
  PM1b_ENABLE = 1,
  PM1a_STATUS = 2,
  PM1b_STATUS = 3,
  PM1a_CONTROL = 4,
  PM1b_CONTROL = 5,
  GP_STATUS = 6,
  GP_ENABLE = 7,
  SMI_CMD = 8,
  MaxRegType = 9,
} ACPI_REG_TYPE, *PACPI_REG_TYPE;

typedef struct _OBJECT_DUMP_CONTROL
{
  /* 0x0000 */ void* Stream;
  /* 0x0008 */ unsigned long Detail;
  /* 0x000c */ long __PADDING__[1];
} OBJECT_DUMP_CONTROL, *POBJECT_DUMP_CONTROL; /* size: 0x0010 */

typedef enum _KWAIT_SIGNAL_TYPE
{
  SignalTypeSynch = 0,
  SignalTypeNotify = 1,
  MaximumSignalType = 2,
} KWAIT_SIGNAL_TYPE, *PKWAIT_SIGNAL_TYPE;

typedef enum _PNP_VETO_TYPE
{
  PNP_VetoTypeUnknown = 0,
  PNP_VetoLegacyDevice = 1,
  PNP_VetoPendingClose = 2,
  PNP_VetoWindowsApp = 3,
  PNP_VetoWindowsService = 4,
  PNP_VetoOutstandingOpen = 5,
  PNP_VetoDevice = 6,
  PNP_VetoDriver = 7,
  PNP_VetoIllegalDeviceRequest = 8,
  PNP_VetoInsufficientPower = 9,
  PNP_VetoNonDisableable = 10,
  PNP_VetoLegacyDriver = 11,
  PNP_VetoInsufficientRights = 12,
} PNP_VETO_TYPE, *PPNP_VETO_TYPE;

enum tagWMIACTIONCODE
{
  WmiGetAllData = 0,
  WmiGetSingleInstance = 1,
  WmiChangeSingleInstance = 2,
  WmiChangeSingleItem = 3,
  WmiEnableEvents = 4,
  WmiDisableEvents = 5,
  WmiEnableCollection = 6,
  WmiDisableCollection = 7,
  WmiRegisterInfo = 8,
  WmiExecuteMethodCall = 9,
};

enum VF_PENDING_DEFER_OPTION
{
  VfPendingDeferPassiveTimer = 1,
  VfPendingDeferDispatchTimer = 2,
};

typedef enum _MM_PAGE_ACCESS_TYPE
{
  MmPteAccessType = 0,
  MmCcReadAheadType = 1,
  MmPfnRepurposeType = 2,
  MmMaximumPageAccessType = 3,
} MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned __int64 Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0010 */

typedef struct _FILE_IO_COMPLETION_INFORMATION
{
  /* 0x0000 */ void* KeyContext;
  /* 0x0008 */ void* ApcContext;
  /* 0x0010 */ struct _IO_STATUS_BLOCK IoStatusBlock;
} FILE_IO_COMPLETION_INFORMATION, *PFILE_IO_COMPLETION_INFORMATION; /* size: 0x0020 */

typedef enum _KSTACK_TYPE
{
  ReserveStackNormal = 0,
  ReserveStackLarge = 1,
  MaximumReserveStacks = 2,
} KSTACK_TYPE, *PKSTACK_TYPE;

typedef struct _SM_STORE_MANAGER_CONTEXT
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Initialized : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Spare : 31; /* bit position: 1 */
  }; /* bitfield */
  /* 0x0004 */ long Padding_15;
  /* 0x0008 */ void* ControlDeviceHandle;
  /* 0x0010 */ struct _DEVICE_OBJECT* ControlDeviceObject;
} SM_STORE_MANAGER_CONTEXT, *PSM_STORE_MANAGER_CONTEXT; /* size: 0x0018 */

typedef enum _CLFS_MGMT_NOTIFICATION_TYPE
{
  ClfsMgmtAdvanceTailNotification = 0,
  ClfsMgmtLogFullHandlerNotification = 1,
  ClfsMgmtLogUnpinnedNotification = 2,
  ClfsMgmtLogWriteNotification = 3,
} CLFS_MGMT_NOTIFICATION_TYPE, *PCLFS_MGMT_NOTIFICATION_TYPE;

typedef enum _IO_ACCESS_MODE
{
  SequentialAccess = 0,
  RandomAccess = 1,
} IO_ACCESS_MODE, *PIO_ACCESS_MODE;

typedef union _ULARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} ULARGE_INTEGER, *PULARGE_INTEGER; /* size: 0x0008 */

typedef struct _KTIMER_TABLE_ENTRY
{
  /* 0x0000 */ unsigned __int64 Lock;
  /* 0x0008 */ struct _LIST_ENTRY Entry;
  /* 0x0018 */ union _ULARGE_INTEGER Time;
} KTIMER_TABLE_ENTRY, *PKTIMER_TABLE_ENTRY; /* size: 0x0020 */

typedef enum _PS_IFEO_KEY_STATE
{
  PsReadIFEOAllValues = 0,
  PsSkipIFEODebugger = 1,
  PsSkipAllIFEO = 2,
  PsMaxIFEOKeyStates = 3,
} PS_IFEO_KEY_STATE, *PPS_IFEO_KEY_STATE;

typedef enum _VALUE_SEARCH_RETURN_TYPE
{
  SearchSuccess = 0,
  SearchNeedExclusiveLock = 1,
  SearchFail = 2,
} VALUE_SEARCH_RETURN_TYPE, *PVALUE_SEARCH_RETURN_TYPE;

typedef struct _SYSTEM_VA_LIST_INFORMATION
{
  /* 0x0000 */ unsigned __int64 VirtualSize;
  /* 0x0008 */ unsigned __int64 VirtualPeak;
  /* 0x0010 */ unsigned __int64 VirtualLimit;
  /* 0x0018 */ unsigned __int64 AllocationFailures;
} SYSTEM_VA_LIST_INFORMATION, *PSYSTEM_VA_LIST_INFORMATION; /* size: 0x0020 */

typedef enum _PF_HARD_FAULT_TYPE
{
  PfHardFaultTypeDisk = 0,
  PfHardFaultTypeFileStore = 1,
  PfHardFaultTypeInMemoryStore = 2,
  PfHardFaultTypeMax = 3,
} PF_HARD_FAULT_TYPE, *PPF_HARD_FAULT_TYPE;

typedef struct _PSEUDO_DESCRIPTOR_32
{
  /* 0x0000 */ unsigned short Limit;
  /* 0x0002 */ unsigned long Base;
} PSEUDO_DESCRIPTOR_32, *PPSEUDO_DESCRIPTOR_32; /* size: 0x0006 */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileAttributeCacheInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileMaximumInformation = 56,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

enum SWITCH_CONTEXT_PLATFORM_ID
{
  VISTA_ID = 0,
  WIN7_ID = 1,
  MAX_SUPPORTED_PLATFORM_COUNT = 2,
};

typedef struct _AMD64_M128
{
  /* 0x0000 */ unsigned __int64 Low;
  /* 0x0008 */ __int64 High;
} AMD64_M128, *PAMD64_M128; /* size: 0x0010 */

typedef struct _AMD64_LEGACY_SAVE_AREA
{
  /* 0x0000 */ unsigned short ControlWord;
  /* 0x0002 */ unsigned short StatusWord;
  /* 0x0004 */ unsigned char TagWord;
  /* 0x0005 */ unsigned char Reserved1;
  /* 0x0006 */ unsigned short ErrorOpcode;
  /* 0x0008 */ unsigned long ErrorOffset;
  /* 0x000c */ unsigned short ErrorSelector;
  /* 0x000e */ unsigned short Reserved2;
  /* 0x0010 */ unsigned long DataOffset;
  /* 0x0014 */ unsigned short DataSelector;
  /* 0x0016 */ unsigned short Reserved3;
  /* 0x0018 */ unsigned long MxCsr;
  /* 0x001c */ unsigned long MxCsr_Mask;
  /* 0x0020 */ struct _AMD64_M128 FloatRegisters[8];
} AMD64_LEGACY_SAVE_AREA, *PAMD64_LEGACY_SAVE_AREA; /* size: 0x00a0 */

typedef struct _PS_ATTRIBUTE
{
  /* 0x0000 */ unsigned __int64 Attribute;
  /* 0x0008 */ unsigned __int64 Size;
  union
  {
    /* 0x0010 */ unsigned __int64 Value;
    /* 0x0010 */ void* ValuePtr;
  }; /* size: 0x0008 */
  /* 0x0018 */ unsigned __int64* ReturnLength;
} PS_ATTRIBUTE, *PPS_ATTRIBUTE; /* size: 0x0020 */

enum SeCmAuditType
{
  AuditSetRegValueNew = 0,
  AuditSetRegValueExisting = 1,
  AuditDeleteRegValue = 2,
};

typedef union _SLIST_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned __int64 Alignment;
      /* 0x0008 */ unsigned __int64 Region;
    }; /* size: 0x0010 */
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 9; /* bit position: 16 */
        /* 0x0000 */ unsigned __int64 NextEntry : 39; /* bit position: 25 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Init : 1; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 Reserved : 59; /* bit position: 2 */
        /* 0x0008 */ unsigned __int64 Region : 3; /* bit position: 61 */
      }; /* bitfield */
    } /* size: 0x0010 */ Header8;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 48; /* bit position: 16 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Init : 1; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 Reserved : 2; /* bit position: 2 */
        /* 0x0008 */ unsigned __int64 NextEntry : 60; /* bit position: 4 */
      }; /* bitfield */
    } /* size: 0x0010 */ Header16;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 48; /* bit position: 16 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Reserved : 3; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 NextEntry : 60; /* bit position: 4 */
      }; /* bitfield */
    } /* size: 0x0010 */ HeaderX64;
  }; /* size: 0x0010 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0010 */

typedef struct _GROUP_AFFINITY
{
  /* 0x0000 */ unsigned __int64 Mask;
  /* 0x0008 */ unsigned short Group;
  /* 0x000a */ unsigned short Reserved[3];
} GROUP_AFFINITY, *PGROUP_AFFINITY; /* size: 0x0010 */

typedef struct _flags
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char Removable : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char GroupAssigned : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char GroupCommitted : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char GroupAssignmentFixed : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char Fill : 4; /* bit position: 4 */
  }; /* bitfield */
} flags, *Pflags; /* size: 0x0001 */

typedef struct _CACHED_KSTACK_LIST
{
  /* 0x0000 */ union _SLIST_HEADER SListHead;
  /* 0x0010 */ long MinimumFree;
  /* 0x0014 */ unsigned long Misses;
  /* 0x0018 */ unsigned long MissesLast;
  /* 0x001c */ unsigned long Pad0;
} CACHED_KSTACK_LIST, *PCACHED_KSTACK_LIST; /* size: 0x0020 */

typedef struct _KNODE
{
  /* 0x0000 */ union _SLIST_HEADER PagedPoolSListHead;
  /* 0x0010 */ union _SLIST_HEADER NonPagedPoolSListHead[3];
  /* 0x0040 */ struct _GROUP_AFFINITY Affinity;
  /* 0x0050 */ unsigned long ProximityId;
  /* 0x0054 */ unsigned short NodeNumber;
  /* 0x0056 */ unsigned short PrimaryNodeNumber;
  /* 0x0058 */ unsigned char MaximumProcessors;
  /* 0x0059 */ unsigned char Color;
  /* 0x005a */ struct _flags Flags;
  /* 0x005b */ unsigned char NodePad0;
  /* 0x005c */ unsigned long Seed;
  /* 0x0060 */ unsigned long MmShiftedColor;
  /* 0x0064 */ long Padding_16;
  /* 0x0068 */ volatile unsigned __int64 FreeCount[2];
  /* 0x0078 */ unsigned long Right;
  /* 0x007c */ unsigned long Left;
  /* 0x0080 */ struct _CACHED_KSTACK_LIST CachedKernelStacks;
  /* 0x00a0 */ long ParkLock;
  /* 0x00a4 */ unsigned long NodePad1;
  /* 0x00a8 */ long __PADDING__[6];
} KNODE, *PKNODE; /* size: 0x00c0 */

typedef enum _DEBUG_CONTROL_SPACE_ITEM
{
  DEBUG_CONTROL_SPACE_PCR = 0,
  DEBUG_CONTROL_SPACE_PRCB = 1,
  DEBUG_CONTROL_SPACE_KSPECIAL = 2,
  DEBUG_CONTROL_SPACE_THREAD = 3,
  DEBUG_CONTROL_SPACE_MAXIMUM = 4,
} DEBUG_CONTROL_SPACE_ITEM, *PDEBUG_CONTROL_SPACE_ITEM;

typedef struct _DBGKM_CREATE_THREAD
{
  /* 0x0000 */ unsigned long SubSystemKey;
  /* 0x0004 */ long Padding_17;
  /* 0x0008 */ void* StartAddress;
} DBGKM_CREATE_THREAD, *PDBGKM_CREATE_THREAD; /* size: 0x0010 */

typedef struct _DBGKM_CREATE_PROCESS
{
  /* 0x0000 */ unsigned long SubSystemKey;
  /* 0x0004 */ long Padding_18;
  /* 0x0008 */ void* FileHandle;
  /* 0x0010 */ void* BaseOfImage;
  /* 0x0018 */ unsigned long DebugInfoFileOffset;
  /* 0x001c */ unsigned long DebugInfoSize;
  /* 0x0020 */ struct _DBGKM_CREATE_THREAD InitialThread;
} DBGKM_CREATE_PROCESS, *PDBGKM_CREATE_PROCESS; /* size: 0x0030 */

typedef enum _INTENT_LOCK_TYPE
{
  KCBLock = 0,
  KeyLock = 1,
} INTENT_LOCK_TYPE, *PINTENT_LOCK_TYPE;

typedef enum _TOKEN_INFORMATION_CLASS
{
  TokenUser = 1,
  TokenGroups = 2,
  TokenPrivileges = 3,
  TokenOwner = 4,
  TokenPrimaryGroup = 5,
  TokenDefaultDacl = 6,
  TokenSource = 7,
  TokenType = 8,
  TokenImpersonationLevel = 9,
  TokenStatistics = 10,
  TokenRestrictedSids = 11,
  TokenSessionId = 12,
  TokenGroupsAndPrivileges = 13,
  TokenSessionReference = 14,
  TokenSandBoxInert = 15,
  TokenAuditPolicy = 16,
  TokenOrigin = 17,
  TokenElevationType = 18,
  TokenLinkedToken = 19,
  TokenElevation = 20,
  TokenHasRestrictions = 21,
  TokenAccessInformation = 22,
  TokenVirtualizationAllowed = 23,
  TokenVirtualizationEnabled = 24,
  TokenIntegrityLevel = 25,
  TokenUIAccess = 26,
  TokenMandatoryPolicy = 27,
  TokenLogonSid = 28,
  MaxTokenInfoClass = 29,
} TOKEN_INFORMATION_CLASS, *PTOKEN_INFORMATION_CLASS;

typedef struct _PCI_PMCSR_BSE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char Rsvd1 : 6; /* bit position: 0 */
    /* 0x0000 */ unsigned char D3HotSupportsStopClock : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char BusPowerClockControlEnabled : 1; /* bit position: 7 */
  }; /* bitfield */
} PCI_PMCSR_BSE, *PPCI_PMCSR_BSE; /* size: 0x0001 */

typedef struct __PUBLIC_OBJECT_TYPE_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING TypeName;
  /* 0x0010 */ unsigned long Reserved[22];
} _PUBLIC_OBJECT_TYPE_INFORMATION, *P_PUBLIC_OBJECT_TYPE_INFORMATION; /* size: 0x0068 */

typedef enum _MM_PAGE_PRIORITY
{
  LowPagePriority = 0,
  NormalPagePriority = 16,
  HighPagePriority = 32,
} MM_PAGE_PRIORITY, *PMM_PAGE_PRIORITY;

enum PROFILE_DEPARTURE_STYLE
{
  PDS_UPDATE_DEFAULT = 1,
  PDS_UPDATE_ON_REMOVE = 2,
  PDS_UPDATE_ON_INTERFACE = 3,
  PDS_UPDATE_ON_EJECT = 4,
};

typedef struct _PHYSICAL_TO_VIRTUAL
{
  /* 0x0000 */ unsigned long Status;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ unsigned __int64 PdeAddress;
} PHYSICAL_TO_VIRTUAL, *PPHYSICAL_TO_VIRTUAL; /* size: 0x0010 */

typedef struct _PCI_PMCSR
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short PowerState : 2; /* bit position: 0 */
    /* 0x0000 */ unsigned short Rsvd1 : 6; /* bit position: 2 */
    /* 0x0000 */ unsigned short PMEEnable : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned short DataSelect : 4; /* bit position: 9 */
    /* 0x0000 */ unsigned short DataScale : 2; /* bit position: 13 */
    /* 0x0000 */ unsigned short PMEStatus : 1; /* bit position: 15 */
  }; /* bitfield */
} PCI_PMCSR, *PPCI_PMCSR; /* size: 0x0002 */

typedef enum _OB_OPEN_REASON
{
  ObCreateHandle = 0,
  ObOpenHandle = 1,
  ObDuplicateHandle = 2,
  ObInheritHandle = 3,
  ObMaxOpenReason = 4,
} OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _EX_POOL_PRIORITY
{
  LowPoolPriority = 0,
  LowPoolPrioritySpecialPoolOverrun = 8,
  LowPoolPrioritySpecialPoolUnderrun = 9,
  NormalPoolPriority = 16,
  NormalPoolPrioritySpecialPoolOverrun = 24,
  NormalPoolPrioritySpecialPoolUnderrun = 25,
  HighPoolPriority = 32,
  HighPoolPrioritySpecialPoolOverrun = 40,
  HighPoolPrioritySpecialPoolUnderrun = 41,
} EX_POOL_PRIORITY, *PEX_POOL_PRIORITY;

typedef enum _SUBKEY_SEARCH_TYPE
{
  SearchIfExist = 0,
  SearchAndDeref = 1,
  SearchAndCount = 2,
  SearchAndRehash = 3,
  SearchAndTagNoDelayClose = 4,
} SUBKEY_SEARCH_TYPE, *PSUBKEY_SEARCH_TYPE;

typedef enum _LOGICAL_PROCESSOR_RELATIONSHIP
{
  RelationProcessorCore = 0,
  RelationNumaNode = 1,
  RelationCache = 2,
  RelationProcessorPackage = 3,
  RelationGroup = 4,
  RelationAll = 0xffffffff,
} LOGICAL_PROCESSOR_RELATIONSHIP, *PLOGICAL_PROCESSOR_RELATIONSHIP;

typedef enum _COVERAGE_REQUEST_CODES
{
  CoverageAllModules = 0,
  CoverageSearchByHash = 1,
  CoverageSearchByName = 2,
} COVERAGE_REQUEST_CODES, *PCOVERAGE_REQUEST_CODES;

typedef enum _CMP_COPY_TYPE
{
  Copy = 0,
  Sync = 1,
  Merge = 2,
} CMP_COPY_TYPE, *PCMP_COPY_TYPE;

typedef union _WHEA_PCIEXPRESS_ERROR_SECTION_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 PortType : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Version : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 CommandStatus : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 DeviceId : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 DeviceSerialNumber : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 BridgeControlStatus : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned __int64 ExpressCapability : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned __int64 AerInfo : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned __int64 Reserved : 56; /* bit position: 8 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 ValidBits;
  }; /* size: 0x0008 */
} WHEA_PCIEXPRESS_ERROR_SECTION_VALIDBITS, *PWHEA_PCIEXPRESS_ERROR_SECTION_VALIDBITS; /* size: 0x0008 */

typedef enum _HAL_PLATFORM_TIMER_SOURCE
{
  HalPlatformTimerNotSpecified = 0,
  HalPlatformTimer8254 = 1,
  HalPlatformTimerRtc = 2,
  HalPlatformTimerAcpi = 3,
  HalPlatformTimerAcpiBroken = 4,
  HalPlatformTimerHpet = 5,
  HalPlatformTimerProcessorCounter = 6,
  HalPlatformTimerHvReferenceTime = 7,
} HAL_PLATFORM_TIMER_SOURCE, *PHAL_PLATFORM_TIMER_SOURCE;

typedef struct _ENUM_HANDLES_CONTEXT
{
  /* 0x0000 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0008 */ struct _UNICODE_STRING* TargetDeviceInstance;
  /* 0x0010 */ unsigned long DumpHandles;
  /* 0x0014 */ unsigned long EnableLogging;
  /* 0x0018 */ unsigned long HandleCount;
  /* 0x001c */ long Padding_19;
  /* 0x0020 */ struct _LIST_ENTRY VetoProcessList;
} ENUM_HANDLES_CONTEXT, *PENUM_HANDLES_CONTEXT; /* size: 0x0030 */

typedef enum _WHEA_CPU_VENDOR
{
  WheaCpuVendorOther = 0,
  WheaCpuVendorIntel = 1,
  WheaCpuVendorAmd = 2,
} WHEA_CPU_VENDOR, *PWHEA_CPU_VENDOR;

enum KTM_FINALIZE_TYPE
{
  TmpFinalizeEnlistmentNever = 0,
  TmpFinalizeEnlistmentAlways = 1,
  TmpFinalizeEnlistmentIfNoCommit = 2,
};

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0008 */

typedef struct _GENERAL_LOOKASIDE
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0010 */
  /* 0x0010 */ unsigned short Depth;
  /* 0x0012 */ unsigned short MaximumDepth;
  /* 0x0014 */ unsigned long TotalAllocates;
  union
  {
    /* 0x0018 */ unsigned long AllocateMisses;
    /* 0x0018 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x001c */ unsigned long TotalFrees;
  union
  {
    /* 0x0020 */ unsigned long FreeMisses;
    /* 0x0020 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x0024 */ enum _POOL_TYPE Type;
  /* 0x0028 */ unsigned long Tag;
  /* 0x002c */ unsigned long Size;
  union
  {
    /* 0x0030 */ void* AllocateEx /* function */;
    /* 0x0030 */ void* Allocate /* function */;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0038 */ void* FreeEx /* function */;
    /* 0x0038 */ void* Free /* function */;
  }; /* size: 0x0008 */
  /* 0x0040 */ struct _LIST_ENTRY ListEntry;
  /* 0x0050 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x0054 */ unsigned long LastAllocateMisses;
    /* 0x0054 */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0058 */ unsigned long Future[2];
  /* 0x0060 */ long __PADDING__[8];
} GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE; /* size: 0x0080 */

typedef enum _KBUGCHECK_BUFFER_DUMP_STATE
{
  BufferEmpty = 0,
  BufferInserted = 1,
  BufferStarted = 2,
  BufferFinished = 3,
  BufferIncomplete = 4,
} KBUGCHECK_BUFFER_DUMP_STATE, *PKBUGCHECK_BUFFER_DUMP_STATE;

typedef enum _FP_IEEE_COMPARE_RESULT
{
  FpCompareEqual = 0,
  FpCompareGreater = 1,
  FpCompareLess = 2,
  FpCompareUnordered = 3,
} FP_IEEE_COMPARE_RESULT, *PFP_IEEE_COMPARE_RESULT;

typedef enum _ENUM_TYPE
{
  EnumTypeNone = 0,
  EnumTypeShallow = 1,
  EnumTypeDeep = 2,
  EnumTypeIgnoreUninstalledDevices = 3,
} ENUM_TYPE, *PENUM_TYPE;

typedef enum _KBUGCHECK_CALLBACK_REASON
{
  KbCallbackInvalid = 0,
  KbCallbackReserved1 = 1,
  KbCallbackSecondaryDumpData = 2,
  KbCallbackDumpIo = 3,
  KbCallbackAddPages = 4,
} KBUGCHECK_CALLBACK_REASON, *PKBUGCHECK_CALLBACK_REASON;

typedef enum _PLUGPLAY_CONTROL_CLASS
{
  PlugPlayControlEnumerateDevice = 0,
  PlugPlayControlRegisterNewDevice = 1,
  PlugPlayControlDeregisterDevice = 2,
  PlugPlayControlInitializeDevice = 3,
  PlugPlayControlStartDevice = 4,
  PlugPlayControlUnlockDevice = 5,
  PlugPlayControlQueryAndRemoveDevice = 6,
  PlugPlayControlUserResponse = 7,
  PlugPlayControlGenerateLegacyDevice = 8,
  PlugPlayControlGetInterfaceDeviceList = 9,
  PlugPlayControlProperty = 10,
  PlugPlayControlDeviceClassAssociation = 11,
  PlugPlayControlGetRelatedDevice = 12,
  PlugPlayControlGetInterfaceDeviceAlias = 13,
  PlugPlayControlDeviceStatus = 14,
  PlugPlayControlGetDeviceDepth = 15,
  PlugPlayControlQueryDeviceRelations = 16,
  PlugPlayControlTargetDeviceRelation = 17,
  PlugPlayControlQueryConflictList = 18,
  PlugPlayControlRetrieveDock = 19,
  PlugPlayControlResetDevice = 20,
  PlugPlayControlHaltDevice = 21,
  PlugPlayControlGetBlockedDriverList = 22,
  MaxPlugPlayControl = 23,
} PLUGPLAY_CONTROL_CLASS, *PPLUGPLAY_CONTROL_CLASS;

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char ShareDisposition;
  /* 0x0002 */ unsigned short Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Generic;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Port;
      struct
      {
        /* 0x0004 */ unsigned short Level;
        /* 0x0006 */ unsigned short Group;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned __int64 Affinity;
      } /* size: 0x0010 */ Interrupt;
      struct
      {
        union
        {
          struct
          {
            /* 0x0004 */ unsigned short Group;
            /* 0x0006 */ unsigned short MessageCount;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned __int64 Affinity;
          } /* size: 0x0010 */ Raw;
          struct
          {
            /* 0x0004 */ unsigned short Level;
            /* 0x0006 */ unsigned short Group;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned __int64 Affinity;
          } /* size: 0x0010 */ Translated;
        }; /* size: 0x0010 */
      } /* size: 0x0010 */ MessageInterrupt;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Memory;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long Port;
        /* 0x000c */ unsigned long Reserved1;
      } /* size: 0x000c */ Dma;
      struct
      {
        /* 0x0004 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0004 */ unsigned long Start;
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Reserved;
      } /* size: 0x000c */ BusNumber;
      struct
      {
        /* 0x0004 */ unsigned long DataSize;
        /* 0x0008 */ unsigned long Reserved1;
        /* 0x000c */ unsigned long Reserved2;
      } /* size: 0x000c */ DeviceSpecificData;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length40;
      } /* size: 0x000c */ Memory40;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length48;
      } /* size: 0x000c */ Memory48;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length64;
      } /* size: 0x000c */ Memory64;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ u;
} CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR; /* size: 0x0014 */

typedef struct _CM_PARTIAL_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];
} CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST; /* size: 0x001c */

typedef enum _CLFS_IOSTATS_CLASS
{
  ClfsIoStatsDefault = 0,
  ClfsIoStatsMax = 0xffffffff,
} CLFS_IOSTATS_CLASS, *PCLFS_IOSTATS_CLASS;

enum PNPR_EXTENDED_STATUS
{
  NoFailure = 0,
  GeneralFailure = 1,
  UnsupportedBySku = 2,
  PartitionUnitDoesNotExist = 3,
  PartitionUnitsNotCompatible = 4,
  PartitionUnitNotReady = 5,
  PartitionUnitResourceNotSupported = 6,
  QuiesceFailure = 7,
  ChipsetDriverFailure = 8,
  ChipsetDriverNotSupported = 9,
  AllocationFailure = 10,
};

typedef struct _INTERRUPT_HT_INTR_INFO
{
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0000 */ unsigned long Mask : 1; /* bit position: 0 */
          /* 0x0000 */ unsigned long Polarity : 1; /* bit position: 1 */
          /* 0x0000 */ unsigned long MessageType : 3; /* bit position: 2 */
          /* 0x0000 */ unsigned long RequestEOI : 1; /* bit position: 5 */
          /* 0x0000 */ unsigned long DestinationMode : 1; /* bit position: 6 */
          /* 0x0000 */ unsigned long MessageType3 : 1; /* bit position: 7 */
          /* 0x0000 */ unsigned long Destination : 8; /* bit position: 8 */
          /* 0x0000 */ unsigned long Vector : 8; /* bit position: 16 */
          /* 0x0000 */ unsigned long ExtendedAddress : 8; /* bit position: 24 */
        }; /* bitfield */
      } /* size: 0x0004 */ bits;
      /* 0x0000 */ unsigned long AsULONG;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ LowPart;
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0004 */ unsigned long ExtendedDestination : 24; /* bit position: 0 */
          /* 0x0004 */ unsigned long Reserved : 6; /* bit position: 24 */
          /* 0x0004 */ unsigned long PassPW : 1; /* bit position: 30 */
          /* 0x0004 */ unsigned long WaitingForEOI : 1; /* bit position: 31 */
        }; /* bitfield */
      } /* size: 0x0004 */ bits;
      /* 0x0004 */ unsigned long AsULONG;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ HighPart;
} INTERRUPT_HT_INTR_INFO, *PINTERRUPT_HT_INTR_INFO; /* size: 0x0008 */

typedef enum _KEY_SET_INFORMATION_CLASS
{
  KeyWriteTimeInformation = 0,
  KeyWow64FlagsInformation = 1,
  KeyControlFlagsInformation = 2,
  KeySetVirtualizationInformation = 3,
  KeySetDebugInformation = 4,
  KeySetHandleTagsInformation = 5,
  MaxKeySetInfoClass = 6,
} KEY_SET_INFORMATION_CLASS, *PKEY_SET_INFORMATION_CLASS;

typedef struct _WHEA_IPF_MCA_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char Reserved;
} WHEA_IPF_MCA_DESCRIPTOR, *PWHEA_IPF_MCA_DESCRIPTOR; /* size: 0x0004 */

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef struct _WMI_TRACE_PACKET
{
  /* 0x0000 */ unsigned short Size;
  union
  {
    /* 0x0002 */ unsigned short HookId;
    struct
    {
      /* 0x0002 */ unsigned char Type;
      /* 0x0003 */ unsigned char Group;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
} WMI_TRACE_PACKET, *PWMI_TRACE_PACKET; /* size: 0x0004 */

typedef struct _SYSTEM_TRACE_HEADER
{
  union
  {
    /* 0x0000 */ unsigned long Marker;
    struct
    {
      /* 0x0000 */ unsigned short Version;
      /* 0x0002 */ unsigned char HeaderType;
      /* 0x0003 */ unsigned char Flags;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  union
  {
    /* 0x0004 */ unsigned long Header;
    /* 0x0004 */ struct _WMI_TRACE_PACKET Packet;
  }; /* size: 0x0004 */
  /* 0x0008 */ unsigned long ThreadId;
  /* 0x000c */ unsigned long ProcessId;
  /* 0x0010 */ union _LARGE_INTEGER SystemTime;
  /* 0x0018 */ unsigned long KernelTime;
  /* 0x001c */ unsigned long UserTime;
} SYSTEM_TRACE_HEADER, *PSYSTEM_TRACE_HEADER; /* size: 0x0020 */

typedef struct _ETW_TP_EVENT_POOL_TH_MIN_SET
{
  /* 0x0000 */ struct _SYSTEM_TRACE_HEADER Header;
  /* 0x0020 */ void* PoolId;
  /* 0x0028 */ unsigned long ThreadNum;
  /* 0x002c */ long __PADDING__[1];
} ETW_TP_EVENT_POOL_TH_MIN_SET, *PETW_TP_EVENT_POOL_TH_MIN_SET; /* size: 0x0030 */

typedef enum _POST_BLOCK_TYPE
{
  PostSynchronous = 1,
  PostAsyncUser = 2,
  PostAsyncKernel = 3,
} POST_BLOCK_TYPE, *PPOST_BLOCK_TYPE;

typedef struct _M128A
{
  /* 0x0000 */ unsigned __int64 Low;
  /* 0x0008 */ __int64 High;
} M128A, *PM128A; /* size: 0x0010 */

typedef struct _XSAVE_FORMAT
{
  /* 0x0000 */ unsigned short ControlWord;
  /* 0x0002 */ unsigned short StatusWord;
  /* 0x0004 */ unsigned char TagWord;
  /* 0x0005 */ unsigned char Reserved1;
  /* 0x0006 */ unsigned short ErrorOpcode;
  /* 0x0008 */ unsigned long ErrorOffset;
  /* 0x000c */ unsigned short ErrorSelector;
  /* 0x000e */ unsigned short Reserved2;
  /* 0x0010 */ unsigned long DataOffset;
  /* 0x0014 */ unsigned short DataSelector;
  /* 0x0016 */ unsigned short Reserved3;
  /* 0x0018 */ unsigned long MxCsr;
  /* 0x001c */ unsigned long MxCsr_Mask;
  /* 0x0020 */ struct _M128A FloatRegisters[8];
  /* 0x00a0 */ struct _M128A XmmRegisters[16];
  /* 0x01a0 */ unsigned char Reserved4[96];
} XSAVE_FORMAT, *PXSAVE_FORMAT; /* size: 0x0200 */

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned __int64 P1Home;
  /* 0x0008 */ unsigned __int64 P2Home;
  /* 0x0010 */ unsigned __int64 P3Home;
  /* 0x0018 */ unsigned __int64 P4Home;
  /* 0x0020 */ unsigned __int64 P5Home;
  /* 0x0028 */ unsigned __int64 P6Home;
  /* 0x0030 */ unsigned long ContextFlags;
  /* 0x0034 */ unsigned long MxCsr;
  /* 0x0038 */ unsigned short SegCs;
  /* 0x003a */ unsigned short SegDs;
  /* 0x003c */ unsigned short SegEs;
  /* 0x003e */ unsigned short SegFs;
  /* 0x0040 */ unsigned short SegGs;
  /* 0x0042 */ unsigned short SegSs;
  /* 0x0044 */ unsigned long EFlags;
  /* 0x0048 */ unsigned __int64 Dr0;
  /* 0x0050 */ unsigned __int64 Dr1;
  /* 0x0058 */ unsigned __int64 Dr2;
  /* 0x0060 */ unsigned __int64 Dr3;
  /* 0x0068 */ unsigned __int64 Dr6;
  /* 0x0070 */ unsigned __int64 Dr7;
  /* 0x0078 */ unsigned __int64 Rax;
  /* 0x0080 */ unsigned __int64 Rcx;
  /* 0x0088 */ unsigned __int64 Rdx;
  /* 0x0090 */ unsigned __int64 Rbx;
  /* 0x0098 */ unsigned __int64 Rsp;
  /* 0x00a0 */ unsigned __int64 Rbp;
  /* 0x00a8 */ unsigned __int64 Rsi;
  /* 0x00b0 */ unsigned __int64 Rdi;
  /* 0x00b8 */ unsigned __int64 R8;
  /* 0x00c0 */ unsigned __int64 R9;
  /* 0x00c8 */ unsigned __int64 R10;
  /* 0x00d0 */ unsigned __int64 R11;
  /* 0x00d8 */ unsigned __int64 R12;
  /* 0x00e0 */ unsigned __int64 R13;
  /* 0x00e8 */ unsigned __int64 R14;
  /* 0x00f0 */ unsigned __int64 R15;
  /* 0x00f8 */ unsigned __int64 Rip;
  union
  {
    /* 0x0100 */ struct _XSAVE_FORMAT FltSave;
    struct
    {
      /* 0x0100 */ struct _M128A Header[2];
      /* 0x0120 */ struct _M128A Legacy[8];
      /* 0x01a0 */ struct _M128A Xmm0;
      /* 0x01b0 */ struct _M128A Xmm1;
      /* 0x01c0 */ struct _M128A Xmm2;
      /* 0x01d0 */ struct _M128A Xmm3;
      /* 0x01e0 */ struct _M128A Xmm4;
      /* 0x01f0 */ struct _M128A Xmm5;
      /* 0x0200 */ struct _M128A Xmm6;
      /* 0x0210 */ struct _M128A Xmm7;
      /* 0x0220 */ struct _M128A Xmm8;
      /* 0x0230 */ struct _M128A Xmm9;
      /* 0x0240 */ struct _M128A Xmm10;
      /* 0x0250 */ struct _M128A Xmm11;
      /* 0x0260 */ struct _M128A Xmm12;
      /* 0x0270 */ struct _M128A Xmm13;
      /* 0x0280 */ struct _M128A Xmm14;
      /* 0x0290 */ struct _M128A Xmm15;
    }; /* size: 0x01a0 */
  }; /* size: 0x0200 */
  /* 0x0300 */ struct _M128A VectorRegister[26];
  /* 0x04a0 */ unsigned __int64 VectorControl;
  /* 0x04a8 */ unsigned __int64 DebugControl;
  /* 0x04b0 */ unsigned __int64 LastBranchToRip;
  /* 0x04b8 */ unsigned __int64 LastBranchFromRip;
  /* 0x04c0 */ unsigned __int64 LastExceptionToRip;
  /* 0x04c8 */ unsigned __int64 LastExceptionFromRip;
} CONTEXT, *PCONTEXT; /* size: 0x04d0 */

typedef struct _FIBER
{
  /* 0x0000 */ void* FiberData;
  /* 0x0008 */ struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;
  /* 0x0010 */ void* StackBase;
  /* 0x0018 */ void* StackLimit;
  /* 0x0020 */ void* DeallocationStack;
  /* 0x0028 */ long Padding_20[2];
  /* 0x0030 */ struct _CONTEXT FiberContext;
  /* 0x0500 */ struct _Wx86TIB* Wx86Tib;
  /* 0x0508 */ struct _ACTIVATION_CONTEXT_STACK* ActivationContextStackPointer;
  /* 0x0510 */ void* FlsData;
  /* 0x0518 */ unsigned long GuaranteedStackBytes;
  /* 0x051c */ unsigned short TebFlags;
  /* 0x051e */ unsigned short ReservedPad;
} FIBER, *PFIBER; /* size: 0x0520 */

enum NEGOTIATE_MESSAGES
{
  NegEnumPackagePrefixes = 0,
  NegGetCallerName = 1,
  NegCallPackageMax = 2,
};

typedef struct _PROCESSOR_POWER_POLICY_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned long DemoteLimit;
  /* 0x0008 */ unsigned long PromoteLimit;
  /* 0x000c */ unsigned char DemotePercent;
  /* 0x000d */ unsigned char PromotePercent;
  /* 0x000e */ unsigned char Spare[2];
  struct /* bitfield */
  {
    /* 0x0010 */ unsigned long AllowDemotion : 1; /* bit position: 0 */
    /* 0x0010 */ unsigned long AllowPromotion : 1; /* bit position: 1 */
    /* 0x0010 */ unsigned long Reserved : 30; /* bit position: 2 */
  }; /* bitfield */
} PROCESSOR_POWER_POLICY_INFO, *PPROCESSOR_POWER_POLICY_INFO; /* size: 0x0014 */

typedef enum _MUTANT_INFORMATION_CLASS
{
  MutantBasicInformation = 0,
  MutantOwnerInformation = 1,
} MUTANT_INFORMATION_CLASS, *PMUTANT_INFORMATION_CLASS;

typedef struct _EX_RUNDOWN_REF_CACHE_AWARE
{
  /* 0x0000 */ struct _EX_RUNDOWN_REF* RunRefs;
  /* 0x0008 */ void* PoolToFree;
  /* 0x0010 */ unsigned long RunRefSize;
  /* 0x0014 */ unsigned long Number;
} EX_RUNDOWN_REF_CACHE_AWARE, *PEX_RUNDOWN_REF_CACHE_AWARE; /* size: 0x0018 */

typedef struct _LOADER_PERFORMANCE_DATA
{
  /* 0x0000 */ unsigned __int64 StartTime;
  /* 0x0008 */ unsigned __int64 EndTime;
} LOADER_PERFORMANCE_DATA, *PLOADER_PERFORMANCE_DATA; /* size: 0x0010 */

enum SQM_EVENT
{
  SQM_EVENT_SETDWORD = 5,
  SQM_EVENT_SETSTRING = 10,
  SQM_EVENT_ADDTOSTREAM = 11,
};

typedef enum _CMOS_DEVICE_TYPE
{
  CmosTypeStdPCAT = 0,
  CmosTypeIntelPIIX4 = 1,
  CmosTypeDal1501 = 2,
} CMOS_DEVICE_TYPE, *PCMOS_DEVICE_TYPE;

typedef struct _ACCESS_REASONS
{
  /* 0x0000 */ unsigned long Data[32];
} ACCESS_REASONS, *PACCESS_REASONS; /* size: 0x0080 */

typedef struct _CONTEXT_CHUNK
{
  /* 0x0000 */ long Offset;
  /* 0x0004 */ unsigned long Length;
} CONTEXT_CHUNK, *PCONTEXT_CHUNK; /* size: 0x0008 */

typedef struct _HAL_PLATFORM_INFORMATION
{
  /* 0x0000 */ unsigned long PlatformFlags;
} HAL_PLATFORM_INFORMATION, *PHAL_PLATFORM_INFORMATION; /* size: 0x0004 */

enum CPU_VENDORS
{
  CPU_UNKNOWN = 0,
  CPU_AMD = 1,
  CPU_INTEL = 2,
  CPU_VIA = 3,
};

enum DISK_CACHE_RETENTION_PRIORITY
{
  EqualPriority = 0,
  KeepPrefetchedData = 1,
  KeepReadData = 2,
};

typedef struct _EX_RUNDOWN_REF
{
  union
  {
    /* 0x0000 */ unsigned __int64 Count;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0008 */
} EX_RUNDOWN_REF, *PEX_RUNDOWN_REF; /* size: 0x0008 */

typedef struct _FILE_COMPLETION_INFORMATION
{
  /* 0x0000 */ void* Port;
  /* 0x0008 */ void* Key;
} FILE_COMPLETION_INFORMATION, *PFILE_COMPLETION_INFORMATION; /* size: 0x0010 */

typedef enum _POP_DEVICE_IDLE_TYPE
{
  DeviceIdleNormal = 0,
  DeviceIdleDisk = 1,
} POP_DEVICE_IDLE_TYPE, *PPOP_DEVICE_IDLE_TYPE;

enum PCI_HT_CapabilitiesType
{
  HTSlavePrimary0 = 0,
  HTSlavePrimary1 = 1,
  HTSlavePrimary2 = 2,
  HTSlavePrimary3 = 3,
  HTHostSecondary0 = 4,
  HTHostSecondary1 = 5,
  HTHostSecondary2 = 6,
  HTHostSecondary3 = 7,
  HTInterruptDiscoveryConfig = 16,
  HTAddressMapping = 20,
  HTInterruptMsiMapping = 21,
};

typedef enum _STORAGE_PROPERTY_ID
{
  StorageDeviceProperty = 0,
  StorageAdapterProperty = 1,
  StorageDeviceIdProperty = 2,
  StorageDeviceUniqueIdProperty = 3,
  StorageDeviceWriteCacheProperty = 4,
  StorageMiniportProperty = 5,
  StorageAccessAlignmentProperty = 6,
  StorageDeviceSeekPenaltyProperty = 7,
  StorageDeviceTrimProperty = 8,
  StorageDeviceWriteAggregationProperty = 9,
} STORAGE_PROPERTY_ID, *PSTORAGE_PROPERTY_ID;

typedef struct _PSP_QUOTA_ENTRY
{
  union
  {
    /* 0x0000 */ unsigned char CacheAlign[64];
    struct
    {
      /* 0x0000 */ unsigned __int64 Usage;
      /* 0x0008 */ unsigned __int64 Peak;
    }; /* size: 0x0010 */
  }; /* size: 0x0040 */
  /* 0x0040 */ unsigned __int64 Limit;
  /* 0x0048 */ unsigned __int64 Return;
  /* 0x0050 */ struct _LIST_ENTRY ExpansionLink;
  /* 0x0060 */ long __PADDING__[8];
} PSP_QUOTA_ENTRY, *PPSP_QUOTA_ENTRY; /* size: 0x0080 */

typedef struct _EPROCESS_QUOTA_BLOCK
{
  /* 0x0000 */ struct _PSP_QUOTA_ENTRY QuotaEntry[4];
  /* 0x0200 */ struct _PS_CPU_QUOTA_BLOCK* CpuQuotaBlock;
  /* 0x0208 */ unsigned long ReferenceCount;
  /* 0x020c */ unsigned long ProcessCount;
  /* 0x0210 */ struct _LIST_ENTRY QuotaList;
  /* 0x0220 */ long __PADDING__[8];
} EPROCESS_QUOTA_BLOCK, *PEPROCESS_QUOTA_BLOCK; /* size: 0x0240 */

typedef enum _PO_SLEEP_DISABLE_REASON
{
  PoSleepDisableReasonVideo = 0,
  PoSleepDisableReasonHypervisor = 1,
  PoSleepDisableReasonVhdBoot = 2,
  PoSleepDisableReasonMax = 3,
} PO_SLEEP_DISABLE_REASON, *PPO_SLEEP_DISABLE_REASON;

typedef enum _MEMORY_CACHING_TYPE
{
  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
} MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

enum PROFILE_STATUS
{
  DOCK_NOTDOCKDEVICE = 0,
  DOCK_QUIESCENT = 1,
  DOCK_ARRIVING = 2,
  DOCK_DEPARTING = 3,
  DOCK_EJECTIRP_COMPLETED = 4,
};

typedef enum _SECURITY_LOGON_TYPE
{
  UndefinedLogonType = 0,
  Interactive = 2,
  Network = 3,
  Batch = 4,
  Service = 5,
  Proxy = 6,
  Unlock = 7,
  NetworkCleartext = 8,
  NewCredentials = 9,
  RemoteInteractive = 10,
  CachedInteractive = 11,
  CachedRemoteInteractive = 12,
  CachedUnlock = 13,
} SECURITY_LOGON_TYPE, *PSECURITY_LOGON_TYPE;

typedef struct _RTL_BALANCED_LINKS
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS* Parent;
  /* 0x0008 */ struct _RTL_BALANCED_LINKS* LeftChild;
  /* 0x0010 */ struct _RTL_BALANCED_LINKS* RightChild;
  /* 0x0018 */ char Balance;
  /* 0x0019 */ unsigned char Reserved[3];
  /* 0x001c */ long __PADDING__[1];
} RTL_BALANCED_LINKS, *PRTL_BALANCED_LINKS; /* size: 0x0020 */

typedef struct _KTMOBJECT_NAMESPACE_LINK
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS Links;
  /* 0x0020 */ unsigned char Expired;
  /* 0x0021 */ char __PADDING__[7];
} KTMOBJECT_NAMESPACE_LINK, *PKTMOBJECT_NAMESPACE_LINK; /* size: 0x0028 */

enum WMIDPREQUESTCODE
{
};

typedef struct _SYSTEM_POOLTAG
{
  union
  {
    /* 0x0000 */ unsigned char Tag[4];
    /* 0x0000 */ unsigned long TagUlong;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long PagedAllocs;
  /* 0x0008 */ unsigned long PagedFrees;
  /* 0x000c */ long Padding_21;
  /* 0x0010 */ unsigned __int64 PagedUsed;
  /* 0x0018 */ unsigned long NonPagedAllocs;
  /* 0x001c */ unsigned long NonPagedFrees;
  /* 0x0020 */ unsigned __int64 NonPagedUsed;
} SYSTEM_POOLTAG, *PSYSTEM_POOLTAG; /* size: 0x0028 */

typedef enum _DISK_SNAPSHOT_STATE
{
  DiskSnapshotNormalDisk = 0,
  DiskSnapshotSnapshotCheckRequired = 1,
  DiskSnapshotPreSnapshot = 2,
  DiskSnapshotSnapshotDisk = 3,
} DISK_SNAPSHOT_STATE, *PDISK_SNAPSHOT_STATE;

typedef enum _ERROR_SEVERITY_VALUE
{
  ErrorRecoverable = 0,
  ErrorFatal = 1,
  ErrorCorrected = 2,
  ErrorOthers = 3,
} ERROR_SEVERITY_VALUE, *PERROR_SEVERITY_VALUE;

typedef struct _PAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
} PAGED_LOOKASIDE_LIST, *PPAGED_LOOKASIDE_LIST; /* size: 0x0080 */

typedef enum _HV_X64_POWER_CHANGE_METHOD
{
  HvX64PowerChangeIssueHlt = 0,
  HvX64PowerChangeReadIoThenIssueHlt = 1,
  HvX64PowerChangeReadIo = 2,
  HvX64PowerChangeIssueMwait = 3,
} HV_X64_POWER_CHANGE_METHOD, *PHV_X64_POWER_CHANGE_METHOD;

typedef struct _PNP_LOCK_MOUNTABLE_DEVICE_CONTEXT
{
  /* 0x0000 */ struct _DEVICE_OBJECT* MountedDevice;
  /* 0x0008 */ struct _DEVICE_OBJECT* FsDevice;
} PNP_LOCK_MOUNTABLE_DEVICE_CONTEXT, *PPNP_LOCK_MOUNTABLE_DEVICE_CONTEXT; /* size: 0x0010 */

typedef enum _MM_POOL_PRIORITIES
{
  MmHighPriority = 0,
  MmNormalPriority = 1,
  MmLowPriority = 2,
  MmMaximumPoolPriority = 3,
} MM_POOL_PRIORITIES, *PMM_POOL_PRIORITIES;

struct _ASSEMBLY_STORAGE_MAP;

typedef enum _SECURITY_IMPERSONATION_LEVEL
{
  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3,
} SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _PSP_RATE_APC_STATE
{
  PsRateApcNone = 0,
  PsRateApcContained = 1,
  PsRateApcAllocated = 2,
  PsRateApcMaxStates = 3,
} PSP_RATE_APC_STATE, *PPSP_RATE_APC_STATE;

struct _FLS_CALLBACK_INFO;

typedef enum _WHEA_ERROR_SOURCE_TYPE
{
  WheaErrSrcTypeMCE = 0,
  WheaErrSrcTypeCMC = 1,
  WheaErrSrcTypeCPE = 2,
  WheaErrSrcTypeNMI = 3,
  WheaErrSrcTypePCIe = 4,
  WheaErrSrcTypeGeneric = 5,
  WheaErrSrcTypeINIT = 6,
  WheaErrSrcTypeBOOT = 7,
  WheaErrSrcTypeSCIGeneric = 8,
  WheaErrSrcTypeIPFMCA = 9,
  WheaErrSrcTypeIPFCMC = 10,
  WheaErrSrcTypeIPFCPE = 11,
  WheaErrSrcTypeMax = 12,
} WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_SOURCE_STATE
{
  WheaErrSrcStateStopped = 1,
  WheaErrSrcStateStarted = 2,
} WHEA_ERROR_SOURCE_STATE, *PWHEA_ERROR_SOURCE_STATE;

typedef union _XPF_MCE_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long MCG_CapabilityRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long MCG_GlobalControlRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Reserved : 30; /* bit position: 2 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} XPF_MCE_FLAGS, *PXPF_MCE_FLAGS; /* size: 0x0004 */

typedef union _XPF_MC_BANK_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char ClearOnInitializationRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char ControlDataRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned char Reserved : 6; /* bit position: 2 */
    }; /* bitfield */
    /* 0x0000 */ unsigned char AsUCHAR;
  }; /* size: 0x0001 */
} XPF_MC_BANK_FLAGS, *PXPF_MC_BANK_FLAGS; /* size: 0x0001 */

typedef struct _WHEA_XPF_MC_BANK_DESCRIPTOR
{
  /* 0x0000 */ unsigned char BankNumber;
  /* 0x0001 */ unsigned char ClearOnInitialization;
  /* 0x0002 */ unsigned char StatusDataFormat;
  /* 0x0003 */ union _XPF_MC_BANK_FLAGS Flags;
  /* 0x0004 */ unsigned long ControlMsr;
  /* 0x0008 */ unsigned long StatusMsr;
  /* 0x000c */ unsigned long AddressMsr;
  /* 0x0010 */ unsigned long MiscMsr;
  /* 0x0014 */ unsigned __int64 ControlData;
} WHEA_XPF_MC_BANK_DESCRIPTOR, *PWHEA_XPF_MC_BANK_DESCRIPTOR; /* size: 0x001c */

typedef struct _WHEA_XPF_MCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char NumberOfBanks;
  /* 0x0004 */ union _XPF_MCE_FLAGS Flags;
  /* 0x0008 */ unsigned __int64 MCG_Capability;
  /* 0x0010 */ unsigned __int64 MCG_GlobalControl;
  /* 0x0018 */ struct _WHEA_XPF_MC_BANK_DESCRIPTOR Banks[32];
} WHEA_XPF_MCE_DESCRIPTOR, *PWHEA_XPF_MCE_DESCRIPTOR; /* size: 0x0398 */

typedef union _WHEA_NOTIFICATION_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned short PollIntervalRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned short SwitchToPollingThresholdRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned short SwitchToPollingWindowRW : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned short ErrorThresholdRW : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned short ErrorThresholdWindowRW : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned short Reserved : 11; /* bit position: 5 */
    }; /* bitfield */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} WHEA_NOTIFICATION_FLAGS, *PWHEA_NOTIFICATION_FLAGS; /* size: 0x0002 */

typedef struct _WHEA_NOTIFICATION_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Length;
  /* 0x0002 */ union _WHEA_NOTIFICATION_FLAGS Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ unsigned long PollInterval;
      } /* size: 0x0004 */ Polled;
      struct
      {
        /* 0x0004 */ unsigned long PollInterval;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long SwitchToPollingThreshold;
        /* 0x0010 */ unsigned long SwitchToPollingWindow;
        /* 0x0014 */ unsigned long ErrorThreshold;
        /* 0x0018 */ unsigned long ErrorThresholdWindow;
      } /* size: 0x0018 */ Interrupt;
      struct
      {
        /* 0x0004 */ unsigned long PollInterval;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long SwitchToPollingThreshold;
        /* 0x0010 */ unsigned long SwitchToPollingWindow;
        /* 0x0014 */ unsigned long ErrorThreshold;
        /* 0x0018 */ unsigned long ErrorThresholdWindow;
      } /* size: 0x0018 */ LocalInterrupt;
      struct
      {
        /* 0x0004 */ unsigned long PollInterval;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long SwitchToPollingThreshold;
        /* 0x0010 */ unsigned long SwitchToPollingWindow;
        /* 0x0014 */ unsigned long ErrorThreshold;
        /* 0x0018 */ unsigned long ErrorThresholdWindow;
      } /* size: 0x0018 */ Sci;
      struct
      {
        /* 0x0004 */ unsigned long PollInterval;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long SwitchToPollingThreshold;
        /* 0x0010 */ unsigned long SwitchToPollingWindow;
        /* 0x0014 */ unsigned long ErrorThreshold;
        /* 0x0018 */ unsigned long ErrorThresholdWindow;
      } /* size: 0x0018 */ Nmi;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} WHEA_NOTIFICATION_DESCRIPTOR, *PWHEA_NOTIFICATION_DESCRIPTOR; /* size: 0x001c */

typedef struct _WHEA_XPF_CMC_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char NumberOfBanks;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ struct _WHEA_NOTIFICATION_DESCRIPTOR Notify;
  /* 0x0024 */ struct _WHEA_XPF_MC_BANK_DESCRIPTOR Banks[32];
} WHEA_XPF_CMC_DESCRIPTOR, *PWHEA_XPF_CMC_DESCRIPTOR; /* size: 0x03a4 */

typedef struct _WHEA_XPF_NMI_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
} WHEA_XPF_NMI_DESCRIPTOR, *PWHEA_XPF_NMI_DESCRIPTOR; /* size: 0x0003 */

typedef struct _WHEA_IPF_CMC_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char Reserved;
} WHEA_IPF_CMC_DESCRIPTOR, *PWHEA_IPF_CMC_DESCRIPTOR; /* size: 0x0004 */

typedef struct _WHEA_IPF_CPE_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char Reserved;
} WHEA_IPF_CPE_DESCRIPTOR, *PWHEA_IPF_CPE_DESCRIPTOR; /* size: 0x0004 */

typedef struct _WHEA_PCI_SLOT_NUMBER
{
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0000 */ unsigned long DeviceNumber : 5; /* bit position: 0 */
          /* 0x0000 */ unsigned long FunctionNumber : 3; /* bit position: 5 */
          /* 0x0000 */ unsigned long Reserved : 24; /* bit position: 8 */
        }; /* bitfield */
      } /* size: 0x0004 */ bits;
      /* 0x0000 */ unsigned long AsULONG;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
} WHEA_PCI_SLOT_NUMBER, *PWHEA_PCI_SLOT_NUMBER; /* size: 0x0004 */

typedef union _AER_ROOTPORT_DESCRIPTOR_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned short UncorrectableErrorMaskRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned short UncorrectableErrorSeverityRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned short CorrectableErrorMaskRW : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned short AdvancedCapsAndControlRW : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned short RootErrorCommandRW : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned short Reserved : 11; /* bit position: 5 */
    }; /* bitfield */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} AER_ROOTPORT_DESCRIPTOR_FLAGS, *PAER_ROOTPORT_DESCRIPTOR_FLAGS; /* size: 0x0002 */

typedef struct _WHEA_AER_ROOTPORT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char Reserved;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _WHEA_PCI_SLOT_NUMBER Slot;
  /* 0x000c */ unsigned short DeviceControl;
  /* 0x000e */ union _AER_ROOTPORT_DESCRIPTOR_FLAGS Flags;
  /* 0x0010 */ unsigned long UncorrectableErrorMask;
  /* 0x0014 */ unsigned long UncorrectableErrorSeverity;
  /* 0x0018 */ unsigned long CorrectableErrorMask;
  /* 0x001c */ unsigned long AdvancedCapsAndControl;
  /* 0x0020 */ unsigned long RootErrorCommand;
} WHEA_AER_ROOTPORT_DESCRIPTOR, *PWHEA_AER_ROOTPORT_DESCRIPTOR; /* size: 0x0024 */

typedef union _AER_ENDPOINT_DESCRIPTOR_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned short UncorrectableErrorMaskRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned short UncorrectableErrorSeverityRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned short CorrectableErrorMaskRW : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned short AdvancedCapsAndControlRW : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned short Reserved : 12; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} AER_ENDPOINT_DESCRIPTOR_FLAGS, *PAER_ENDPOINT_DESCRIPTOR_FLAGS; /* size: 0x0002 */

typedef struct _WHEA_AER_ENDPOINT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char Reserved;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _WHEA_PCI_SLOT_NUMBER Slot;
  /* 0x000c */ unsigned short DeviceControl;
  /* 0x000e */ union _AER_ENDPOINT_DESCRIPTOR_FLAGS Flags;
  /* 0x0010 */ unsigned long UncorrectableErrorMask;
  /* 0x0014 */ unsigned long UncorrectableErrorSeverity;
  /* 0x0018 */ unsigned long CorrectableErrorMask;
  /* 0x001c */ unsigned long AdvancedCapsAndControl;
} WHEA_AER_ENDPOINT_DESCRIPTOR, *PWHEA_AER_ENDPOINT_DESCRIPTOR; /* size: 0x0020 */

typedef union _AER_BRIDGE_DESCRIPTOR_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned short UncorrectableErrorMaskRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned short UncorrectableErrorSeverityRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned short CorrectableErrorMaskRW : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned short AdvancedCapsAndControlRW : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned short SecondaryUncorrectableErrorMaskRW : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned short SecondaryUncorrectableErrorSevRW : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned short SecondaryCapsAndControlRW : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned short Reserved : 9; /* bit position: 7 */
    }; /* bitfield */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} AER_BRIDGE_DESCRIPTOR_FLAGS, *PAER_BRIDGE_DESCRIPTOR_FLAGS; /* size: 0x0002 */

typedef struct _WHEA_AER_BRIDGE_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char Reserved;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _WHEA_PCI_SLOT_NUMBER Slot;
  /* 0x000c */ unsigned short DeviceControl;
  /* 0x000e */ union _AER_BRIDGE_DESCRIPTOR_FLAGS Flags;
  /* 0x0010 */ unsigned long UncorrectableErrorMask;
  /* 0x0014 */ unsigned long UncorrectableErrorSeverity;
  /* 0x0018 */ unsigned long CorrectableErrorMask;
  /* 0x001c */ unsigned long AdvancedCapsAndControl;
  /* 0x0020 */ unsigned long SecondaryUncorrectableErrorMask;
  /* 0x0024 */ unsigned long SecondaryUncorrectableErrorSev;
  /* 0x0028 */ unsigned long SecondaryCapsAndControl;
} WHEA_AER_BRIDGE_DESCRIPTOR, *PWHEA_AER_BRIDGE_DESCRIPTOR; /* size: 0x002c */

typedef struct _WHEA_GENERIC_ERROR_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Reserved;
  /* 0x0003 */ unsigned char Enabled;
  /* 0x0004 */ unsigned long ErrStatusBlockLength;
  /* 0x0008 */ unsigned long RelatedErrorSourceId;
  /* 0x000c */ unsigned char ErrStatusAddressSpaceID;
  /* 0x000d */ unsigned char ErrStatusAddressBitWidth;
  /* 0x000e */ unsigned char ErrStatusAddressBitOffset;
  /* 0x000f */ unsigned char ErrStatusAddressAccessSize;
  /* 0x0010 */ union _LARGE_INTEGER ErrStatusAddress;
  /* 0x0018 */ struct _WHEA_NOTIFICATION_DESCRIPTOR Notify;
} WHEA_GENERIC_ERROR_DESCRIPTOR, *PWHEA_GENERIC_ERROR_DESCRIPTOR; /* size: 0x0034 */

typedef struct _WHEA_ERROR_SOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned long Version;
  /* 0x0008 */ enum _WHEA_ERROR_SOURCE_TYPE Type;
  /* 0x000c */ enum _WHEA_ERROR_SOURCE_STATE State;
  /* 0x0010 */ unsigned long MaxRawDataLength;
  /* 0x0014 */ unsigned long NumRecordsToPreallocate;
  /* 0x0018 */ unsigned long MaxSectionsPerRecord;
  /* 0x001c */ unsigned long ErrorSourceId;
  /* 0x0020 */ unsigned long PlatformErrorSourceId;
  /* 0x0024 */ unsigned long Flags;
  union
  {
    union
    {
      /* 0x0028 */ struct _WHEA_XPF_MCE_DESCRIPTOR XpfMceDescriptor;
      /* 0x0028 */ struct _WHEA_XPF_CMC_DESCRIPTOR XpfCmcDescriptor;
      /* 0x0028 */ struct _WHEA_XPF_NMI_DESCRIPTOR XpfNmiDescriptor;
      /* 0x0028 */ struct _WHEA_IPF_MCA_DESCRIPTOR IpfMcaDescriptor;
      /* 0x0028 */ struct _WHEA_IPF_CMC_DESCRIPTOR IpfCmcDescriptor;
      /* 0x0028 */ struct _WHEA_IPF_CPE_DESCRIPTOR IpfCpeDescriptor;
      /* 0x0028 */ struct _WHEA_AER_ROOTPORT_DESCRIPTOR AerRootportDescriptor;
      /* 0x0028 */ struct _WHEA_AER_ENDPOINT_DESCRIPTOR AerEndpointDescriptor;
      /* 0x0028 */ struct _WHEA_AER_BRIDGE_DESCRIPTOR AerBridgeDescriptor;
      /* 0x0028 */ struct _WHEA_GENERIC_ERROR_DESCRIPTOR GenErrDescriptor;
    }; /* size: 0x03a4 */
  } /* size: 0x03a4 */ Info;
} WHEA_ERROR_SOURCE_DESCRIPTOR, *PWHEA_ERROR_SOURCE_DESCRIPTOR; /* size: 0x03cc */

typedef enum _FIRMWARE_TYPE
{
  FirmwareTypeUnknown = 0,
  FirmwareTypeBios = 1,
  FirmwareTypeEfi = 2,
  FirmwareTypeMax = 3,
} FIRMWARE_TYPE, *PFIRMWARE_TYPE;

typedef enum _WHEA_ERROR_TYPE
{
  WheaErrTypeProcessor = 0,
  WheaErrTypeMemory = 1,
  WheaErrTypePCIExpress = 2,
  WheaErrTypeNMI = 3,
  WheaErrTypePCIXBus = 4,
  WheaErrTypePCIXDevice = 5,
  WheaErrTypeGeneric = 6,
} WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _RESOURCE_HANDLER_TYPE
{
  ResourceHandlerNull = 0,
  ResourceTranslator = 1,
  ResourceArbiter = 2,
  ResourceLegacyDeviceDetection = 3,
} RESOURCE_HANDLER_TYPE, *PRESOURCE_HANDLER_TYPE;

typedef struct _EFI_DEVICE_PATH
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char SubType;
  /* 0x0002 */ unsigned char Length[2];
} EFI_DEVICE_PATH, *PEFI_DEVICE_PATH; /* size: 0x0004 */

typedef struct _FILEPATH_DEVICE_PATH
{
  /* 0x0000 */ struct _EFI_DEVICE_PATH Header;
  /* 0x0004 */ unsigned short PathName[1];
} FILEPATH_DEVICE_PATH, *PFILEPATH_DEVICE_PATH; /* size: 0x0006 */

typedef enum _AUDIT_EVENT_TYPE
{
  AuditEventObjectAccess = 0,
  AuditEventDirectoryServiceAccess = 1,
} AUDIT_EVENT_TYPE, *PAUDIT_EVENT_TYPE;

typedef union _UNWIND_CODE
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char CodeOffset;
      struct /* bitfield */
      {
        /* 0x0001 */ unsigned char UnwindOp : 4; /* bit position: 0 */
        /* 0x0001 */ unsigned char OpInfo : 4; /* bit position: 4 */
      }; /* bitfield */
    }; /* size: 0x0002 */
    /* 0x0000 */ unsigned short FrameOffset;
  }; /* size: 0x0002 */
} UNWIND_CODE, *PUNWIND_CODE; /* size: 0x0002 */

typedef struct _ETW_KERNEL_TRACE_TIMESTAMP
{
  /* 0x0000 */ union _LARGE_INTEGER KernelTraceTimeStamp[2];
} ETW_KERNEL_TRACE_TIMESTAMP, *PETW_KERNEL_TRACE_TIMESTAMP; /* size: 0x0010 */

typedef struct _ACE_HEADER
{
  /* 0x0000 */ unsigned char AceType;
  /* 0x0001 */ unsigned char AceFlags;
  /* 0x0002 */ unsigned short AceSize;
} ACE_HEADER, *PACE_HEADER; /* size: 0x0004 */

typedef struct _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE
{
  /* 0x0000 */ struct _ACE_HEADER Header;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _GUID ObjectType;
  /* 0x001c */ struct _GUID InheritedObjectType;
  /* 0x002c */ unsigned long SidStart;
} SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, *PSYSTEM_AUDIT_CALLBACK_OBJECT_ACE; /* size: 0x0030 */

typedef enum _MM_POOL_FAILURE_REASONS
{
  MmNonPagedNoPtes = 0,
  MmPriorityTooLow = 1,
  MmNonPagedNoPagesAvailable = 2,
  MmPagedNoPtes = 3,
  MmSessionPagedNoPtes = 4,
  MmPagedNoPagesAvailable = 5,
  MmSessionPagedNoPagesAvailable = 6,
  MmPagedNoCommit = 7,
  MmSessionPagedNoCommit = 8,
  MmNonPagedNoResidentAvailable = 9,
  MmNonPagedNoCommit = 10,
  MmMaximumFailureReason = 11,
} MM_POOL_FAILURE_REASONS, *PMM_POOL_FAILURE_REASONS;

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef struct _RTL_MODULE_BASIC_INFO
{
  /* 0x0000 */ void* ImageBase;
} RTL_MODULE_BASIC_INFO, *PRTL_MODULE_BASIC_INFO; /* size: 0x0008 */

typedef enum _PSPOWEREVENTTYPE
{
  PsW32FullWake = 0,
  PsW32EventCode = 1,
  PsW32SystemPowerState = 2,
  PsW32SystemTime = 3,
  PsW32MonitorOn = 4,
  PsW32MonitorOff = 5,
  PsW32ScreenSaver = 6,
  PsW32MonitorDim = 7,
} PSPOWEREVENTTYPE, *PPSPOWEREVENTTYPE;

typedef enum _IOV_REFERENCE_TYPE
{
  IOVREFTYPE_PACKET = 0,
  IOVREFTYPE_POINTER = 1,
} IOV_REFERENCE_TYPE, *PIOV_REFERENCE_TYPE;

typedef struct _ACTIVATION_CONTEXT_STACK
{
  /* 0x0000 */ struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;
  /* 0x0008 */ struct _LIST_ENTRY FrameListCache;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ unsigned long NextCookieSequenceNumber;
  /* 0x0020 */ unsigned long StackId;
  /* 0x0024 */ long __PADDING__[1];
} ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK; /* size: 0x0028 */

typedef enum _IO_PAGING_PRIORITY
{
  IoPagingPriorityInvalid = 0,
  IoPagingPriorityNormal = 1,
  IoPagingPriorityHigh = 2,
  IoPagingPriorityReserved1 = 3,
  IoPagingPriorityReserved2 = 4,
} IO_PAGING_PRIORITY, *PIO_PAGING_PRIORITY;

typedef enum _REG_NOTIFY_CLASS
{
  RegNtDeleteKey = 0,
  RegNtPreDeleteKey = 0,
  RegNtSetValueKey = 1,
  RegNtPreSetValueKey = 1,
  RegNtDeleteValueKey = 2,
  RegNtPreDeleteValueKey = 2,
  RegNtSetInformationKey = 3,
  RegNtPreSetInformationKey = 3,
  RegNtRenameKey = 4,
  RegNtPreRenameKey = 4,
  RegNtEnumerateKey = 5,
  RegNtPreEnumerateKey = 5,
  RegNtEnumerateValueKey = 6,
  RegNtPreEnumerateValueKey = 6,
  RegNtQueryKey = 7,
  RegNtPreQueryKey = 7,
  RegNtQueryValueKey = 8,
  RegNtPreQueryValueKey = 8,
  RegNtQueryMultipleValueKey = 9,
  RegNtPreQueryMultipleValueKey = 9,
  RegNtPreCreateKey = 10,
  RegNtPostCreateKey = 11,
  RegNtPreOpenKey = 12,
  RegNtPostOpenKey = 13,
  RegNtKeyHandleClose = 14,
  RegNtPreKeyHandleClose = 14,
  RegNtPostDeleteKey = 15,
  RegNtPostSetValueKey = 16,
  RegNtPostDeleteValueKey = 17,
  RegNtPostSetInformationKey = 18,
  RegNtPostRenameKey = 19,
  RegNtPostEnumerateKey = 20,
  RegNtPostEnumerateValueKey = 21,
  RegNtPostQueryKey = 22,
  RegNtPostQueryValueKey = 23,
  RegNtPostQueryMultipleValueKey = 24,
  RegNtPostKeyHandleClose = 25,
  RegNtPreCreateKeyEx = 26,
  RegNtPostCreateKeyEx = 27,
  RegNtPreOpenKeyEx = 28,
  RegNtPostOpenKeyEx = 29,
  RegNtPreFlushKey = 30,
  RegNtPostFlushKey = 31,
  RegNtPreLoadKey = 32,
  RegNtPostLoadKey = 33,
  RegNtPreUnLoadKey = 34,
  RegNtPostUnLoadKey = 35,
  RegNtPreQueryKeySecurity = 36,
  RegNtPostQueryKeySecurity = 37,
  RegNtPreSetKeySecurity = 38,
  RegNtPostSetKeySecurity = 39,
  RegNtCallbackObjectContextCleanup = 40,
  RegNtPreRestoreKey = 41,
  RegNtPostRestoreKey = 42,
  RegNtPreSaveKey = 43,
  RegNtPostSaveKey = 44,
  RegNtPreReplaceKey = 45,
  RegNtPostReplaceKey = 46,
  MaxRegNtNotifyClass = 47,
} REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef union _PCI_EXPRESS_UNCORRECTABLE_ERROR_MASK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Undefined : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Reserved1 : 3; /* bit position: 1 */
      /* 0x0000 */ unsigned long DataLinkProtocolError : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long SurpriseDownError : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long Reserved2 : 6; /* bit position: 6 */
      /* 0x0000 */ unsigned long PoisonedTLP : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned long FlowControlProtocolError : 1; /* bit position: 13 */
      /* 0x0000 */ unsigned long CompletionTimeout : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned long CompleterAbort : 1; /* bit position: 15 */
      /* 0x0000 */ unsigned long UnexpectedCompletion : 1; /* bit position: 16 */
      /* 0x0000 */ unsigned long ReceiverOverflow : 1; /* bit position: 17 */
      /* 0x0000 */ unsigned long MalformedTLP : 1; /* bit position: 18 */
      /* 0x0000 */ unsigned long ECRCError : 1; /* bit position: 19 */
      /* 0x0000 */ unsigned long UnsupportedRequestError : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long Reserved3 : 11; /* bit position: 21 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} PCI_EXPRESS_UNCORRECTABLE_ERROR_MASK, *PPCI_EXPRESS_UNCORRECTABLE_ERROR_MASK; /* size: 0x0004 */

typedef enum _MI_SYSTEM_VA_TYPE
{
  MiVaUnused = 0,
  MiVaSessionSpace = 1,
  MiVaProcessSpace = 2,
  MiVaBootLoaded = 3,
  MiVaPfnDatabase = 4,
  MiVaNonPagedPool = 5,
  MiVaPagedPool = 6,
  MiVaSpecialPoolPaged = 7,
  MiVaSystemCache = 8,
  MiVaSystemPtes = 9,
  MiVaHal = 10,
  MiVaSessionGlobalSpace = 11,
  MiVaDriverImages = 12,
  MiVaSpecialPoolNonPaged = 13,
  MiVaMaximumType = 14,
} MI_SYSTEM_VA_TYPE, *PMI_SYSTEM_VA_TYPE;

typedef enum _EVENT_INFORMATION_CLASS
{
  EventBasicInformation = 0,
} EVENT_INFORMATION_CLASS, *PEVENT_INFORMATION_CLASS;

typedef enum _IO_COMPLETION_INFORMATION_CLASS
{
  IoCompletionBasicInformation = 0,
} IO_COMPLETION_INFORMATION_CLASS, *PIO_COMPLETION_INFORMATION_CLASS;

typedef struct _QUAD
{
  union
  {
    /* 0x0000 */ __int64 UseThisFieldToCopy;
    /* 0x0000 */ double DoNotUseThisField;
  }; /* size: 0x0008 */
} QUAD, *PQUAD; /* size: 0x0008 */

typedef enum _MI_DYNAMIC_MEMORY_LOCKTYPE
{
  AlreadyHeld = 0,
  AcquiredShared = 1,
  UseSpinLock = 2,
  UseSpinLockRaiseIrql = 3,
} MI_DYNAMIC_MEMORY_LOCKTYPE, *PMI_DYNAMIC_MEMORY_LOCKTYPE;

typedef enum _ARBITER_REQUEST_SOURCE
{
  ArbiterRequestUndefined = -1,
  ArbiterRequestLegacyReported = 0,
  ArbiterRequestHalReported = 1,
  ArbiterRequestLegacyAssigned = 2,
  ArbiterRequestPnpDetected = 3,
  ArbiterRequestPnpEnumerated = 4,
} ARBITER_REQUEST_SOURCE, *PARBITER_REQUEST_SOURCE;

typedef struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO
{
  /* 0x0000 */ unsigned short UniqueProcessId;
  /* 0x0002 */ unsigned short CreatorBackTraceIndex;
  /* 0x0004 */ unsigned char ObjectTypeIndex;
  /* 0x0005 */ unsigned char HandleAttributes;
  /* 0x0006 */ unsigned short HandleValue;
  /* 0x0008 */ void* Object;
  /* 0x0010 */ unsigned long GrantedAccess;
  /* 0x0014 */ long __PADDING__[1];
} SYSTEM_HANDLE_TABLE_ENTRY_INFO, *PSYSTEM_HANDLE_TABLE_ENTRY_INFO; /* size: 0x0018 */

typedef enum _CLFS_LOG_ARCHIVE_MODE
{
  ClfsLogArchiveEnabled = 1,
  ClfsLogArchiveDisabled = 2,
} CLFS_LOG_ARCHIVE_MODE, *PCLFS_LOG_ARCHIVE_MODE;

enum WDIP_SEM_ALLOC_TYPE
{
  WDI_SEM_ALLOC_EVENT = 0,
  WDI_SEM_ALLOC_SCENARIO = 1,
  WDI_SEM_ALLOC_PROVIDER = 2,
  WDI_SEM_ALLOC_INSTANCE = 3,
  WDI_SEM_ALLOC_ACTION = 4,
  WDI_SEM_ALLOC_INFLIGHT_INFO = 5,
  WDI_SEM_ALLOC_TOTAL = 6,
};

typedef struct _MMPTE_HARDWARE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Dirty1 : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Accessed : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Dirty : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned __int64 LargePage : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned __int64 Global : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned __int64 CopyOnWrite : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned __int64 Unused : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Write : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 PageFrameNumber : 36; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 reserved1 : 4; /* bit position: 48 */
    /* 0x0000 */ unsigned __int64 SoftwareWsIndex : 11; /* bit position: 52 */
    /* 0x0000 */ unsigned __int64 NoExecute : 1; /* bit position: 63 */
  }; /* bitfield */
} MMPTE_HARDWARE, *PMMPTE_HARDWARE; /* size: 0x0008 */

typedef struct _HARDWARE_PTE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Write : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Accessed : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Dirty : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned __int64 LargePage : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned __int64 Global : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned __int64 CopyOnWrite : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 reserved0 : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 PageFrameNumber : 28; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 reserved1 : 12; /* bit position: 40 */
    /* 0x0000 */ unsigned __int64 SoftwareWsIndex : 11; /* bit position: 52 */
    /* 0x0000 */ unsigned __int64 NoExecute : 1; /* bit position: 63 */
  }; /* bitfield */
} HARDWARE_PTE, *PHARDWARE_PTE; /* size: 0x0008 */

typedef struct _MMPTE_PROTOTYPE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Unused0 : 7; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 ReadOnly : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned __int64 Unused1 : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 11 */
    /* 0x0000 */ __int64 ProtoAddress : 48; /* bit position: 16 */
  }; /* bitfield */
} MMPTE_PROTOTYPE, *PMMPTE_PROTOTYPE; /* size: 0x0008 */

typedef struct _MMPTE_SOFTWARE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 PageFileLow : 4; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 UsedPageTableEntries : 10; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 InStore : 1; /* bit position: 22 */
    /* 0x0000 */ unsigned __int64 Reserved : 9; /* bit position: 23 */
    /* 0x0000 */ unsigned __int64 PageFileHigh : 32; /* bit position: 32 */
  }; /* bitfield */
} MMPTE_SOFTWARE, *PMMPTE_SOFTWARE; /* size: 0x0008 */

typedef struct _MMPTE_TIMESTAMP
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 MustBeZero : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 PageFileLow : 4; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 Reserved : 20; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 GlobalTimeStamp : 32; /* bit position: 32 */
  }; /* bitfield */
} MMPTE_TIMESTAMP, *PMMPTE_TIMESTAMP; /* size: 0x0008 */

typedef struct _MMPTE_TRANSITION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Write : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 PageFrameNumber : 36; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 Unused : 16; /* bit position: 48 */
  }; /* bitfield */
} MMPTE_TRANSITION, *PMMPTE_TRANSITION; /* size: 0x0008 */

typedef struct _MMPTE_SUBSECTION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Unused0 : 4; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Unused1 : 5; /* bit position: 11 */
    /* 0x0000 */ __int64 SubsectionAddress : 48; /* bit position: 16 */
  }; /* bitfield */
} MMPTE_SUBSECTION, *PMMPTE_SUBSECTION; /* size: 0x0008 */

typedef struct _MMPTE_LIST
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 OneEntry : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 filler0 : 3; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 filler1 : 20; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 NextEntry : 32; /* bit position: 32 */
  }; /* bitfield */
} MMPTE_LIST, *PMMPTE_LIST; /* size: 0x0008 */

typedef struct _EX_PUSH_LOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 Shared : 60; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0008 */
} EX_PUSH_LOCK, *PEX_PUSH_LOCK; /* size: 0x0008 */

typedef struct _WHEAP_ERROR_SOURCE_TYPE_CONFIG
{
  /* 0x0000 */ struct _EX_PUSH_LOCK ConfigLock;
  /* 0x0008 */ volatile unsigned char Configured;
  /* 0x0009 */ char Padding_22[3];
  /* 0x000c */ volatile unsigned long Flags;
  /* 0x0010 */ void* volatile Correct /* function */;
  /* 0x0018 */ void* volatile Initialize /* function */;
  /* 0x0020 */ void* volatile CreateRecord /* function */;
  /* 0x0028 */ void* volatile Recover /* function */;
} WHEAP_ERROR_SOURCE_TYPE_CONFIG, *PWHEAP_ERROR_SOURCE_TYPE_CONFIG; /* size: 0x0030 */

typedef enum _POLICY_AUDIT_EVENT_TYPE_EX
{
  iSystem_SecurityStateChange = 100,
  iSystem_SecuritySubsystemExtension = 101,
  iSystem_Integrity = 102,
  iSystem_IPSecDriverEvents = 103,
  iSystem_Others = 104,
  iLogon_Logon = 105,
  iLogon_Logoff = 106,
  iLogon_AccountLockout = 107,
  iLogon_IPSecMainMode = 108,
  iLogon_SpecialLogon = 109,
  iLogon_IPSecQuickMode = 110,
  iLogon_IPSecUsermode = 111,
  iLogon_Others = 112,
  iLogon_NPS = 113,
  iObjectAccess_FileSystem = 114,
  iObjectAccess_Registry = 115,
  iObjectAccess_Kernel = 116,
  iObjectAccess_Sam = 117,
  iObjectAccess_Other = 118,
  iObjectAccess_CertificationAuthority = 119,
  iObjectAccess_ApplicationGenerated = 120,
  iObjectAccess_HandleBasedAudits = 121,
  iObjectAccess_Share = 122,
  iObjectAccess_FirewallPacketDrops = 123,
  iObjectAccess_FirewallConnection = 124,
  iObjectAccess_DetailedFileShare = 125,
  iPrivilegeUse_Sensitive = 126,
  iPrivilegeUse_NonSensitive = 127,
  iPrivilegeUse_Others = 128,
  iDetailedTracking_ProcessCreation = 129,
  iDetailedTracking_ProcessTermination = 130,
  iDetailedTracking_DpapiActivity = 131,
  iDetailedTracking_RpcCall = 132,
  iPolicyChange_AuditPolicy = 133,
  iPolicyChange_AuthenticationPolicy = 134,
  iPolicyChange_AuthorizationPolicy = 135,
  iPolicyChange_MpsscvRulePolicy = 136,
  iPolicyChange_WfpIPSecPolicy = 137,
  iPolicyChange_Others = 138,
  iAccountManagement_UserAccount = 139,
  iAccountManagement_ComputerAccount = 140,
  iAccountManagement_SecurityGroup = 141,
  iAccountManagement_DistributionGroup = 142,
  iAccountManagement_ApplicationGroup = 143,
  iAccountManagement_Others = 144,
  iDSAccess_DSAccess = 145,
  iDSAccess_AdAuditChanges = 146,
  iDS_Replication = 147,
  iDS_DetailedReplication = 148,
  iAccountLogon_CredentialValidation = 149,
  iAccountLogon_Kerberos = 150,
  iAccountLogon_Others = 151,
  iAccountLogon_KerbCredentialValidation = 152,
  iUnknownSubCategory = 999,
} POLICY_AUDIT_EVENT_TYPE_EX, *PPOLICY_AUDIT_EVENT_TYPE_EX;

typedef struct _SYSTEM_PREFETCH_PATCH_INFORMATION
{
  /* 0x0000 */ unsigned long PrefetchPatchCount;
} SYSTEM_PREFETCH_PATCH_INFORMATION, *PSYSTEM_PREFETCH_PATCH_INFORMATION; /* size: 0x0004 */

typedef enum _PF_FILE_ACCESS_TYPE
{
  PfFileAccessTypeRead = 0,
  PfFileAccessTypeWrite = 1,
  PfFileAccessTypeMax = 2,
} PF_FILE_ACCESS_TYPE, *PPF_FILE_ACCESS_TYPE;

typedef enum _ADDITIVE_MODE
{
  AM_NORMAL = 0,
  AM_ADDITIVE_ONLY = 1,
  AM_NO_ADDITIVE = 2,
} ADDITIVE_MODE, *PADDITIVE_MODE;

typedef struct _XSAVE_AREA_HEADER
{
  /* 0x0000 */ unsigned __int64 Mask;
  /* 0x0008 */ unsigned __int64 Reserved[7];
} XSAVE_AREA_HEADER, *PXSAVE_AREA_HEADER; /* size: 0x0040 */

typedef struct _XSAVE_AREA
{
  /* 0x0000 */ struct _XSAVE_FORMAT LegacyState;
  /* 0x0200 */ struct _XSAVE_AREA_HEADER Header;
} XSAVE_AREA, *PXSAVE_AREA; /* size: 0x0240 */

typedef enum _EVENT_TYPE
{
  NotificationEvent = 0,
  SynchronizationEvent = 1,
} EVENT_TYPE, *PEVENT_TYPE;

typedef struct _VI_POOL_PAGE_HEADER
{
  /* 0x0000 */ struct _SLIST_ENTRY* NextPage;
  /* 0x0008 */ void* VerifierEntry;
  /* 0x0010 */ unsigned __int64 Signature;
} VI_POOL_PAGE_HEADER, *PVI_POOL_PAGE_HEADER; /* size: 0x0018 */

typedef struct _VI_POOL_ENTRY_INUSE
{
  /* 0x0000 */ void* VirtualAddress;
  /* 0x0008 */ void* CallingAddress;
  /* 0x0010 */ unsigned __int64 NumberOfBytes;
  /* 0x0018 */ unsigned __int64 Tag;
} VI_POOL_ENTRY_INUSE, *PVI_POOL_ENTRY_INUSE; /* size: 0x0020 */

typedef struct _VI_POOL_ENTRY
{
  union
  {
    /* 0x0000 */ struct _VI_POOL_PAGE_HEADER PageHeader;
    /* 0x0000 */ struct _VI_POOL_ENTRY_INUSE InUse;
    struct
    {
      /* 0x0000 */ struct _SLIST_ENTRY* NextFree;
      /* 0x0008 */ long __PADDING__[6];
    }; /* size: 0x0020 */
  }; /* size: 0x0020 */
} VI_POOL_ENTRY, *PVI_POOL_ENTRY; /* size: 0x0020 */

typedef struct _DRIVER_EXTENSION
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0008 */ void* AddDevice /* function */;
  /* 0x0010 */ unsigned long Count;
  /* 0x0014 */ long Padding_23;
  /* 0x0018 */ struct _UNICODE_STRING ServiceKeyName;
  /* 0x0028 */ struct _IO_CLIENT_EXTENSION* ClientDriverExtension;
  /* 0x0030 */ struct _FS_FILTER_CALLBACKS* FsFilterCallbacks;
} DRIVER_EXTENSION, *PDRIVER_EXTENSION; /* size: 0x0038 */

typedef enum _IO_CONTAINER_NOTIFICATION_CLASS
{
  IoSessionStateNotification = 0,
  IoMaxContainerNotificationClass = 1,
} IO_CONTAINER_NOTIFICATION_CLASS, *PIO_CONTAINER_NOTIFICATION_CLASS;

typedef enum _MI_VAD_TYPE
{
  VadNone = 0,
  VadDevicePhysicalMemory = 1,
  VadImageMap = 2,
  VadAwe = 3,
  VadWriteWatch = 4,
  VadLargePages = 5,
  VadRotatePhysical = 6,
  VadLargePageSection = 7,
} MI_VAD_TYPE, *PMI_VAD_TYPE;

typedef enum _SUITE_TYPE
{
  SmallBusiness = 0,
  Enterprise = 1,
  BackOffice = 2,
  CommunicationServer = 3,
  TerminalServer = 4,
  SmallBusinessRestricted = 5,
  EmbeddedNT = 6,
  DataCenter = 7,
  SingleUserTS = 8,
  Personal = 9,
  Blade = 10,
  EmbeddedRestricted = 11,
  SecurityAppliance = 12,
  StorageServer = 13,
  ComputeServer = 14,
  WHServer = 15,
  MaxSuiteType = 16,
} SUITE_TYPE, *PSUITE_TYPE;

typedef struct _TRANSACTION_ENLISTMENT_PAIR
{
  /* 0x0000 */ struct _GUID EnlistmentId;
  /* 0x0010 */ struct _GUID ResourceManagerId;
} TRANSACTION_ENLISTMENT_PAIR, *PTRANSACTION_ENLISTMENT_PAIR; /* size: 0x0020 */

typedef struct _TRANSACTION_ENLISTMENTS_INFORMATION
{
  /* 0x0000 */ unsigned long NumberOfEnlistments;
  /* 0x0004 */ struct _TRANSACTION_ENLISTMENT_PAIR EnlistmentPair[1];
} TRANSACTION_ENLISTMENTS_INFORMATION, *PTRANSACTION_ENLISTMENTS_INFORMATION; /* size: 0x0024 */

typedef enum _WOW64_SHARED_INFORMATION
{
  SharedNtdll32LdrInitializeThunk = 0,
  SharedNtdll32KiUserExceptionDispatcher = 1,
  SharedNtdll32KiUserApcDispatcher = 2,
  SharedNtdll32KiUserCallbackDispatcher = 3,
  SharedNtdll32LdrHotPatchRoutine = 4,
  SharedNtdll32ExpInterlockedPopEntrySListFault = 5,
  SharedNtdll32ExpInterlockedPopEntrySListResume = 6,
  SharedNtdll32ExpInterlockedPopEntrySListEnd = 7,
  SharedNtdll32RtlUserThreadStart = 8,
  SharedNtdll32pQueryProcessDebugInformationRemote = 9,
  SharedNtdll32EtwpNotificationThread = 10,
  SharedNtdll32BaseAddress = 11,
  Wow64SharedPageEntriesCount = 12,
} WOW64_SHARED_INFORMATION, *PWOW64_SHARED_INFORMATION;

enum EMP_NODE_TYPE
{
  EMP_CALLBACK_TYPE = 0,
  EMP_RULE_TYPE = 1,
  EMP_LOGIC_TYPE = 2,
};

typedef struct _KDESCRIPTOR
{
  /* 0x0000 */ unsigned short Pad[3];
  /* 0x0006 */ unsigned short Limit;
  /* 0x0008 */ void* Base;
} KDESCRIPTOR, *PKDESCRIPTOR; /* size: 0x0010 */

typedef struct _KSPECIAL_REGISTERS
{
  /* 0x0000 */ unsigned __int64 Cr0;
  /* 0x0008 */ unsigned __int64 Cr2;
  /* 0x0010 */ unsigned __int64 Cr3;
  /* 0x0018 */ unsigned __int64 Cr4;
  /* 0x0020 */ unsigned __int64 KernelDr0;
  /* 0x0028 */ unsigned __int64 KernelDr1;
  /* 0x0030 */ unsigned __int64 KernelDr2;
  /* 0x0038 */ unsigned __int64 KernelDr3;
  /* 0x0040 */ unsigned __int64 KernelDr6;
  /* 0x0048 */ unsigned __int64 KernelDr7;
  /* 0x0050 */ struct _KDESCRIPTOR Gdtr;
  /* 0x0060 */ struct _KDESCRIPTOR Idtr;
  /* 0x0070 */ unsigned short Tr;
  /* 0x0072 */ unsigned short Ldtr;
  /* 0x0074 */ unsigned long MxCsr;
  /* 0x0078 */ unsigned __int64 DebugControl;
  /* 0x0080 */ unsigned __int64 LastBranchToRip;
  /* 0x0088 */ unsigned __int64 LastBranchFromRip;
  /* 0x0090 */ unsigned __int64 LastExceptionToRip;
  /* 0x0098 */ unsigned __int64 LastExceptionFromRip;
  /* 0x00a0 */ unsigned __int64 Cr8;
  /* 0x00a8 */ unsigned __int64 MsrGsBase;
  /* 0x00b0 */ unsigned __int64 MsrGsSwap;
  /* 0x00b8 */ unsigned __int64 MsrStar;
  /* 0x00c0 */ unsigned __int64 MsrLStar;
  /* 0x00c8 */ unsigned __int64 MsrCStar;
  /* 0x00d0 */ unsigned __int64 MsrSyscallMask;
} KSPECIAL_REGISTERS, *PKSPECIAL_REGISTERS; /* size: 0x00d8 */

typedef enum _REQUESTER_TYPE
{
  KernelRequester = 0,
  UserProcessRequester = 1,
  UserSharedServiceRequester = 2,
} REQUESTER_TYPE, *PREQUESTER_TYPE;

typedef enum _TRUSTED_INFORMATION_CLASS
{
  TrustedDomainNameInformation = 1,
  TrustedControllersInformation = 2,
  TrustedPosixOffsetInformation = 3,
  TrustedPasswordInformation = 4,
  TrustedDomainInformationBasic = 5,
  TrustedDomainInformationEx = 6,
  TrustedDomainAuthInformation = 7,
  TrustedDomainFullInformation = 8,
  TrustedDomainAuthInformationInternal = 9,
  TrustedDomainFullInformationInternal = 10,
  TrustedDomainInformationEx2Internal = 11,
  TrustedDomainFullInformation2Internal = 12,
  TrustedDomainSupportedEncryptionTypes = 13,
} TRUSTED_INFORMATION_CLASS, *PTRUSTED_INFORMATION_CLASS;

typedef struct _OB_PRE_OPERATION_INFORMATION
{
  /* 0x0000 */ unsigned long Operation;
  union
  {
    /* 0x0004 */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long KernelHandle : 1; /* bit position: 0 */
      /* 0x0004 */ unsigned long Reserved : 31; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0008 */ void* Object;
  /* 0x0010 */ struct _OBJECT_TYPE* ObjectType;
  /* 0x0018 */ void* CallContext;
  /* 0x0020 */ union _OB_PRE_OPERATION_PARAMETERS* Parameters;
} OB_PRE_OPERATION_INFORMATION, *POB_PRE_OPERATION_INFORMATION; /* size: 0x0028 */

typedef struct _SID_AND_ATTRIBUTES
{
  /* 0x0000 */ void* Sid;
  /* 0x0008 */ unsigned long Attributes;
  /* 0x000c */ long __PADDING__[1];
} SID_AND_ATTRIBUTES, *PSID_AND_ATTRIBUTES; /* size: 0x0010 */

typedef struct _TOKEN_GROUPS
{
  /* 0x0000 */ unsigned long GroupCount;
  /* 0x0004 */ long Padding_24;
  /* 0x0008 */ struct _SID_AND_ATTRIBUTES Groups[1];
} TOKEN_GROUPS, *PTOKEN_GROUPS; /* size: 0x0018 */

enum HV_ERROR_TYPES
{
  HV_MISCELLANEOUS_ERROR = 0,
  HV_PERFORMANCE_COUNTER_DECREASED = 1,
  HV_PERFORMANCE_COUNTER_SKIPPED = 2,
  HV_FREED_TOO_MANY_COMMON_BUFFERS = 3,
  HV_FREED_TOO_MANY_ADAPTER_CHANNELS = 4,
  HV_FREED_TOO_MANY_MAP_REGISTERS = 5,
  HV_FREED_TOO_MANY_SCATTER_GATHER_LISTS = 6,
  HV_LEFTOVER_COMMON_BUFFERS = 7,
  HV_LEFTOVER_ADAPTER_CHANNELS = 8,
  HV_LEFTOVER_MAP_REGISTERS = 9,
  HV_LEFTOVER_SCATTER_GATHER_LISTS = 10,
  HV_TOO_MANY_ADAPTER_CHANNELS = 11,
  HV_TOO_MANY_MAP_REGISTERS = 12,
  HV_DID_NOT_FLUSH_ADAPTER_BUFFERS = 13,
  HV_DMA_BUFFER_NOT_LOCKED = 14,
  HV_BOUNDARY_OVERRUN = 15,
  HV_CANNOT_FREE_MAP_REGISTERS = 16,
  HV_DID_NOT_PUT_ADAPTER = 17,
  HV_MDL_FLAGS_NOT_SET = 18,
  HV_BAD_IRQL = 19,
  HV_BAD_IRQL_JUST_WARN = 20,
  HV_OUT_OF_MAP_REGISTERS = 21,
  HV_FLUSH_EMPTY_BUFFERS = 22,
  HV_MISMATCHED_MAP_FLUSH = 23,
  HV_ADAPTER_ALREADY_RELEASED = 24,
  HV_NULL_DMA_ADAPTER = 25,
  HV_MAP_FLUSH_NO_TRANSFER = 26,
  HV_ADDRESS_NOT_IN_MDL = 27,
  HV_DATA_LOSS = 28,
  HV_DOUBLE_MAP_REGISTER = 29,
  HV_OBSOLETE_API = 30,
  HV_BAD_MDL = 31,
  HV_FLUSH_NOT_MAPPED = 32,
  HV_MAP_ZERO_LENGTH_BUFFER = 33,
  HV_BUFFER_NOT_MAPPED_IN_SYSTEM_VA = 34,
  HV_MAX_ERROR_TYPES = 35,
  HV_ERROR_HAS_SUBCODE = 0x10000000,
};

typedef enum _LSA_SID_NAME_MAPPING_OPERATION_TYPE
{
  LsaSidNameMappingOperation_Add = 0,
  LsaSidNameMappingOperation_Remove = 1,
  LsaSidNameMappingOperation_AddMultiple = 2,
} LSA_SID_NAME_MAPPING_OPERATION_TYPE, *PLSA_SID_NAME_MAPPING_OPERATION_TYPE;

typedef enum _CLS_IOSTATS_CLASS
{
  ClsIoStatsDefault = 0,
  ClsIoStatsMax = 0xffffffff,
} CLS_IOSTATS_CLASS, *PCLS_IOSTATS_CLASS;

typedef struct _KSPIN_LOCK_QUEUE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE* volatile Next;
  /* 0x0008 */ unsigned __int64* volatile Lock;
} KSPIN_LOCK_QUEUE, *PKSPIN_LOCK_QUEUE; /* size: 0x0010 */

typedef enum _CLFS_CONTEXT_MODE
{
  ClfsContextNone = 0,
  ClfsContextUndoNext = 1,
  ClfsContextPrevious = 2,
  ClfsContextForward = 3,
} CLFS_CONTEXT_MODE, *PCLFS_CONTEXT_MODE;

typedef struct _FS_FILTER_CALLBACKS
{
  /* 0x0000 */ unsigned long SizeOfFsFilterCallbacks;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* PreAcquireForSectionSynchronization /* function */;
  /* 0x0010 */ void* PostAcquireForSectionSynchronization /* function */;
  /* 0x0018 */ void* PreReleaseForSectionSynchronization /* function */;
  /* 0x0020 */ void* PostReleaseForSectionSynchronization /* function */;
  /* 0x0028 */ void* PreAcquireForCcFlush /* function */;
  /* 0x0030 */ void* PostAcquireForCcFlush /* function */;
  /* 0x0038 */ void* PreReleaseForCcFlush /* function */;
  /* 0x0040 */ void* PostReleaseForCcFlush /* function */;
  /* 0x0048 */ void* PreAcquireForModifiedPageWriter /* function */;
  /* 0x0050 */ void* PostAcquireForModifiedPageWriter /* function */;
  /* 0x0058 */ void* PreReleaseForModifiedPageWriter /* function */;
  /* 0x0060 */ void* PostReleaseForModifiedPageWriter /* function */;
} FS_FILTER_CALLBACKS, *PFS_FILTER_CALLBACKS; /* size: 0x0068 */

typedef enum _CM_SHARE_DISPOSITION
{
  CmResourceShareUndetermined = 0,
  CmResourceShareDeviceExclusive = 1,
  CmResourceShareDriverExclusive = 2,
  CmResourceShareShared = 3,
} CM_SHARE_DISPOSITION, *PCM_SHARE_DISPOSITION;

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef struct _IO_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Option;
  /* 0x0001 */ unsigned char Type;
  /* 0x0002 */ unsigned char ShareDisposition;
  /* 0x0003 */ unsigned char Spare1;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short Spare2;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Port;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory;
      struct
      {
        /* 0x0008 */ unsigned long MinimumVector;
        /* 0x000c */ unsigned long MaximumVector;
        /* 0x0010 */ unsigned short AffinityPolicy;
        /* 0x0012 */ unsigned short Group;
        /* 0x0014 */ enum _IRQ_PRIORITY PriorityPolicy;
        /* 0x0018 */ unsigned __int64 TargetedProcessors;
      } /* size: 0x0018 */ Interrupt;
      struct
      {
        /* 0x0008 */ unsigned long MinimumChannel;
        /* 0x000c */ unsigned long MaximumChannel;
      } /* size: 0x0008 */ Dma;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Generic;
      struct
      {
        /* 0x0008 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long MinBusNumber;
        /* 0x0010 */ unsigned long MaxBusNumber;
        /* 0x0014 */ unsigned long Reserved;
      } /* size: 0x0010 */ BusNumber;
      struct
      {
        /* 0x0008 */ unsigned long Priority;
        /* 0x000c */ unsigned long Reserved1;
        /* 0x0010 */ unsigned long Reserved2;
      } /* size: 0x000c */ ConfigData;
      struct
      {
        /* 0x0008 */ unsigned long Length40;
        /* 0x000c */ unsigned long Alignment40;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory40;
      struct
      {
        /* 0x0008 */ unsigned long Length48;
        /* 0x000c */ unsigned long Alignment48;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory48;
      struct
      {
        /* 0x0008 */ unsigned long Length64;
        /* 0x000c */ unsigned long Alignment64;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory64;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _IO_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];
} IO_RESOURCE_LIST, *PIO_RESOURCE_LIST; /* size: 0x0028 */

typedef enum _TRANSACTION_STATE
{
  TransactionStateNormal = 1,
  TransactionStateIndoubt = 2,
  TransactionStateCommittedNotify = 3,
} TRANSACTION_STATE, *PTRANSACTION_STATE;

typedef enum _SYSTEM_DLL_TYPE
{
  PsNativeSystemDll = 0,
  PsWow64SystemDll = 1,
  PsSystemDllTotalTypes = 2,
} SYSTEM_DLL_TYPE, *PSYSTEM_DLL_TYPE;

typedef union _MCI_STATS
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short McaErrorCode;
      /* 0x0002 */ unsigned short ModelErrorCode;
      struct /* bitfield */
      {
        /* 0x0004 */ unsigned long OtherInformation : 25; /* bit position: 0 */
        /* 0x0004 */ unsigned long ContextCorrupt : 1; /* bit position: 25 */
        /* 0x0004 */ unsigned long AddressValid : 1; /* bit position: 26 */
        /* 0x0004 */ unsigned long MiscValid : 1; /* bit position: 27 */
        /* 0x0004 */ unsigned long ErrorEnabled : 1; /* bit position: 28 */
        /* 0x0004 */ unsigned long UncorrectedError : 1; /* bit position: 29 */
        /* 0x0004 */ unsigned long StatusOverFlow : 1; /* bit position: 30 */
        /* 0x0004 */ unsigned long Valid : 1; /* bit position: 31 */
      }; /* bitfield */
    } /* size: 0x0008 */ MciStatus;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} MCI_STATS, *PMCI_STATS; /* size: 0x0008 */

typedef union _MCI_ADDR
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long Address;
      /* 0x0004 */ unsigned long Reserved;
    }; /* size: 0x0008 */
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} MCI_ADDR, *PMCI_ADDR; /* size: 0x0008 */

typedef struct _MCA_EXCEPTION
{
  /* 0x0000 */ unsigned long VersionNumber;
  /* 0x0004 */ enum MCA_EXCEPTION_TYPE ExceptionType;
  /* 0x0008 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0010 */ unsigned long ProcessorNumber;
  /* 0x0014 */ unsigned long Reserved1;
  union
  {
    union
    {
      struct
      {
        /* 0x0018 */ unsigned char BankNumber;
        /* 0x0019 */ unsigned char Reserved2[7];
        /* 0x0020 */ union _MCI_STATS Status;
        /* 0x0028 */ union _MCI_ADDR Address;
        /* 0x0030 */ unsigned __int64 Misc;
      } /* size: 0x0020 */ Mca;
      struct
      {
        /* 0x0018 */ unsigned __int64 Address;
        /* 0x0020 */ unsigned __int64 Type;
      } /* size: 0x0010 */ Mce;
    }; /* size: 0x0020 */
  } /* size: 0x0020 */ u;
  /* 0x0038 */ unsigned long ExtCnt;
  /* 0x003c */ unsigned long Reserved3;
  /* 0x0040 */ unsigned __int64 ExtReg[24];
} MCA_EXCEPTION, *PMCA_EXCEPTION; /* size: 0x0100 */

typedef enum _TAG_UNNAMED_1
{
  Start = 0,
  InNumber = 1,
  AfterDoubleColon = 2,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

typedef struct _PP_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE* P;
  /* 0x0008 */ struct _GENERAL_LOOKASIDE* L;
} PP_LOOKASIDE_LIST, *PPP_LOOKASIDE_LIST; /* size: 0x0010 */

typedef enum _THREAD_UMS_INFORMATION_COMMAND
{
  UmsInformationCommandInvalid = 0,
  UmsInformationCommandAttach = 1,
  UmsInformationCommandDetach = 2,
} THREAD_UMS_INFORMATION_COMMAND, *PTHREAD_UMS_INFORMATION_COMMAND;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT
{
  WheaDataFormatIPFSalRecord = 0,
  WheaDataFormatXPFMCA = 1,
  WheaDataFormatMemory = 2,
  WheaDataFormatPCIExpress = 3,
  WheaDataFormatNMIPort = 4,
  WheaDataFormatPCIXBus = 5,
  WheaDataFormatPCIXDevice = 6,
  WheaDataFormatGeneric = 7,
  WheaDataFormatMax = 8,
} WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE
{
  VfDeadlockUnknown = 0,
  VfDeadlockMutex = 1,
  VfDeadlockMutexAbandoned = 2,
  VfDeadlockFastMutex = 3,
  VfDeadlockFastMutexUnsafe = 4,
  VfDeadlockSpinLock = 5,
  VfDeadlockInStackQueuedSpinLock = 6,
  VfDeadlockUnusedSpinLock = 7,
  VfDeadlockEresource = 8,
  VfDeadlockTypeMaximum = 9,
} VI_DEADLOCK_RESOURCE_TYPE, *PVI_DEADLOCK_RESOURCE_TYPE;

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  MaximumInterfaceType = 17,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef struct _IO_RESOURCE_REQUIREMENTS_LIST
{
  /* 0x0000 */ unsigned long ListSize;
  /* 0x0004 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long SlotNumber;
  /* 0x0010 */ unsigned long Reserved[3];
  /* 0x001c */ unsigned long AlternativeLists;
  /* 0x0020 */ struct _IO_RESOURCE_LIST List[1];
} IO_RESOURCE_REQUIREMENTS_LIST, *PIO_RESOURCE_REQUIREMENTS_LIST; /* size: 0x0048 */

typedef struct _SMKM_CRYPTO_REG_PARAMS
{
  /* 0x0000 */ unsigned long EncryptionKeySize;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long EncryptionScope : 2; /* bit position: 0 */
    /* 0x0004 */ unsigned long Spare : 30; /* bit position: 2 */
  }; /* bitfield */
} SMKM_CRYPTO_REG_PARAMS, *PSMKM_CRYPTO_REG_PARAMS; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_2
{
  SameNode = 0,
  SiblingNode = 1,
  ChildNode = 2,
} TAG_UNNAMED_2, *PTAG_UNNAMED_2;

typedef enum _IO_NOTIFICATION_EVENT_CATEGORY
{
  EventCategoryReserved = 0,
  EventCategoryHardwareProfileChange = 1,
  EventCategoryDeviceInterfaceChange = 2,
  EventCategoryTargetDeviceChange = 3,
} IO_NOTIFICATION_EVENT_CATEGORY, *PIO_NOTIFICATION_EVENT_CATEGORY;

typedef enum _KDPC_IMPORTANCE
{
  LowImportance = 0,
  MediumImportance = 1,
  HighImportance = 2,
  MediumHighImportance = 3,
} KDPC_IMPORTANCE, *PKDPC_IMPORTANCE;

typedef enum _stringsSectionType
{
  StringsSectionNone = 0,
  StringsSectionPlain = 1,
  StringsSectionLoosePrimaryMatch = 2,
  StringsSectionExactPrimaryMatch = 3,
  StringsSectionExactMatch = 4,
} stringsSectionType, *PstringsSectionType;

enum PCI_EXPRESS_L1_EXIT_LATENCY
{
  L1_Below1us = 0,
  L1_1us_2us = 1,
  L1_2us_4us = 2,
  L1_4us_8us = 3,
  L1_8us_16us = 4,
  L1_16us_32us = 5,
  L1_32us_64us = 6,
  L1_Above64us = 7,
};

typedef enum _WORKING_SET_TYPE
{
  WorkingSetTypeUser = 0,
  WorkingSetTypeSession = 1,
  WorkingSetTypeSystemTypes = 2,
  WorkingSetTypeSystemCache = 2,
  WorkingSetTypePagedPool = 3,
  WorkingSetTypeSystemPtes = 4,
  WorkingSetTypeMaximum = 5,
} WORKING_SET_TYPE, *PWORKING_SET_TYPE;

typedef struct _RTL_TRACE_BLOCK
{
  /* 0x0000 */ unsigned long Magic;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ long Padding_25;
  /* 0x0010 */ unsigned __int64 UserCount;
  /* 0x0018 */ unsigned __int64 UserSize;
  /* 0x0020 */ void* UserContext;
  /* 0x0028 */ struct _RTL_TRACE_BLOCK* Next;
  /* 0x0030 */ void** Trace;
} RTL_TRACE_BLOCK, *PRTL_TRACE_BLOCK; /* size: 0x0038 */

typedef enum _DUMP_TYPES
{
  DUMP_TYPE_INVALID = -1,
  DUMP_TYPE_UNKNOWN = 0,
  DUMP_TYPE_FULL = 1,
  DUMP_TYPE_SUMMARY = 2,
  DUMP_TYPE_HEADER = 3,
  DUMP_TYPE_TRIAGE = 4,
} DUMP_TYPES, *PDUMP_TYPES;

typedef struct _MMCLONE_HEADER
{
  /* 0x0000 */ unsigned long NumberOfPtes;
  /* 0x0004 */ volatile long NumberOfProcessReferences;
  /* 0x0008 */ struct _MMCLONE_BLOCK* ClonePtes;
} MMCLONE_HEADER, *PMMCLONE_HEADER; /* size: 0x0010 */

typedef enum _EMULATOR_PORT_ACCESS_TYPE
{
  Uchar = 0,
  Ushort = 1,
  Ulong = 2,
} EMULATOR_PORT_ACCESS_TYPE, *PEMULATOR_PORT_ACCESS_TYPE;

typedef struct _AMD64_XMM_SAVE_AREA32
{
  /* 0x0000 */ unsigned short ControlWord;
  /* 0x0002 */ unsigned short StatusWord;
  /* 0x0004 */ unsigned char TagWord;
  /* 0x0005 */ unsigned char Reserved1;
  /* 0x0006 */ unsigned short ErrorOpcode;
  /* 0x0008 */ unsigned long ErrorOffset;
  /* 0x000c */ unsigned short ErrorSelector;
  /* 0x000e */ unsigned short Reserved2;
  /* 0x0010 */ unsigned long DataOffset;
  /* 0x0014 */ unsigned short DataSelector;
  /* 0x0016 */ unsigned short Reserved3;
  /* 0x0018 */ unsigned long MxCsr;
  /* 0x001c */ unsigned long MxCsr_Mask;
  /* 0x0020 */ struct _AMD64_M128 FloatRegisters[8];
  /* 0x00a0 */ struct _AMD64_M128 XmmRegisters[16];
  /* 0x01a0 */ unsigned char Reserved4[96];
} AMD64_XMM_SAVE_AREA32, *PAMD64_XMM_SAVE_AREA32; /* size: 0x0200 */

typedef enum _JOURNAL_CHANGE_INFORMATION_CLASS
{
  JournalCreateKey = 0,
  JournalDeleteKey = 1,
  JournalRenameKey = 2,
  JournalSetValue = 3,
  JournalDeleteValue = 4,
  JournalSetKeySecurity = 5,
  JournalSetKeyUserFlags = 6,
  JournalSetLastWriteTime = 7,
  JournalBeginTransaction = 8,
  JournalCommitTransaction = 9,
  JournalAbortTransaction = 10,
  MaxJournalChangeAction = 11,
} JOURNAL_CHANGE_INFORMATION_CLASS, *PJOURNAL_CHANGE_INFORMATION_CLASS;

typedef enum _BALANCE_OBJECT
{
  PeriodicEvent = 0,
  WorkingSetManagerEvent = 1,
  MaximumObject = 2,
} BALANCE_OBJECT, *PBALANCE_OBJECT;

typedef enum _WATCHDOG_INFORMATION_CLASS
{
  WdInfoTimeoutValue = 0,
  WdInfoResetTimer = 1,
  WdInfoStopTimer = 2,
  WdInfoStartTimer = 3,
  WdInfoTriggerAction = 4,
  WdInfoState = 5,
} WATCHDOG_INFORMATION_CLASS, *PWATCHDOG_INFORMATION_CLASS;

typedef struct _CLIENT_ID
{
  /* 0x0000 */ void* UniqueProcess;
  /* 0x0008 */ void* UniqueThread;
} CLIENT_ID, *PCLIENT_ID; /* size: 0x0010 */

typedef struct _SYSTEM_THREAD_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER KernelTime;
  /* 0x0008 */ union _LARGE_INTEGER UserTime;
  /* 0x0010 */ union _LARGE_INTEGER CreateTime;
  /* 0x0018 */ unsigned long WaitTime;
  /* 0x001c */ long Padding_26;
  /* 0x0020 */ void* StartAddress;
  /* 0x0028 */ struct _CLIENT_ID ClientId;
  /* 0x0038 */ long Priority;
  /* 0x003c */ long BasePriority;
  /* 0x0040 */ unsigned long ContextSwitches;
  /* 0x0044 */ unsigned long ThreadState;
  /* 0x0048 */ unsigned long WaitReason;
  /* 0x004c */ long __PADDING__[1];
} SYSTEM_THREAD_INFORMATION, *PSYSTEM_THREAD_INFORMATION; /* size: 0x0050 */

typedef struct _SYSTEM_EXTENDED_THREAD_INFORMATION
{
  /* 0x0000 */ struct _SYSTEM_THREAD_INFORMATION ThreadInfo;
  /* 0x0050 */ void* StackBase;
  /* 0x0058 */ void* StackLimit;
  /* 0x0060 */ void* Win32StartAddress;
  /* 0x0068 */ void* TebBase;
  /* 0x0070 */ unsigned __int64 Reserved2;
  /* 0x0078 */ unsigned __int64 Reserved3;
  /* 0x0080 */ unsigned __int64 Reserved4;
} SYSTEM_EXTENDED_THREAD_INFORMATION, *PSYSTEM_EXTENDED_THREAD_INFORMATION; /* size: 0x0088 */

typedef enum _SYSDBG_COMMAND
{
  SysDbgQueryModuleInformation = 0,
  SysDbgQueryTraceInformation = 1,
  SysDbgSetTracepoint = 2,
  SysDbgSetSpecialCall = 3,
  SysDbgClearSpecialCalls = 4,
  SysDbgQuerySpecialCalls = 5,
  SysDbgBreakPoint = 6,
  SysDbgQueryVersion = 7,
  SysDbgReadVirtual = 8,
  SysDbgWriteVirtual = 9,
  SysDbgReadPhysical = 10,
  SysDbgWritePhysical = 11,
  SysDbgReadControlSpace = 12,
  SysDbgWriteControlSpace = 13,
  SysDbgReadIoSpace = 14,
  SysDbgWriteIoSpace = 15,
  SysDbgReadMsr = 16,
  SysDbgWriteMsr = 17,
  SysDbgReadBusData = 18,
  SysDbgWriteBusData = 19,
  SysDbgCheckLowMemory = 20,
  SysDbgEnableKernelDebugger = 21,
  SysDbgDisableKernelDebugger = 22,
  SysDbgGetAutoKdEnable = 23,
  SysDbgSetAutoKdEnable = 24,
  SysDbgGetPrintBufferSize = 25,
  SysDbgSetPrintBufferSize = 26,
  SysDbgGetKdUmExceptionEnable = 27,
  SysDbgSetKdUmExceptionEnable = 28,
  SysDbgGetTriageDump = 29,
  SysDbgGetKdBlockEnable = 30,
  SysDbgSetKdBlockEnable = 31,
  SysDbgRegisterForUmBreakInfo = 32,
  SysDbgGetUmBreakPid = 33,
  SysDbgClearUmBreakPid = 34,
  SysDbgGetUmAttachPid = 35,
  SysDbgClearUmAttachPid = 36,
} SYSDBG_COMMAND, *PSYSDBG_COMMAND;

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
  BusQueryDeviceUniqueID = 5,
};

enum PCI_EXPRESS_L0s_EXIT_LATENCY
{
  L0s_Below64ns = 0,
  L0s_64ns_128ns = 1,
  L0s_128ns_256ns = 2,
  L0s_256ns_512ns = 3,
  L0s_512ns_1us = 4,
  L0s_1us_2us = 5,
  L0s_2us_4us = 6,
  L0s_Above4us = 7,
};

typedef enum _PFSN_BOOT_PHASE_ID
{
  PfSnSystemDriverInitPhase = 120,
  PfSnBootAcceptedRegistryInitPhase = 270,
  PfSnUserShellReadyPhase = 300,
  PfSnMaxBootPhaseId = 900,
} PFSN_BOOT_PHASE_ID, *PPFSN_BOOT_PHASE_ID;

enum WMIENABLEDISABLEFUNCTION
{
  WmiEventGeneration = 0,
  WmiDataBlockCollection = 1,
};

typedef enum _KPROCESS_STATE
{
  ProcessInMemory = 0,
  ProcessOutOfMemory = 1,
  ProcessInTransition = 2,
  ProcessOutTransition = 3,
  ProcessInSwap = 4,
  ProcessOutSwap = 5,
  ProcessAllSwapStates = 6,
} KPROCESS_STATE, *PKPROCESS_STATE;

typedef enum _HV_CALL_CODE
{
  HvCallReserved0000 = 0,
  HvCallSwitchVirtualAddressSpace = 1,
  HvCallFlushVirtualAddressSpace = 2,
  HvCallFlushVirtualAddressList = 3,
  HvCallGetLogicalProcessorRunTime = 4,
  HvCallDeprecated0005 = 5,
  HvCallDeprecated0006 = 6,
  HvCallDeprecated0007 = 7,
  HvCallNotifyLongSpinWait = 8,
  HvCallParkLogicalProcessors = 9,
  HvCallInvokeHypervisorDebugger = 10,
  HvCallReserved000b = 11,
  HvCallReserved000c = 12,
  HvCallReserved000d = 13,
  HvCallReserved000e = 14,
  HvCallReserved000f = 15,
  HvCallReserved0010 = 16,
  HvCallReserved0011 = 17,
  HvCallReserved0012 = 18,
  HvCallReserved0013 = 19,
  HvCallReserved0014 = 20,
  HvCallReserved0015 = 21,
  HvCallReserved0016 = 22,
  HvCallReserved0017 = 23,
  HvCallReserved0018 = 24,
  HvCallReserved0019 = 25,
  HvCallReserved001a = 26,
  HvCallReserved001b = 27,
  HvCallReserved001c = 28,
  HvCallReserved001d = 29,
  HvCallReserved001e = 30,
  HvCallReserved001f = 31,
  HvCallReserved0020 = 32,
  HvCallReserved0021 = 33,
  HvCallReserved0022 = 34,
  HvCallReserved0023 = 35,
  HvCallReserved0024 = 36,
  HvCallReserved0025 = 37,
  HvCallReserved0026 = 38,
  HvCallReserved0027 = 39,
  HvCallReserved0028 = 40,
  HvCallReserved0029 = 41,
  HvCallReserved002a = 42,
  HvCallReserved002b = 43,
  HvCallReserved002c = 44,
  HvCallReserved002d = 45,
  HvCallReserved002e = 46,
  HvCallReserved002f = 47,
  HvCallReserved0030 = 48,
  HvCallReserved0031 = 49,
  HvCallReserved0032 = 50,
  HvCallReserved0033 = 51,
  HvCallReserved0034 = 52,
  HvCallReserved0035 = 53,
  HvCallReserved0036 = 54,
  HvCallReserved0037 = 55,
  HvCallReserved0038 = 56,
  HvCallReserved0039 = 57,
  HvCallReserved003a = 58,
  HvCallReserved003b = 59,
  HvCallReserved003c = 60,
  HvCallReserved003d = 61,
  HvCallReserved003e = 62,
  HvCallReserved003f = 63,
  HvCallMapStatsPage = 108,
  HvCallUnmapStatsPage = 109,
} HV_CALL_CODE, *PHV_CALL_CODE;

typedef enum _REGOPERATION
{
  RegisterAllDrivers = 0,
  RegisterSingleDriver = 1,
  RegisterUpdateSingleDriver = 2,
  RegisterDeleteSingleDriver = 3,
} REGOPERATION, *PREGOPERATION;

typedef enum _KEY_INFORMATION_CLASS
{
  KeyBasicInformation = 0,
  KeyNodeInformation = 1,
  KeyFullInformation = 2,
  KeyNameInformation = 3,
  KeyCachedInformation = 4,
  KeyFlagsInformation = 5,
  KeyVirtualizationInformation = 6,
  KeyHandleTagsInformation = 7,
  MaxKeyInfoClass = 8,
} KEY_INFORMATION_CLASS, *PKEY_INFORMATION_CLASS;

typedef enum _HAL_SET_INFORMATION_CLASS
{
  HalProfileSourceInterval = 0,
  HalProfileSourceInterruptHandler = 1,
  HalMcaRegisterDriver = 2,
  HalKernelErrorHandler = 3,
  HalCmcRegisterDriver = 4,
  HalCpeRegisterDriver = 5,
  HalMcaLog = 6,
  HalCmcLog = 7,
  HalCpeLog = 8,
  HalGenerateCmcInterrupt = 9,
  HalProfileSourceTimerHandler = 10,
  HalEnlightenment = 11,
  HalProfileDpgoSourceInterruptHandler = 12,
} HAL_SET_INFORMATION_CLASS, *PHAL_SET_INFORMATION_CLASS;

enum WMIP_LEGACY_WORK_TYPE
{
  LegacyEtwRegister = 0,
  LegacyEtwUnregister = 1,
  LegacyEtwCallback = 2,
};

typedef enum _DEVICE_INSTALL_STATE
{
  InstallStateInstalled = 0,
  InstallStateNeedsReinstall = 1,
  InstallStateFailedInstall = 2,
  InstallStateFinishInstall = 3,
} DEVICE_INSTALL_STATE, *PDEVICE_INSTALL_STATE;

typedef enum _PROCESS_TLS_INFORMATION_TYPE
{
  ProcessTlsReplaceIndex = 0,
  ProcessTlsReplaceVector = 1,
  MaxProcessTlsOperation = 2,
} PROCESS_TLS_INFORMATION_TYPE, *PPROCESS_TLS_INFORMATION_TYPE;

typedef enum _BCD_OBJECT_ALIAS
{
  BcdAliasInvalid = 0,
  BcdAliasCurrentBootEntry = 1,
  BcdAliasDefaultBootEntry = 2,
} BCD_OBJECT_ALIAS, *PBCD_OBJECT_ALIAS;

typedef struct _CURDIR
{
  /* 0x0000 */ struct _UNICODE_STRING DosPath;
  /* 0x0010 */ void* Handle;
} CURDIR, *PCURDIR; /* size: 0x0018 */

typedef enum _TAG_UNNAMED_3
{
  KTMOH_CommitTransaction_Result = 1,
  KTMOH_RollbackTransaction_Result = 2,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

typedef struct _WNODE_HEADER
{
  /* 0x0000 */ unsigned long BufferSize;
  /* 0x0004 */ unsigned long ProviderId;
  union
  {
    /* 0x0008 */ unsigned __int64 HistoricalContext;
    struct
    {
      /* 0x0008 */ unsigned long Version;
      /* 0x000c */ unsigned long Linkage;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0010 */ unsigned long CountLost;
    /* 0x0010 */ void* KernelHandle;
    /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  }; /* size: 0x0008 */
  /* 0x0018 */ struct _GUID Guid;
  /* 0x0028 */ unsigned long ClientContext;
  /* 0x002c */ unsigned long Flags;
} WNODE_HEADER, *PWNODE_HEADER; /* size: 0x0030 */

struct tagWNODE_SINGLE_INSTANCE
{
  /* 0x0000 */ struct _WNODE_HEADER WnodeHeader;
  /* 0x0030 */ unsigned long OffsetInstanceName;
  /* 0x0034 */ unsigned long InstanceIndex;
  /* 0x0038 */ unsigned long DataBlockOffset;
  /* 0x003c */ unsigned long SizeDataBlock;
  /* 0x0040 */ unsigned char* VariableData /* zero-length array */;
}; /* size: 0x0040 */

typedef enum _WOW64_TURBO_SERVICE_TYPE
{
  ServiceNoTurbo = 0,
  Service0Arg = 1,
  Service0ArgReloadState = 2,
  Service1ArgSp = 3,
  Service1ArgNSp = 4,
  Service2ArgNSpNSp = 5,
  Service2ArgNSpNSpReloadState = 6,
  Service2ArgSpNSp = 7,
  Service2ArgSpSp = 8,
  Service2ArgNSpSp = 9,
  Service3ArgNSpNSpNSp = 10,
  Service3ArgSpSpSp = 11,
  Service3ArgSpNSpNSp = 12,
  Service3ArgSpNSpNSpReloadState = 13,
  Service3ArgSpSpNSp = 14,
  Service3ArgNSpSpNSp = 15,
  Service3ArgSpNSpSp = 16,
  Service4ArgNSpNSpNSpNSp = 17,
  Service4ArgSpSpNSpNSp = 18,
  Service4ArgSpSpNSpNSpReloadState = 19,
  Service4ArgSpNSpNSpNSp = 20,
  Service4ArgSpNSpNSpNSpReloadState = 21,
  Service4ArgNSpSpNSpNSp = 22,
  Service4ArgSpSpSpNSp = 23,
  ServiceCpupTdQuerySystemTime = 24,
  ServiceCpupTdGetCurrentProcessorNumber = 25,
  ServiceCpupTdReadWriteFile = 26,
  ServiceCpupTdDeviceIoControlFile = 27,
  ServiceCpupTdRemoveIoCompletion = 28,
  ServiceCpupTdWaitForMultipleObjects = 29,
  ServiceCpupTdWaitForMultipleObjects32 = 30,
  Wow64ServiceTypesCount = 31,
} WOW64_TURBO_SERVICE_TYPE, *PWOW64_TURBO_SERVICE_TYPE;

enum VI_FAULTS_DECISION_INDEX
{
  ViFaultsDecisionNotInitializedResourceAlloc = 0,
  ViFaultsDecisionNotInitializedPoolAlloc = 1,
  ViFaultsDecisionInjectInPage = 2,
  ViFaultsDecisionNotSufficientlyBooted = 3,
  ViFaultsDecisionAppNotTarget = 4,
  ViFaultsDecisionAppIsTarget = 5,
  ViFaultsDecisionProbabilityFits = 6,
  ViFaultsDecisionProbabilityDoesntFit = 7,
  ViFaultsDecisionBurstInject = 8,
  ViFaultsDecisionTagNotTarget = 9,
  ViFaultsDecisionTagIsTarget = 10,
  ViFaultsDecisionDisabled = 11,
  ViFaultsDecisionMax = 12,
};

typedef struct _STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ long Padding_27;
  /* 0x0008 */ char* Buffer;
} STRING, *PSTRING; /* size: 0x0010 */

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
  /* 0x0000 */ unsigned short Flags;
  /* 0x0002 */ unsigned short Length;
  /* 0x0004 */ unsigned long TimeStamp;
  /* 0x0008 */ struct _STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR; /* size: 0x0018 */

enum KE_PROCESSOR_CHANGE_NOTIFY_STATE
{
  KeProcessorAddStartNotify = 0,
  KeProcessorAddCompleteNotify = 1,
  KeProcessorAddFailureNotify = 2,
};

typedef enum _TABLE_SEARCH_RESULT
{
  TableEmptyTree = 0,
  TableFoundNode = 1,
  TableInsertAsLeft = 2,
  TableInsertAsRight = 3,
} TABLE_SEARCH_RESULT, *PTABLE_SEARCH_RESULT;

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

typedef enum _EXTENDED_AGP_REGISTER
{
  IsochStatus = 0,
  AgpControl = 1,
  ApertureSize = 2,
  AperturePageSize = 3,
  GartLow = 4,
  GartHigh = 5,
  IsochCommand = 6,
} EXTENDED_AGP_REGISTER, *PEXTENDED_AGP_REGISTER;

typedef enum _CC_READ_PATTERN
{
  NoPattern = 0,
  Sequential = 1,
  DetectedSequential = 2,
  Strided = 3,
} CC_READ_PATTERN, *PCC_READ_PATTERN;

typedef enum _DEBUGOBJECTINFOCLASS
{
  DebugObjectFlags = 1,
  MaxDebugObjectInfoClass = 2,
} DEBUGOBJECTINFOCLASS, *PDEBUGOBJECTINFOCLASS;

typedef struct _IOV_STACK_LOCATION
{
  /* 0x0000 */ unsigned char InUse;
  /* 0x0001 */ char Padding_28[3];
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _IOV_STACK_LOCATION* RequestsFirstStackLocation;
  /* 0x0010 */ struct _LIST_ENTRY CallStackData;
  /* 0x0020 */ struct _IO_STACK_LOCATION* IrpSp;
  /* 0x0028 */ void* LastDispatch;
  /* 0x0030 */ union _LARGE_INTEGER PerfDispatchStart;
  /* 0x0038 */ union _LARGE_INTEGER PerfStackLocationStart;
  /* 0x0040 */ struct _DEVICE_OBJECT* ReferencingObject;
  /* 0x0048 */ long ReferencingCount;
  /* 0x004c */ long Padding_29;
  /* 0x0050 */ struct _IO_STATUS_BLOCK InitialStatusBlock;
  /* 0x0060 */ struct _IO_STATUS_BLOCK LastStatusBlock;
  /* 0x0070 */ struct _ETHREAD* ThreadDispatchedTo;
} IOV_STACK_LOCATION, *PIOV_STACK_LOCATION; /* size: 0x0078 */

typedef struct _IOV_SESSION_DATA
{
  /* 0x0000 */ struct _IOV_REQUEST_PACKET* IovRequestPacket;
  /* 0x0008 */ long SessionRefCount;
  /* 0x000c */ long Padding_30;
  /* 0x0010 */ struct _LIST_ENTRY SessionLink;
  /* 0x0020 */ unsigned long SessionFlags;
  /* 0x0024 */ long Padding_31;
  /* 0x0028 */ struct _ETHREAD* OriginatorThread;
  /* 0x0030 */ struct _DEVICE_OBJECT* DeviceLastCalled;
  /* 0x0038 */ unsigned long ForwardMethod;
  /* 0x003c */ long Padding_32;
  /* 0x0040 */ struct _IRP* BestVisibleIrp;
  /* 0x0048 */ unsigned long Settings;
  /* 0x004c */ long Padding_33;
  /* 0x0050 */ struct _IOV_STACK_LOCATION StackData[1];
} IOV_SESSION_DATA, *PIOV_SESSION_DATA; /* size: 0x00c8 */

typedef enum _FUNCTION_TABLE_TYPE
{
  RF_SORTED = 0,
  RF_UNSORTED = 1,
  RF_CALLBACK = 2,
} FUNCTION_TABLE_TYPE, *PFUNCTION_TABLE_TYPE;

typedef enum _PNP_UNLOCK_UNLINK_ACTION
{
  UnlinkRemovedDeviceNodes = 0,
  UnlinkAllDeviceNodesPendingClose = 1,
  UnlinkOnlyChildDeviceNodesPendingClose = 2,
} PNP_UNLOCK_UNLINK_ACTION, *PPNP_UNLOCK_UNLINK_ACTION;

typedef struct _RTL_CRITICAL_SECTION_DEBUG
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned short CreatorBackTraceIndex;
  /* 0x0004 */ long Padding_34;
  /* 0x0008 */ struct _RTL_CRITICAL_SECTION* CriticalSection;
  /* 0x0010 */ struct _LIST_ENTRY ProcessLocksList;
  /* 0x0020 */ unsigned long EntryCount;
  /* 0x0024 */ unsigned long ContentionCount;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ unsigned short CreatorBackTraceIndexHigh;
  /* 0x002e */ unsigned short SpareUSHORT;
} RTL_CRITICAL_SECTION_DEBUG, *PRTL_CRITICAL_SECTION_DEBUG; /* size: 0x0030 */

typedef enum _FP__IEEE_ROUNDING_MODE
{
  FpRoundNearest = 0,
  FpRoundMinusInfinity = 1,
  FpRoundPlusInfinity = 2,
  FpRoundChopped = 3,
} FP__IEEE_ROUNDING_MODE, *PFP__IEEE_ROUNDING_MODE;

typedef struct _KAFFINITY_EX
{
  /* 0x0000 */ unsigned short Count;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ unsigned __int64 Bitmap[4];
} KAFFINITY_EX, *PKAFFINITY_EX; /* size: 0x0028 */

typedef struct _PROCESSOR_PERF_STATES
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ char Padding_35[2];
  /* 0x0004 */ unsigned long ProcessorCount;
  /* 0x0008 */ unsigned long MaxFrequency;
  /* 0x000c */ unsigned long MinPerfPercent;
  /* 0x0010 */ unsigned long MinThrottlePercent;
  /* 0x0014 */ long Padding_36;
  /* 0x0018 */ struct _KAFFINITY_EX TargetProcessors;
  /* 0x0040 */ void* FeedbackHandler /* function */;
  /* 0x0048 */ void* GetFFHThrottleState /* function */;
  /* 0x0050 */ void* BoostPolicyHandler /* function */;
  /* 0x0058 */ void* PerfSelectionHandler /* function */;
  /* 0x0060 */ void* PerfHandler /* function */;
  /* 0x0068 */ void* PerfControlInitiate /* function */;
  /* 0x0070 */ void* PerfControlCommit /* function */;
  /* 0x0078 */ struct _PROCESSOR_PERF_INFO* Processors;
} PROCESSOR_PERF_STATES, *PPROCESSOR_PERF_STATES; /* size: 0x0080 */

typedef enum _PNP_DEVNODE_STATE
{
  DeviceNodeUnspecified = 768,
  DeviceNodeUninitialized = 769,
  DeviceNodeInitialized = 770,
  DeviceNodeDriversAdded = 771,
  DeviceNodeResourcesAssigned = 772,
  DeviceNodeStartPending = 773,
  DeviceNodeStartCompletion = 774,
  DeviceNodeStartPostWork = 775,
  DeviceNodeStarted = 776,
  DeviceNodeQueryStopped = 777,
  DeviceNodeStopped = 778,
  DeviceNodeRestartCompletion = 779,
  DeviceNodeEnumeratePending = 780,
  DeviceNodeEnumerateCompletion = 781,
  DeviceNodeAwaitingQueuedDeletion = 782,
  DeviceNodeAwaitingQueuedRemoval = 783,
  DeviceNodeQueryRemoved = 784,
  DeviceNodeRemovePendingCloses = 785,
  DeviceNodeRemoved = 786,
  DeviceNodeDeletePendingCloses = 787,
  DeviceNodeDeleted = 788,
  MaxDeviceNodeState = 789,
} PNP_DEVNODE_STATE, *PPNP_DEVNODE_STATE;

typedef enum _SEMAPHORE_INFORMATION_CLASS
{
  SemaphoreBasicInformation = 0,
} SEMAPHORE_INFORMATION_CLASS, *PSEMAPHORE_INFORMATION_CLASS;

typedef struct _MAPPING
{
  /* 0x0000 */ unsigned long NextVbn;
  /* 0x0004 */ unsigned long Lbn;
} MAPPING, *PMAPPING; /* size: 0x0008 */

typedef enum _INTEL_CACHE_TYPE
{
  IntelCacheNull = 0,
  IntelCacheData = 1,
  IntelCacheInstruction = 2,
  IntelCacheUnified = 3,
  IntelCacheRam = 4,
  IntelCacheTrace = 5,
} INTEL_CACHE_TYPE, *PINTEL_CACHE_TYPE;

enum SYSID_ENTRY_TYPE
{
  SYSID_UNKNOWN_TYPE = 0,
  SYSID_UUID_TYPE = 1,
  SYSID_1394_TYPE = 2,
};

typedef enum _THREADINFOCLASS
{
  ThreadBasicInformation = 0,
  ThreadTimes = 1,
  ThreadPriority = 2,
  ThreadBasePriority = 3,
  ThreadAffinityMask = 4,
  ThreadImpersonationToken = 5,
  ThreadDescriptorTableEntry = 6,
  ThreadEnableAlignmentFaultFixup = 7,
  ThreadEventPair_Reusable = 8,
  ThreadQuerySetWin32StartAddress = 9,
  ThreadZeroTlsCell = 10,
  ThreadPerformanceCount = 11,
  ThreadAmILastThread = 12,
  ThreadIdealProcessor = 13,
  ThreadPriorityBoost = 14,
  ThreadSetTlsArrayAddress = 15,
  ThreadIsIoPending = 16,
  ThreadHideFromDebugger = 17,
  ThreadBreakOnTermination = 18,
  ThreadSwitchLegacyState = 19,
  ThreadIsTerminated = 20,
  ThreadLastSystemCall = 21,
  ThreadIoPriority = 22,
  ThreadCycleTime = 23,
  ThreadPagePriority = 24,
  ThreadActualBasePriority = 25,
  ThreadTebInformation = 26,
  ThreadCSwitchMon = 27,
  ThreadCSwitchPmu = 28,
  ThreadWow64Context = 29,
  ThreadGroupInformation = 30,
  ThreadUmsInformation = 31,
  ThreadCounterProfiling = 32,
  ThreadIdealProcessorEx = 33,
  MaxThreadInfoClass = 34,
} THREADINFOCLASS, *PTHREADINFOCLASS;

enum POWER_STATE_HANDLER_TYPE
{
  PowerStateSleeping1 = 0,
  PowerStateSleeping2 = 1,
  PowerStateSleeping3 = 2,
  PowerStateSleeping4 = 3,
  PowerStateShutdownOff = 4,
  PowerStateShutdownReset = 5,
  PowerStateSleeping4Firmware = 6,
  PowerStateMaximum = 7,
};

typedef enum _HARDWARE_PROFILE_BUS_TYPE
{
  HardwareProfileBusTypeACPI = 0,
} HARDWARE_PROFILE_BUS_TYPE, *PHARDWARE_PROFILE_BUS_TYPE;

enum KERNEL_MCE_DELIVERY_OPERATION
{
  MceNotification = 0,
  McaAvailable = 1,
  CmcAvailable = 2,
  CpeAvailable = 3,
  CmcSwitchToPolledMode = 4,
  CpeSwitchToPolledMode = 5,
};

typedef enum _MEMORY_INFORMATION_CLASS
{
  MemoryBasicInformation = 0,
  MemoryWorkingSetInformation = 1,
  MemoryMappedFilenameInformation = 2,
  MemoryRegionInformation = 3,
  MemoryWorkingSetExInformation = 4,
} MEMORY_INFORMATION_CLASS, *PMEMORY_INFORMATION_CLASS;

enum PCI_EXPRESS_CARD_PRESENCE
{
  SlotEmpty = 0,
  CardPresent = 1,
};

typedef struct _TRIAGE_DATA_BLOCK
{
  /* 0x0000 */ unsigned __int64 Address;
  /* 0x0008 */ unsigned long Offset;
  /* 0x000c */ unsigned long Size;
} TRIAGE_DATA_BLOCK, *PTRIAGE_DATA_BLOCK; /* size: 0x0010 */

typedef enum _KWAIT_BLOCK_STATE
{
  WaitBlockBypassStart = 0,
  WaitBlockBypassComplete = 1,
  WaitBlockActive = 2,
  WaitBlockInactive = 3,
  WaitBlockAllStates = 4,
} KWAIT_BLOCK_STATE, *PKWAIT_BLOCK_STATE;

enum KTM_STATE
{
  KKtmUninitialized = 0,
  KKtmInitialized = 1,
  KKtmRecovering = 2,
  KKtmOnline = 3,
  KKtmRecoveryFailed = 4,
  KKtmOffline = 5,
};

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef enum _CREATE_FILE_TYPE
{
  CreateFileTypeNone = 0,
  CreateFileTypeNamedPipe = 1,
  CreateFileTypeMailslot = 2,
} CREATE_FILE_TYPE, *PCREATE_FILE_TYPE;

struct CHUNKHEADER
{
  /* 0x0000 */ struct _LIST_ENTRY ChunkList;
  /* 0x0010 */ struct _LIST_ENTRY FreeEntryHead;
  /* 0x0020 */ unsigned long EntriesInUse;
  /* 0x0024 */ long __PADDING__[1];
}; /* size: 0x0028 */

typedef enum _OBJECT_INFORMATION_CLASS
{
  ObjectBasicInformation = 0,
  ObjectNameInformation = 1,
  ObjectTypeInformation = 2,
  ObjectTypesInformation = 3,
  ObjectHandleFlagInformation = 4,
  ObjectSessionInformation = 5,
  MaxObjectInfoClass = 6,
} OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef enum _WAIT_TYPE
{
  WaitAll = 0,
  WaitAny = 1,
} WAIT_TYPE, *PWAIT_TYPE;

typedef enum _HARDWARE_COUNTER_TYPE
{
  PMCCounter = 0,
  MaxHardwareCounterType = 1,
} HARDWARE_COUNTER_TYPE, *PHARDWARE_COUNTER_TYPE;

typedef enum _IO_PRIORITY_HINT
{
  IoPriorityVeryLow = 0,
  IoPriorityLow = 1,
  IoPriorityNormal = 2,
  IoPriorityHigh = 3,
  IoPriorityCritical = 4,
  MaxIoPriorityTypes = 5,
} IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef struct _FILE_IO_PRIORITY_HINT_INFORMATION
{
  /* 0x0000 */ enum _IO_PRIORITY_HINT PriorityHint;
} FILE_IO_PRIORITY_HINT_INFORMATION, *PFILE_IO_PRIORITY_HINT_INFORMATION; /* size: 0x0004 */

typedef enum _KTHREAD_STATE
{
  Initialized = 0,
  Ready = 1,
  Running = 2,
  Standby = 3,
  Terminated = 4,
  Waiting = 5,
  Transition = 6,
  DeferredReady = 7,
  GateWaitObsolete = 8,
} KTHREAD_STATE, *PKTHREAD_STATE;

typedef struct _EM_ENTRY_REGISTRATION
{
  /* 0x0000 */ const struct _GUID* EntryGuid;
  /* 0x0008 */ void* LazyEntryCallback /* function */;
  /* 0x0010 */ void* LazyCallbackContext;
} EM_ENTRY_REGISTRATION, *PEM_ENTRY_REGISTRATION; /* size: 0x0018 */

typedef enum _POWERSTATETASK
{
  PowerState_BlockSessionSwitch = 0,
  PowerState_Init = 1,
  PowerState_SuspendApps = 2,
  PowerState_SuspendServices = 3,
  PowerState_NotifyWL = 4,
  PowerState_ResumeApps = 5,
  PowerState_ResumeServices = 6,
  PowerState_UnBlockSessionSwitch = 7,
  PowerState_End = 8,
  PowerState_Flush = 9,
  PowerState_StartPartitionReplace = 10,
  PowerState_EndPartitionReplace = 11,
} POWERSTATETASK, *PPOWERSTATETASK;

typedef enum _HAL_QUERY_INFORMATION_CLASS
{
  HalInstalledBusInformation = 0,
  HalProfileSourceInformation = 1,
  HalInformationClassUnused1 = 2,
  HalPowerInformation = 3,
  HalProcessorSpeedInformation = 4,
  HalCallbackInformation = 5,
  HalMapRegisterInformation = 6,
  HalMcaLogInformation = 7,
  HalFrameBufferCachingInformation = 8,
  HalDisplayBiosInformation = 9,
  HalProcessorFeatureInformation = 10,
  HalNumaTopologyInterface = 11,
  HalErrorInformation = 12,
  HalCmcLogInformation = 13,
  HalCpeLogInformation = 14,
  HalQueryMcaInterface = 15,
  HalQueryAMLIIllegalIOPortAddresses = 16,
  HalQueryMaxHotPlugMemoryAddress = 17,
  HalPartitionIpiInterface = 18,
  HalPlatformInformation = 19,
  HalQueryProfileSourceList = 20,
  HalInitLogInformation = 21,
  HalFrequencyInformation = 22,
  HalProcessorBrandString = 23,
  HalHypervisorInformation = 24,
  HalPlatformTimerInformation = 25,
  HalAcpiAuditInformation = 26,
} HAL_QUERY_INFORMATION_CLASS, *PHAL_QUERY_INFORMATION_CLASS;

typedef struct _PROCESSOR_NUMBER
{
  /* 0x0000 */ unsigned short Group;
  /* 0x0002 */ unsigned char Number;
  /* 0x0003 */ unsigned char Reserved;
} PROCESSOR_NUMBER, *PPROCESSOR_NUMBER; /* size: 0x0004 */

typedef struct _COUNTER_READING
{
  /* 0x0000 */ enum _HARDWARE_COUNTER_TYPE Type;
  /* 0x0004 */ unsigned long Index;
  /* 0x0008 */ unsigned __int64 Start;
  /* 0x0010 */ unsigned __int64 Total;
} COUNTER_READING, *PCOUNTER_READING; /* size: 0x0018 */

typedef struct _THREAD_PERFORMANCE_DATA
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ struct _PROCESSOR_NUMBER ProcessorNumber;
  /* 0x0008 */ unsigned long ContextSwitches;
  /* 0x000c */ unsigned long HwCountersCount;
  /* 0x0010 */ volatile unsigned __int64 UpdateCount;
  /* 0x0018 */ unsigned __int64 WaitReasonBitMap;
  /* 0x0020 */ unsigned __int64 HardwareCounters;
  /* 0x0028 */ struct _COUNTER_READING CycleTime;
  /* 0x0040 */ struct _COUNTER_READING HwCounters[16];
} THREAD_PERFORMANCE_DATA, *PTHREAD_PERFORMANCE_DATA; /* size: 0x01c0 */

typedef enum _LINK_TRACKING_INFORMATION_TYPE
{
  NtfsLinkTrackingInformation = 0,
  DfsLinkTrackingInformation = 1,
} LINK_TRACKING_INFORMATION_TYPE, *PLINK_TRACKING_INFORMATION_TYPE;

typedef struct _RESOURCE_HASH_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ void* Address;
  /* 0x0018 */ unsigned long ContentionCount;
  /* 0x001c */ unsigned long Number;
} RESOURCE_HASH_ENTRY, *PRESOURCE_HASH_ENTRY; /* size: 0x0020 */

typedef enum _PLUGPLAY_EVENT_CATEGORY
{
  HardwareProfileChangeEvent = 0,
  TargetDeviceChangeEvent = 1,
  DeviceClassChangeEvent = 2,
  CustomDeviceEvent = 3,
  DeviceInstallEvent = 4,
  DeviceArrivalEvent = 5,
  VetoEvent = 6,
  BlockedDriverEvent = 7,
  InvalidIDEvent = 8,
  DevicePropertyChangeEvent = 9,
  DeviceInstanceRemovalEvent = 10,
  MaxPlugEventCategory = 11,
} PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

typedef enum _HV_GUEST_OS_MICROSOFT_IDS
{
  HvGuestOsMicrosoftUndefined = 0,
  HvGuestOsMicrosoftMSDOS = 1,
  HvGuestOsMicrosoftWindows3x = 2,
  HvGuestOsMicrosoftWindows9x = 3,
  HvGuestOsMicrosoftWindowsNT = 4,
  HvGuestOsMicrosoftWindowsCE = 5,
} HV_GUEST_OS_MICROSOFT_IDS, *PHV_GUEST_OS_MICROSOFT_IDS;

typedef enum _RESOURCEMANAGER_INFORMATION_CLASS
{
  ResourceManagerBasicInformation = 0,
  ResourceManagerCompletionInformation = 1,
} RESOURCEMANAGER_INFORMATION_CLASS, *PRESOURCEMANAGER_INFORMATION_CLASS;

typedef enum _KINTERRUPT_MODE
{
  LevelSensitive = 0,
  Latched = 1,
} KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef struct _TOKEN_PRIMARY_GROUP
{
  /* 0x0000 */ void* PrimaryGroup;
} TOKEN_PRIMARY_GROUP, *PTOKEN_PRIMARY_GROUP; /* size: 0x0008 */

typedef enum _KTMOBJECT_TYPE
{
  KTMOBJECT_TRANSACTION = 0,
  KTMOBJECT_TRANSACTION_MANAGER = 1,
  KTMOBJECT_RESOURCE_MANAGER = 2,
  KTMOBJECT_ENLISTMENT = 3,
  KTMOBJECT_INVALID = 4,
} KTMOBJECT_TYPE, *PKTMOBJECT_TYPE;

typedef enum _ETW_RT_EVENT_LOSS
{
  EtwRtEventNoLoss = 0,
  EtwRtEventLost = 1,
  EtwRtBufferLost = 2,
  EtwRtBackupLost = 3,
  EtwRtEventLossMax = 4,
} ETW_RT_EVENT_LOSS, *PETW_RT_EVENT_LOSS;

typedef struct _ACCESS_DENIED_CALLBACK_OBJECT_ACE
{
  /* 0x0000 */ struct _ACE_HEADER Header;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _GUID ObjectType;
  /* 0x001c */ struct _GUID InheritedObjectType;
  /* 0x002c */ unsigned long SidStart;
} ACCESS_DENIED_CALLBACK_OBJECT_ACE, *PACCESS_DENIED_CALLBACK_OBJECT_ACE; /* size: 0x0030 */

typedef enum _WIN32_POWERINFO_TYPE
{
  PowerInfo_PolicyChange = 0,
  PowerInfo_UserPresent = 1,
  PowerInfo_DisplayRequired = 2,
  PowerInfo_Max = 3,
} WIN32_POWERINFO_TYPE, *PWIN32_POWERINFO_TYPE;

enum tagWMI_CLOCK_TYPE
{
  WMICT_DEFAULT = 0,
  WMICT_SYSTEMTIME = 1,
  WMICT_PERFCOUNTER = 2,
  WMICT_PROCESS = 3,
  WMICT_THREAD = 4,
  WMICT_CPUCYCLE = 5,
};

struct EFI_GUID
{
  /* 0x0000 */ unsigned int Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
}; /* size: 0x0010 */

typedef struct _VENDOR_DEVICE_PATH
{
  /* 0x0000 */ struct _EFI_DEVICE_PATH Header;
  /* 0x0004 */ struct EFI_GUID Guid;
} VENDOR_DEVICE_PATH, *PVENDOR_DEVICE_PATH; /* size: 0x0014 */

typedef enum _PCI_HARDWARE_INTERFACE
{
  PciConventional = 0,
  PciXMode1 = 1,
  PciXMode2 = 2,
  PciExpress = 3,
} PCI_HARDWARE_INTERFACE, *PPCI_HARDWARE_INTERFACE;

enum EVENTSECURITYOPERATION
{
  EventSecuritySetDACL = 0,
  EventSecuritySetSACL = 1,
  EventSecurityAddDACL = 2,
  EventSecurityAddSACL = 3,
  EventSecurityMax = 4,
};

typedef struct _SID_IDENTIFIER_AUTHORITY
{
  /* 0x0000 */ unsigned char Value[6];
} SID_IDENTIFIER_AUTHORITY, *PSID_IDENTIFIER_AUTHORITY; /* size: 0x0006 */

typedef struct _SID
{
  /* 0x0000 */ unsigned char Revision;
  /* 0x0001 */ unsigned char SubAuthorityCount;
  /* 0x0002 */ struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority;
  /* 0x0008 */ unsigned long SubAuthority[1];
} SID, *PSID; /* size: 0x000c */

typedef struct _PROC_HISTORY_ENTRY
{
  /* 0x0000 */ unsigned short Utility;
  /* 0x0002 */ unsigned char Frequency;
  /* 0x0003 */ unsigned char Reserved;
} PROC_HISTORY_ENTRY, *PPROC_HISTORY_ENTRY; /* size: 0x0004 */

typedef enum _EX_HOST_INFORMATION_CLASS
{
  ExHostInformationSeal = 0,
  MaxHostInformationClass = 1,
} EX_HOST_INFORMATION_CLASS, *PEX_HOST_INFORMATION_CLASS;

typedef enum _FP__IEEE_FORMAT
{
  FpFormatFp32 = 0,
  FpFormatFp64 = 1,
  FpFormatFp80 = 2,
  FpFormatFp128 = 3,
  FpFormatI16 = 4,
  FpFormatI32 = 5,
  FpFormatI64 = 6,
  FpFormatU16 = 7,
  FpFormatU32 = 8,
  FpFormatU64 = 9,
  FpFormatCompare = 10,
  FpFormatString = 11,
} FP__IEEE_FORMAT, *PFP__IEEE_FORMAT;

typedef enum _DMA_SPEED
{
  Compatible = 0,
  TypeA = 1,
  TypeB = 2,
  TypeC = 3,
  TypeF = 4,
  MaximumDmaSpeed = 5,
} DMA_SPEED, *PDMA_SPEED;

typedef enum _LICENSING_TAMPER_STATE
{
  LicensingTamperNone = 0,
  LicensingTamperTrustedStore = 1,
  LicensingTamperServiceStopped = 2,
  LicensingTamperModuleAuthentication = 3,
  LicensingTamperCacheData = 4,
  LicensingTamperConsumptionFailure = 5,
  LicensingTamperOther = 6,
} LICENSING_TAMPER_STATE, *PLICENSING_TAMPER_STATE;

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

typedef enum _ARM_FUNCTION_TABLE_TYPE
{
  ARM_RF_SORTED = 0,
  ARM_RF_UNSORTED = 1,
  ARM_RF_CALLBACK = 2,
} ARM_FUNCTION_TABLE_TYPE, *PARM_FUNCTION_TABLE_TYPE;

typedef struct _ARM_DYNAMIC_FUNCTION_TABLE
{
  /* 0x0000 */ struct LIST_ENTRY32 ListEntry;
  /* 0x0008 */ unsigned long FunctionTable;
  /* 0x000c */ long Padding_37;
  /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0018 */ unsigned long MinimumAddress;
  /* 0x001c */ unsigned long MaximumAddress;
  /* 0x0020 */ unsigned long BaseAddress;
  /* 0x0024 */ unsigned long Callback;
  /* 0x0028 */ unsigned long Context;
  /* 0x002c */ unsigned long OutOfProcessCallbackDll;
  /* 0x0030 */ enum _ARM_FUNCTION_TABLE_TYPE Type;
  /* 0x0034 */ unsigned long EntryCount;
} ARM_DYNAMIC_FUNCTION_TABLE, *PARM_DYNAMIC_FUNCTION_TABLE; /* size: 0x0038 */

typedef enum _PORT_INFORMATION_CLASS
{
  PortBasicInformation = 0,
  PortDumpInformation = 1,
} PORT_INFORMATION_CLASS, *PPORT_INFORMATION_CLASS;

typedef enum _IPI_TYPE
{
  IpiAffinity = 0,
  IpiAllButSelf = 1,
  IpiAll = 2,
} IPI_TYPE, *PIPI_TYPE;

typedef enum _PS_STD_HANDLE_STATE
{
  PsNeverDuplicate = 0,
  PsRequestDuplicate = 1,
  PsAlwaysDuplicate = 2,
  PsMaxStdHandleStates = 3,
} PS_STD_HANDLE_STATE, *PPS_STD_HANDLE_STATE;

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
  TransportRelations = 6,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef struct _REGENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY InUseEntryList;
  union
  {
    /* 0x0010 */ struct _DEVICE_OBJECT* DeviceObject;
    /* 0x0010 */ void** WmiEntry /* function */;
  }; /* size: 0x0008 */
  /* 0x0018 */ long RefCount;
  /* 0x001c */ long Flags;
  /* 0x0020 */ struct _DEVICE_OBJECT* PDO;
  /* 0x0028 */ unsigned long MaxInstanceNames;
  /* 0x002c */ long IrpCount;
  /* 0x0030 */ unsigned long ProviderId;
  /* 0x0034 */ long Padding_38;
  /* 0x0038 */ struct tagDATASOURCE* DataSource;
  /* 0x0040 */ struct _KEVENT Event;
} REGENTRY, *PREGENTRY; /* size: 0x0058 */

typedef struct _TEB_ACTIVE_FRAME_CONTEXT
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ long Padding_39;
  /* 0x0008 */ const char* FrameName;
} TEB_ACTIVE_FRAME_CONTEXT, *PTEB_ACTIVE_FRAME_CONTEXT; /* size: 0x0010 */

typedef enum _KEY_VALUE_INFORMATION_CLASS
{
  KeyValueBasicInformation = 0,
  KeyValueFullInformation = 1,
  KeyValuePartialInformation = 2,
  KeyValueFullInformationAlign64 = 3,
  KeyValuePartialInformationAlign64 = 4,
  MaxKeyValueInfoClass = 5,
} KEY_VALUE_INFORMATION_CLASS, *PKEY_VALUE_INFORMATION_CLASS;

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _TOKEN_PRIVILEGES
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ struct _LUID_AND_ATTRIBUTES Privileges[1];
} TOKEN_PRIVILEGES, *PTOKEN_PRIVILEGES; /* size: 0x0010 */

typedef enum _DMA_WIDTH
{
  Width8Bits = 0,
  Width16Bits = 1,
  Width32Bits = 2,
  MaximumDmaWidth = 3,
} DMA_WIDTH, *PDMA_WIDTH;

typedef enum _SHRINK_VOLUME_REQUEST_TYPES
{
  ShrinkPrepare = 1,
  ShrinkCommit = 2,
  ShrinkAbort = 3,
} SHRINK_VOLUME_REQUEST_TYPES, *PSHRINK_VOLUME_REQUEST_TYPES;

typedef struct _IO_TIMER
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short TimerFlag;
  /* 0x0004 */ long Padding_40;
  /* 0x0008 */ struct _LIST_ENTRY TimerList;
  /* 0x0018 */ void* TimerRoutine /* function */;
  /* 0x0020 */ void* Context;
  /* 0x0028 */ struct _DEVICE_OBJECT* DeviceObject;
} IO_TIMER, *PIO_TIMER; /* size: 0x0030 */

typedef enum _PROCESSOR_CACHE_TYPE
{
  CacheUnified = 0,
  CacheInstruction = 1,
  CacheData = 2,
  CacheTrace = 3,
} PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

enum POWER_INFORMATION_LEVEL
{
  SystemPowerPolicyAc = 0,
  SystemPowerPolicyDc = 1,
  VerifySystemPolicyAc = 2,
  VerifySystemPolicyDc = 3,
  SystemPowerCapabilities = 4,
  SystemBatteryState = 5,
  SystemPowerStateHandler = 6,
  ProcessorStateHandler = 7,
  SystemPowerPolicyCurrent = 8,
  AdministratorPowerPolicy = 9,
  SystemReserveHiberFile = 10,
  ProcessorInformation = 11,
  SystemPowerInformation = 12,
  ProcessorStateHandler2 = 13,
  LastWakeTime = 14,
  LastSleepTime = 15,
  SystemExecutionState = 16,
  SystemPowerStateNotifyHandler = 17,
  ProcessorPowerPolicyAc = 18,
  ProcessorPowerPolicyDc = 19,
  VerifyProcessorPowerPolicyAc = 20,
  VerifyProcessorPowerPolicyDc = 21,
  ProcessorPowerPolicyCurrent = 22,
  SystemPowerStateLogging = 23,
  SystemPowerLoggingEntry = 24,
  SetPowerSettingValue = 25,
  NotifyUserPowerSetting = 26,
  PowerInformationLevelUnused0 = 27,
  PowerInformationLevelUnused1 = 28,
  SystemVideoState = 29,
  TraceApplicationPowerMessage = 30,
  TraceApplicationPowerMessageEnd = 31,
  ProcessorPerfStates = 32,
  ProcessorIdleStates = 33,
  ProcessorCap = 34,
  SystemWakeSource = 35,
  SystemHiberFileInformation = 36,
  TraceServicePowerMessage = 37,
  ProcessorLoad = 38,
  PowerShutdownNotification = 39,
  MonitorCapabilities = 40,
  SessionPowerInit = 41,
  SessionDisplayState = 42,
  PowerRequestCreate = 43,
  PowerRequestAction = 44,
  GetPowerRequestList = 45,
  ProcessorInformationEx = 46,
  NotifyUserModeLegacyPowerEvent = 47,
  GroupPark = 48,
  ProcessorIdleDomains = 49,
  WakeTimerList = 50,
  SystemHiberFileSize = 51,
  PowerInformationLevelMaximum = 52,
};

typedef enum _SE_ADT_PARAMETER_TYPE
{
  SeAdtParmTypeNone = 0,
  SeAdtParmTypeString = 1,
  SeAdtParmTypeFileSpec = 2,
  SeAdtParmTypeUlong = 3,
  SeAdtParmTypeSid = 4,
  SeAdtParmTypeLogonId = 5,
  SeAdtParmTypeNoLogonId = 6,
  SeAdtParmTypeAccessMask = 7,
  SeAdtParmTypePrivs = 8,
  SeAdtParmTypeObjectTypes = 9,
  SeAdtParmTypeHexUlong = 10,
  SeAdtParmTypePtr = 11,
  SeAdtParmTypeTime = 12,
  SeAdtParmTypeGuid = 13,
  SeAdtParmTypeLuid = 14,
  SeAdtParmTypeHexInt64 = 15,
  SeAdtParmTypeStringList = 16,
  SeAdtParmTypeSidList = 17,
  SeAdtParmTypeDuration = 18,
  SeAdtParmTypeUserAccountControl = 19,
  SeAdtParmTypeNoUac = 20,
  SeAdtParmTypeMessage = 21,
  SeAdtParmTypeDateTime = 22,
  SeAdtParmTypeSockAddr = 23,
  SeAdtParmTypeSD = 24,
  SeAdtParmTypeLogonHours = 25,
  SeAdtParmTypeLogonIdNoSid = 26,
  SeAdtParmTypeUlongNoConv = 27,
  SeAdtParmTypeSockAddrNoPort = 28,
  SeAdtParmTypeAccessReason = 29,
} SE_ADT_PARAMETER_TYPE, *PSE_ADT_PARAMETER_TYPE;

typedef enum _PROC_HYPERVISOR_STATE
{
  ProcHypervisorNone = 0,
  ProcHypervisorPresent = 1,
  ProcHypervisorPower = 2,
} PROC_HYPERVISOR_STATE, *PPROC_HYPERVISOR_STATE;

typedef union _WHEA_PERSISTENCE_INFO
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Signature : 16; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Length : 24; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Identifier : 16; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 Attributes : 2; /* bit position: 56 */
      /* 0x0000 */ unsigned __int64 DoNotLog : 1; /* bit position: 58 */
      /* 0x0000 */ unsigned __int64 Reserved : 5; /* bit position: 59 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 AsULONGLONG;
  }; /* size: 0x0008 */
} WHEA_PERSISTENCE_INFO, *PWHEA_PERSISTENCE_INFO; /* size: 0x0008 */

enum COMPARTMENT_ID
{
  UNSPECIFIED_COMPARTMENT_ID = 0,
  DEFAULT_COMPARTMENT_ID = 1,
};

typedef struct _PORT_MESSAGE
{
  union
  {
    union
    {
      struct
      {
        /* 0x0000 */ short DataLength;
        /* 0x0002 */ short TotalLength;
      } /* size: 0x0004 */ s1;
      /* 0x0000 */ unsigned long Length;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ short Type;
        /* 0x0006 */ short DataInfoOffset;
      } /* size: 0x0004 */ s2;
      /* 0x0004 */ unsigned long ZeroInit;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u2;
  union
  {
    /* 0x0008 */ struct _CLIENT_ID ClientId;
    /* 0x0008 */ double DoNotUseThisField;
  }; /* size: 0x0010 */
  /* 0x0018 */ unsigned long MessageId;
  /* 0x001c */ long Padding_41;
  union
  {
    /* 0x0020 */ unsigned __int64 ClientViewSize;
    struct
    {
      /* 0x0020 */ unsigned long CallbackId;
      /* 0x0024 */ long __PADDING__[1];
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} PORT_MESSAGE, *PPORT_MESSAGE; /* size: 0x0028 */

typedef struct _LPC_CLIENT_DIED_MSG
{
  /* 0x0000 */ struct _PORT_MESSAGE PortMsg;
  /* 0x0028 */ union _LARGE_INTEGER CreateTime;
} LPC_CLIENT_DIED_MSG, *PLPC_CLIENT_DIED_MSG; /* size: 0x0030 */

typedef enum _ETW_BUFFER_STATE
{
  EtwBufferStateFree = 0,
  EtwBufferStateGeneralLogging = 1,
  EtwBufferStateCSwitch = 2,
  EtwBufferStateFlush = 3,
  EtwBufferStateMaximum = 4,
} ETW_BUFFER_STATE, *PETW_BUFFER_STATE;

typedef enum _RESOURCE_TRANSLATION_DIRECTION
{
  TranslateChildToParent = 0,
  TranslateParentToChild = 1,
} RESOURCE_TRANSLATION_DIRECTION, *PRESOURCE_TRANSLATION_DIRECTION;

typedef enum _ALPC_PORT_INFORMATION_CLASS
{
  AlpcBasicInformation = 0,
  AlpcPortInformation = 1,
  AlpcAssociateCompletionPortInformation = 2,
  AlpcConnectedSIDInformation = 3,
  AlpcServerInformation = 4,
  AlpcMessageZoneInformation = 5,
  AlpcRegisterCompletionListInformation = 6,
  AlpcUnregisterCompletionListInformation = 7,
  AlpcAdjustCompletionListConcurrencyCountInformation = 8,
  AlpcRegisterCallbackInformation = 9,
  AlpcCompletionListRundownInformation = 10,
} ALPC_PORT_INFORMATION_CLASS, *PALPC_PORT_INFORMATION_CLASS;

struct PPM_WMI_PERF_STATE
{
  /* 0x0000 */ unsigned long Frequency;
  /* 0x0004 */ unsigned long Power;
  /* 0x0008 */ unsigned char PercentFrequency;
  /* 0x0009 */ unsigned char IncreaseLevel;
  /* 0x000a */ unsigned char DecreaseLevel;
  /* 0x000b */ unsigned char Type;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0014 */ long Padding_42;
  /* 0x0018 */ unsigned __int64 Control;
  /* 0x0020 */ unsigned __int64 Status;
  /* 0x0028 */ unsigned long HitCount;
  /* 0x002c */ unsigned long Reserved1;
  /* 0x0030 */ unsigned __int64 Reserved2;
  /* 0x0038 */ unsigned __int64 Reserved3;
}; /* size: 0x0040 */

typedef enum _KTRANSACTION_OUTCOME
{
  KTxOutcomeUninitialized = 0,
  KTxOutcomeUndetermined = 1,
  KTxOutcomeCommitted = 2,
  KTxOutcomeAborted = 3,
  KTxOutcomeUnavailable = 4,
} KTRANSACTION_OUTCOME, *PKTRANSACTION_OUTCOME;

enum VF_DEVOBJ_TYPE
{
  VF_DEVOBJ_PDO = 0,
  VF_DEVOBJ_BUS_FILTER = 1,
  VF_DEVOBJ_LOWER_DEVICE_FILTER = 2,
  VF_DEVOBJ_LOWER_CLASS_FILTER = 3,
  VF_DEVOBJ_FDO = 4,
  VF_DEVOBJ_UPPER_DEVICE_FILTER = 5,
  VF_DEVOBJ_UPPER_CLASS_FILTER = 6,
};

typedef enum _SYSTEM_INFORMATION_CLASS
{
  SystemBasicInformation = 0,
  SystemProcessorInformation = 1,
  SystemPerformanceInformation = 2,
  SystemTimeOfDayInformation = 3,
  SystemPathInformation = 4,
  SystemProcessInformation = 5,
  SystemCallCountInformation = 6,
  SystemDeviceInformation = 7,
  SystemProcessorPerformanceInformation = 8,
  SystemFlagsInformation = 9,
  SystemCallTimeInformation = 10,
  SystemModuleInformation = 11,
  SystemLocksInformation = 12,
  SystemStackTraceInformation = 13,
  SystemPagedPoolInformation = 14,
  SystemNonPagedPoolInformation = 15,
  SystemHandleInformation = 16,
  SystemObjectInformation = 17,
  SystemPageFileInformation = 18,
  SystemVdmInstemulInformation = 19,
  SystemVdmBopInformation = 20,
  SystemFileCacheInformation = 21,
  SystemPoolTagInformation = 22,
  SystemInterruptInformation = 23,
  SystemDpcBehaviorInformation = 24,
  SystemFullMemoryInformation = 25,
  SystemLoadGdiDriverInformation = 26,
  SystemUnloadGdiDriverInformation = 27,
  SystemTimeAdjustmentInformation = 28,
  SystemSummaryMemoryInformation = 29,
  SystemMirrorMemoryInformation = 30,
  SystemPerformanceTraceInformation = 31,
  SystemObsolete0 = 32,
  SystemExceptionInformation = 33,
  SystemCrashDumpStateInformation = 34,
  SystemKernelDebuggerInformation = 35,
  SystemContextSwitchInformation = 36,
  SystemRegistryQuotaInformation = 37,
  SystemExtendServiceTableInformation = 38,
  SystemPrioritySeperation = 39,
  SystemVerifierAddDriverInformation = 40,
  SystemVerifierRemoveDriverInformation = 41,
  SystemProcessorIdleInformation = 42,
  SystemLegacyDriverInformation = 43,
  SystemCurrentTimeZoneInformation = 44,
  SystemLookasideInformation = 45,
  SystemTimeSlipNotification = 46,
  SystemSessionCreate = 47,
  SystemSessionDetach = 48,
  SystemSessionInformation = 49,
  SystemRangeStartInformation = 50,
  SystemVerifierInformation = 51,
  SystemVerifierThunkExtend = 52,
  SystemSessionProcessInformation = 53,
  SystemLoadGdiDriverInSystemSpace = 54,
  SystemNumaProcessorMap = 55,
  SystemPrefetcherInformation = 56,
  SystemExtendedProcessInformation = 57,
  SystemRecommendedSharedDataAlignment = 58,
  SystemComPlusPackage = 59,
  SystemNumaAvailableMemory = 60,
  SystemProcessorPowerInformation = 61,
  SystemEmulationBasicInformation = 62,
  SystemEmulationProcessorInformation = 63,
  SystemExtendedHandleInformation = 64,
  SystemLostDelayedWriteInformation = 65,
  SystemBigPoolInformation = 66,
  SystemSessionPoolTagInformation = 67,
  SystemSessionMappedViewInformation = 68,
  SystemHotpatchInformation = 69,
  SystemObjectSecurityMode = 70,
  SystemWatchdogTimerHandler = 71,
  SystemWatchdogTimerInformation = 72,
  SystemLogicalProcessorInformation = 73,
  SystemWow64SharedInformationObsolete = 74,
  SystemRegisterFirmwareTableInformationHandler = 75,
  SystemFirmwareTableInformation = 76,
  SystemModuleInformationEx = 77,
  SystemVerifierTriageInformation = 78,
  SystemSuperfetchInformation = 79,
  SystemMemoryListInformation = 80,
  SystemFileCacheInformationEx = 81,
  SystemThreadPriorityClientIdInformation = 82,
  SystemProcessorIdleCycleTimeInformation = 83,
  SystemVerifierCancellationInformation = 84,
  SystemProcessorPowerInformationEx = 85,
  SystemRefTraceInformation = 86,
  SystemSpecialPoolInformation = 87,
  SystemProcessIdInformation = 88,
  SystemErrorPortInformation = 89,
  SystemBootEnvironmentInformation = 90,
  SystemHypervisorInformation = 91,
  SystemVerifierInformationEx = 92,
  SystemTimeZoneInformation = 93,
  SystemImageFileExecutionOptionsInformation = 94,
  SystemCoverageInformation = 95,
  SystemPrefetchPatchInformation = 96,
  SystemVerifierFaultsInformation = 97,
  SystemSystemPartitionInformation = 98,
  SystemSystemDiskInformation = 99,
  SystemProcessorPerformanceDistribution = 100,
  SystemNumaProximityNodeInformation = 101,
  SystemDynamicTimeZoneInformation = 102,
  SystemCodeIntegrityInformation = 103,
  SystemProcessorMicrocodeUpdateInformation = 104,
  SystemProcessorBrandString = 105,
  SystemVirtualAddressInformation = 106,
  SystemLogicalProcessorAndGroupInformation = 107,
  SystemProcessorCycleTimeInformation = 108,
  SystemStoreInformation = 109,
  SystemRegistryAppendString = 110,
  SystemAitSamplingValue = 111,
  SystemVhdBootInformation = 112,
  SystemCpuQuotaInformation = 113,
  SystemSpare0 = 114,
  SystemSpare1 = 115,
  SystemLowPriorityIoInformation = 116,
  SystemTpmBootEntropyInformation = 117,
  SystemVerifierCountersInformation = 118,
  SystemPagedPoolInformationEx = 119,
  SystemSystemPtesInformationEx = 120,
  SystemNodeDistanceInformation = 121,
  SystemAcpiAuditInformation = 122,
  SystemBasicPerformanceInformation = 123,
  MaxSystemInfoClass = 124,
} SYSTEM_INFORMATION_CLASS, *PSYSTEM_INFORMATION_CLASS;

enum KCONTINUE_STATUS
{
  ContinueError = 0,
  ContinueSuccess = 1,
  ContinueProcessorReselected = 2,
  ContinueNextProcessor = 3,
};

typedef enum _KWAIT_STATE
{
  WaitInProgress = 0,
  WaitCommitted = 1,
  WaitAborted = 2,
  MaximumWaitState = 3,
} KWAIT_STATE, *PKWAIT_STATE;

typedef struct _BOOTDISK_INFORMATION_EX
{
  /* 0x0000 */ __int64 BootPartitionOffset;
  /* 0x0008 */ __int64 SystemPartitionOffset;
  /* 0x0010 */ unsigned long BootDeviceSignature;
  /* 0x0014 */ unsigned long SystemDeviceSignature;
  /* 0x0018 */ struct _GUID BootDeviceGuid;
  /* 0x0028 */ struct _GUID SystemDeviceGuid;
  /* 0x0038 */ unsigned char BootDeviceIsGpt;
  /* 0x0039 */ unsigned char SystemDeviceIsGpt;
  /* 0x003a */ char __PADDING__[6];
} BOOTDISK_INFORMATION_EX, *PBOOTDISK_INFORMATION_EX; /* size: 0x0040 */

typedef enum _MM_ROTATE_DIRECTION
{
  MmToFrameBuffer = 0,
  MmToFrameBufferNoCopy = 1,
  MmToRegularMemory = 2,
  MmToRegularMemoryNoCopy = 3,
  MmMaximumRotateDirection = 4,
} MM_ROTATE_DIRECTION, *PMM_ROTATE_DIRECTION;

typedef union _WHEA_MEMORY_ERROR_SECTION_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 ErrorStatus : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 PhysicalAddress : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 PhysicalAddressMask : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 Node : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 Card : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 Module : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned __int64 Bank : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned __int64 Device : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned __int64 Row : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 Column : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned __int64 BitPosition : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned __int64 RequesterId : 1; /* bit position: 11 */
      /* 0x0000 */ unsigned __int64 ResponderId : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned __int64 TargetId : 1; /* bit position: 13 */
      /* 0x0000 */ unsigned __int64 ErrorType : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned __int64 Reserved : 49; /* bit position: 15 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 ValidBits;
  }; /* size: 0x0008 */
} WHEA_MEMORY_ERROR_SECTION_VALIDBITS, *PWHEA_MEMORY_ERROR_SECTION_VALIDBITS; /* size: 0x0008 */

typedef enum _SECURITY_OPERATION_CODE
{
  SetSecurityDescriptor = 0,
  QuerySecurityDescriptor = 1,
  DeleteSecurityDescriptor = 2,
  AssignSecurityDescriptor = 3,
} SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _CLS_CONTEXT_MODE
{
  ClsContextNone = 0,
  ClsContextUndoNext = 1,
  ClsContextPrevious = 2,
  ClsContextForward = 3,
} CLS_CONTEXT_MODE, *PCLS_CONTEXT_MODE;

struct INSTID
{
  /* 0x0000 */ struct _GUID Guid;
  /* 0x0010 */ unsigned long BaseId;
}; /* size: 0x0014 */

struct tagINSTIDCHUNK
{
  /* 0x0000 */ struct tagINSTIDCHUNK* Next;
  /* 0x0008 */ struct INSTID InstId[8];
}; /* size: 0x00a8 */

enum PCI_EXPRESS_ASPM_SUPPORT
{
  L0sEntrySupport = 1,
  L0sAndL1EntrySupport = 3,
};

typedef enum _KENLISTMENT_STATE
{
  KEnlistmentUninitialized = 0,
  KEnlistmentActive = 256,
  KEnlistmentPreparing = 257,
  KEnlistmentPrepared = 258,
  KEnlistmentInDoubt = 259,
  KEnlistmentCommitted = 260,
  KEnlistmentCommittedNotify = 261,
  KEnlistmentCommitRequested = 262,
  KEnlistmentAborted = 263,
  KEnlistmentDelegated = 264,
  KEnlistmentDelegatedDisconnected = 265,
  KEnlistmentPrePreparing = 266,
  KEnlistmentForgotten = 267,
  KEnlistmentRecovering = 268,
  KEnlistmentAborting = 269,
  KEnlistmentReadOnly = 270,
  KEnlistmentOutcomeUnavailable = 271,
  KEnlistmentOffline = 272,
  KEnlistmentPrePrepared = 273,
  KEnlistmentInitialized = 274,
} KENLISTMENT_STATE, *PKENLISTMENT_STATE;

typedef struct _KENLISTMENT_HISTORY
{
  /* 0x0000 */ unsigned long Notification;
  /* 0x0004 */ enum _KENLISTMENT_STATE NewState;
} KENLISTMENT_HISTORY, *PKENLISTMENT_HISTORY; /* size: 0x0008 */

typedef enum _ETW_NOTIFICATION_TYPE
{
  EtwNotificationTypeNoReply = 1,
  EtwNotificationTypeLegacyEnable = 2,
  EtwNotificationTypeEnable = 3,
  EtwNotificationTypePrivateLogger = 4,
  EtwNotificationTypePerflib = 5,
  EtwNotificationTypeAudio = 6,
  EtwNotificationTypeSession = 7,
  EtwNotificationTypeReserved = 8,
  EtwNotificationTypeCredentialUI = 9,
  EtwNotificationTypeMax = 10,
} ETW_NOTIFICATION_TYPE, *PETW_NOTIFICATION_TYPE;

typedef enum _KERNEL_STACK_LIMITS
{
  BugcheckStackLimits = 0,
  DPCStackLimits = 1,
  ExpandedStackLimits = 2,
  NormalStackLimits = 3,
  Win32kStackLimits = 4,
  SwapBusyStackLimits = 5,
  MaximumStackLimits = 6,
} KERNEL_STACK_LIMITS, *PKERNEL_STACK_LIMITS;

typedef struct _KTRANSACTION_HISTORY
{
  /* 0x0000 */ enum _TAG_UNNAMED_3 RecordType;
  /* 0x0004 */ unsigned long Payload;
} KTRANSACTION_HISTORY, *PKTRANSACTION_HISTORY; /* size: 0x0008 */

typedef struct _OBJECT_TYPE_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING TypeName;
  /* 0x0010 */ unsigned long TotalNumberOfObjects;
  /* 0x0014 */ unsigned long TotalNumberOfHandles;
  /* 0x0018 */ unsigned long TotalPagedPoolUsage;
  /* 0x001c */ unsigned long TotalNonPagedPoolUsage;
  /* 0x0020 */ unsigned long TotalNamePoolUsage;
  /* 0x0024 */ unsigned long TotalHandleTableUsage;
  /* 0x0028 */ unsigned long HighWaterNumberOfObjects;
  /* 0x002c */ unsigned long HighWaterNumberOfHandles;
  /* 0x0030 */ unsigned long HighWaterPagedPoolUsage;
  /* 0x0034 */ unsigned long HighWaterNonPagedPoolUsage;
  /* 0x0038 */ unsigned long HighWaterNamePoolUsage;
  /* 0x003c */ unsigned long HighWaterHandleTableUsage;
  /* 0x0040 */ unsigned long InvalidAttributes;
  /* 0x0044 */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x0054 */ unsigned long ValidAccessMask;
  /* 0x0058 */ unsigned char SecurityRequired;
  /* 0x0059 */ unsigned char MaintainHandleCount;
  /* 0x005a */ char Padding_43[2];
  /* 0x005c */ unsigned long PoolType;
  /* 0x0060 */ unsigned long DefaultPagedPoolCharge;
  /* 0x0064 */ unsigned long DefaultNonPagedPoolCharge;
} OBJECT_TYPE_INFORMATION, *POBJECT_TYPE_INFORMATION; /* size: 0x0068 */

typedef struct _HEAP_EVENT_SUBSEGMENT_ALLOC_FREE
{
  /* 0x0000 */ void* HeapHandle;
  /* 0x0008 */ void* SubSegment;
  /* 0x0010 */ unsigned __int64 SubSegmentSize;
  /* 0x0018 */ unsigned __int64 BlockSize;
} HEAP_EVENT_SUBSEGMENT_ALLOC_FREE, *PHEAP_EVENT_SUBSEGMENT_ALLOC_FREE; /* size: 0x0020 */

typedef struct _HEAP_SUBSEGMENT_ALLOC
{
  /* 0x0000 */ struct _SYSTEM_TRACE_HEADER Header;
  /* 0x0020 */ struct _HEAP_EVENT_SUBSEGMENT_ALLOC_FREE Event;
} HEAP_SUBSEGMENT_ALLOC, *PHEAP_SUBSEGMENT_ALLOC; /* size: 0x0040 */

typedef enum _TOKEN_TYPE
{
  TokenPrimary = 1,
  TokenImpersonation = 2,
} TOKEN_TYPE, *PTOKEN_TYPE;

typedef struct _HAL_ACPI_AUDIT_INFORMATION
{
  /* 0x0000 */ unsigned long RsdpCount;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long SameRsdt : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned long SlicPresent : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned long SlicDifferent : 1; /* bit position: 2 */
  }; /* bitfield */
} HAL_ACPI_AUDIT_INFORMATION, *PHAL_ACPI_AUDIT_INFORMATION; /* size: 0x0008 */

enum VF_FAILURE_CLASS
{
  VFFAILURE_FAIL_IN_FIELD = 0,
  VFFAILURE_FAIL_LOGO = 1,
  VFFAILURE_FAIL_UNDER_DEBUGGER = 2,
};

typedef enum _FS_FILTER_SECTION_SYNC_TYPE
{
  SyncTypeOther = 0,
  SyncTypeCreateSection = 1,
} FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _RTL_UMS_THREAD_INFO_CLASS
{
  UmsThreadInvalidInfoClass = 0,
  UmsThreadUserContext = 1,
  UmsThreadPriority = 2,
  UmsThreadAffinity = 3,
  UmsThreadTeb = 4,
  UmsThreadIsSuspended = 5,
  UmsThreadIsTerminated = 6,
  UmsThreadMaxInfoClass = 7,
} RTL_UMS_THREAD_INFO_CLASS, *PRTL_UMS_THREAD_INFO_CLASS;

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef struct _GDI_TEB_BATCH
{
  /* 0x0000 */ unsigned long Offset;
  /* 0x0004 */ long Padding_44;
  /* 0x0008 */ unsigned __int64 HDC;
  /* 0x0010 */ unsigned long Buffer[310];
} GDI_TEB_BATCH, *PGDI_TEB_BATCH; /* size: 0x04e8 */

typedef enum _FIRMWARE_REENTRY
{
  HalHaltRoutine = 0,
  HalPowerDownRoutine = 1,
  HalRestartRoutine = 2,
  HalRebootRoutine = 3,
  HalInteractiveModeRoutine = 4,
  HalMaximumRoutine = 5,
} FIRMWARE_REENTRY, *PFIRMWARE_REENTRY;

typedef struct _SE_AUDIT_PROCESS_CREATION_INFO
{
  /* 0x0000 */ struct _OBJECT_NAME_INFORMATION* ImageFileName;
} SE_AUDIT_PROCESS_CREATION_INFO, *PSE_AUDIT_PROCESS_CREATION_INFO; /* size: 0x0008 */

typedef struct _MMPTE_FLUSH_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long MaximumCount;
  /* 0x0008 */ void* FlushVa[20];
} MMPTE_FLUSH_LIST, *PMMPTE_FLUSH_LIST; /* size: 0x00a8 */

typedef struct _KLOCK_QUEUE_HANDLE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE LockQueue;
  /* 0x0010 */ unsigned char OldIrql;
  /* 0x0011 */ char __PADDING__[7];
} KLOCK_QUEUE_HANDLE, *PKLOCK_QUEUE_HANDLE; /* size: 0x0018 */

typedef enum _POLICY_LSA_SERVER_ROLE
{
  PolicyServerRoleBackup = 2,
  PolicyServerRolePrimary = 3,
} POLICY_LSA_SERVER_ROLE, *PPOLICY_LSA_SERVER_ROLE;

typedef enum _SYSTEM_CRASH_DUMP_CONFIGURATION_CLASS
{
  SystemCrashDumpDisable = 0,
  SystemCrashDumpReconfigure = 1,
  SystemCrashDumpInitializationComplete = 2,
} SYSTEM_CRASH_DUMP_CONFIGURATION_CLASS, *PSYSTEM_CRASH_DUMP_CONFIGURATION_CLASS;

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsMaximumInformation = 11,
} FSINFOCLASS, *PFSINFOCLASS;

typedef struct _SYSTEM_POWER_STATE_CONTEXT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Reserved1 : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned long TargetSystemState : 4; /* bit position: 8 */
      /* 0x0000 */ unsigned long EffectiveSystemState : 4; /* bit position: 12 */
      /* 0x0000 */ unsigned long CurrentSystemState : 4; /* bit position: 16 */
      /* 0x0000 */ unsigned long IgnoreHibernationPath : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long PseudoTransition : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long Reserved2 : 10; /* bit position: 22 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long ContextAsUlong;
  }; /* size: 0x0004 */
} SYSTEM_POWER_STATE_CONTEXT, *PSYSTEM_POWER_STATE_CONTEXT; /* size: 0x0004 */

typedef enum _POWER_STATE_TYPE
{
  SystemPowerState = 0,
  DevicePowerState = 1,
} POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef union _POWER_STATE
{
  union
  {
    /* 0x0000 */ enum _SYSTEM_POWER_STATE SystemState;
    /* 0x0000 */ enum _DEVICE_POWER_STATE DeviceState;
  }; /* size: 0x0004 */
} POWER_STATE, *PPOWER_STATE; /* size: 0x0004 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

typedef struct _IO_STACK_LOCATION
{
  /* 0x0000 */ unsigned char MajorFunction;
  /* 0x0001 */ unsigned char MinorFunction;
  /* 0x0002 */ unsigned char Flags;
  /* 0x0003 */ unsigned char Control;
  /* 0x0004 */ long Padding_45;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0010 */ unsigned long Options;
        /* 0x000c */ long Padding_46;
        /* 0x0018 */ unsigned short FileAttributes;
        /* 0x001a */ unsigned short ShareAccess;
        /* 0x0014 */ long Padding_47;
        /* 0x0020 */ unsigned long EaLength;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ Create;
      struct
      {
        /* 0x0008 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0010 */ unsigned long Options;
        /* 0x000c */ long Padding_48;
        /* 0x0018 */ unsigned short Reserved;
        /* 0x001a */ unsigned short ShareAccess;
        /* 0x0014 */ long Padding_49;
        /* 0x0020 */ struct _NAMED_PIPE_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0020 */ CreatePipe;
      struct
      {
        /* 0x0008 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0010 */ unsigned long Options;
        /* 0x000c */ long Padding_50;
        /* 0x0018 */ unsigned short Reserved;
        /* 0x001a */ unsigned short ShareAccess;
        /* 0x0014 */ long Padding_51;
        /* 0x0020 */ struct _MAILSLOT_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0020 */ CreateMailslot;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_52;
        /* 0x0010 */ unsigned long Key;
        /* 0x000c */ long Padding_53;
        /* 0x0018 */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0018 */ Read;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_54;
        /* 0x0010 */ unsigned long Key;
        /* 0x000c */ long Padding_55;
        /* 0x0018 */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0018 */ Write;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_56;
        /* 0x0010 */ struct _UNICODE_STRING* FileName;
        /* 0x0018 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0014 */ long Padding_57;
        /* 0x0020 */ unsigned long FileIndex;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ QueryDirectory;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_58;
        /* 0x0010 */ unsigned long CompletionFilter;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ NotifyDirectory;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_59;
        /* 0x0010 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QueryFile;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_60;
        /* 0x0010 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x000c */ long Padding_61;
        /* 0x0018 */ struct _FILE_OBJECT* FileObject;
        union
        {
          struct
          {
            /* 0x0020 */ unsigned char ReplaceIfExists;
            /* 0x0021 */ unsigned char AdvanceOnly;
          }; /* size: 0x0002 */
          /* 0x0020 */ unsigned long ClusterCount;
          /* 0x0020 */ void* DeleteHandle;
        }; /* size: 0x0008 */
      } /* size: 0x0020 */ SetFile;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_62;
        /* 0x0010 */ void* EaList;
        /* 0x0018 */ unsigned long EaListLength;
        /* 0x0014 */ long Padding_63;
        /* 0x0020 */ unsigned long EaIndex;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ QueryEa;
      struct
      {
        /* 0x0008 */ unsigned long Length;
      } /* size: 0x0004 */ SetEa;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_64;
        /* 0x0010 */ enum _FSINFOCLASS FsInformationClass;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QueryVolume;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_65;
        /* 0x0010 */ enum _FSINFOCLASS FsInformationClass;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ SetVolume;
      struct
      {
        /* 0x0008 */ unsigned long OutputBufferLength;
        /* 0x0004 */ long Padding_66;
        /* 0x0010 */ unsigned long InputBufferLength;
        /* 0x000c */ long Padding_67;
        /* 0x0018 */ unsigned long FsControlCode;
        /* 0x0014 */ long Padding_68;
        /* 0x0020 */ void* Type3InputBuffer;
      } /* size: 0x0020 */ FileSystemControl;
      struct
      {
        /* 0x0008 */ union _LARGE_INTEGER* Length;
        /* 0x0010 */ unsigned long Key;
        /* 0x000c */ long Padding_69;
        /* 0x0018 */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0018 */ LockControl;
      struct
      {
        /* 0x0008 */ unsigned long OutputBufferLength;
        /* 0x0004 */ long Padding_70;
        /* 0x0010 */ unsigned long InputBufferLength;
        /* 0x000c */ long Padding_71;
        /* 0x0018 */ unsigned long IoControlCode;
        /* 0x0014 */ long Padding_72;
        /* 0x0020 */ void* Type3InputBuffer;
      } /* size: 0x0020 */ DeviceIoControl;
      struct
      {
        /* 0x0008 */ unsigned long SecurityInformation;
        /* 0x0004 */ long Padding_73;
        /* 0x0010 */ unsigned long Length;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QuerySecurity;
      struct
      {
        /* 0x0008 */ unsigned long SecurityInformation;
        /* 0x0004 */ long Padding_74;
        /* 0x0010 */ void* SecurityDescriptor;
      } /* size: 0x0010 */ SetSecurity;
      struct
      {
        /* 0x0008 */ struct _VPB* Vpb;
        /* 0x0010 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0010 */ MountVolume;
      struct
      {
        /* 0x0008 */ struct _VPB* Vpb;
        /* 0x0010 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0010 */ VerifyVolume;
      struct
      {
        /* 0x0008 */ struct _SCSI_REQUEST_BLOCK* Srb;
      } /* size: 0x0008 */ Scsi;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0004 */ long Padding_75;
        /* 0x0010 */ void* StartSid;
        /* 0x0018 */ struct _FILE_GET_QUOTA_INFORMATION* SidList;
        /* 0x0020 */ unsigned long SidListLength;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ QueryQuota;
      struct
      {
        /* 0x0008 */ unsigned long Length;
      } /* size: 0x0004 */ SetQuota;
      struct
      {
        /* 0x0008 */ enum _DEVICE_RELATION_TYPE Type;
      } /* size: 0x0004 */ QueryDeviceRelations;
      struct
      {
        /* 0x0008 */ const struct _GUID* InterfaceType;
        /* 0x0010 */ unsigned short Size;
        /* 0x0012 */ unsigned short Version;
        /* 0x000c */ long Padding_76;
        /* 0x0018 */ struct _INTERFACE* Interface;
        /* 0x0020 */ void* InterfaceSpecificData;
      } /* size: 0x0020 */ QueryInterface;
      struct
      {
        /* 0x0008 */ struct _DEVICE_CAPABILITIES* Capabilities;
      } /* size: 0x0008 */ DeviceCapabilities;
      struct
      {
        /* 0x0008 */ struct _IO_RESOURCE_REQUIREMENTS_LIST* IoResourceRequirementList;
      } /* size: 0x0008 */ FilterResourceRequirements;
      struct
      {
        /* 0x0008 */ unsigned long WhichSpace;
        /* 0x0004 */ long Padding_77;
        /* 0x0010 */ void* Buffer;
        /* 0x0018 */ unsigned long Offset;
        /* 0x0014 */ long Padding_78;
        /* 0x0020 */ unsigned long Length;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ ReadWriteConfig;
      struct
      {
        /* 0x0008 */ unsigned char Lock;
      } /* size: 0x0001 */ SetLock;
      struct
      {
        /* 0x0008 */ enum BUS_QUERY_ID_TYPE IdType;
      } /* size: 0x0004 */ QueryId;
      struct
      {
        /* 0x0008 */ enum DEVICE_TEXT_TYPE DeviceTextType;
        /* 0x0004 */ long Padding_79;
        /* 0x0010 */ unsigned long LocaleId;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QueryDeviceText;
      struct
      {
        /* 0x0008 */ unsigned char InPath;
        /* 0x0009 */ unsigned char Reserved[3];
        /* 0x0004 */ long Padding_80;
        /* 0x0010 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE Type;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ UsageNotification;
      struct
      {
        /* 0x0008 */ enum _SYSTEM_POWER_STATE PowerState;
      } /* size: 0x0004 */ WaitWake;
      struct
      {
        /* 0x0008 */ struct _POWER_SEQUENCE* PowerSequence;
      } /* size: 0x0008 */ PowerSequence;
      struct
      {
        union
        {
          /* 0x0008 */ unsigned long SystemContext;
          /* 0x0008 */ struct _SYSTEM_POWER_STATE_CONTEXT SystemPowerStateContext;
        }; /* size: 0x0004 */
        /* 0x0004 */ long Padding_81;
        /* 0x0010 */ enum _POWER_STATE_TYPE Type;
        /* 0x000c */ long Padding_82;
        /* 0x0018 */ union _POWER_STATE State;
        /* 0x0014 */ long Padding_83;
        /* 0x0020 */ enum POWER_ACTION ShutdownType;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ Power;
      struct
      {
        /* 0x0008 */ struct _CM_RESOURCE_LIST* AllocatedResources;
        /* 0x0010 */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
      } /* size: 0x0010 */ StartDevice;
      struct
      {
        /* 0x0008 */ unsigned __int64 ProviderId;
        /* 0x0010 */ void* DataPath;
        /* 0x0018 */ unsigned long BufferSize;
        /* 0x0014 */ long Padding_84;
        /* 0x0020 */ void* Buffer;
      } /* size: 0x0020 */ WMI;
      struct
      {
        /* 0x0008 */ void* Argument1;
        /* 0x0010 */ void* Argument2;
        /* 0x0018 */ void* Argument3;
        /* 0x0020 */ void* Argument4;
      } /* size: 0x0020 */ Others;
    }; /* size: 0x0020 */
  } /* size: 0x0020 */ Parameters;
  /* 0x0028 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0030 */ struct _FILE_OBJECT* FileObject;
  /* 0x0038 */ void* CompletionRoutine /* function */;
  /* 0x0040 */ void* Context;
} IO_STACK_LOCATION, *PIO_STACK_LOCATION; /* size: 0x0048 */

typedef struct _IRP_MINI_SNAPSHOT
{
  /* 0x0000 */ struct _IRP* Irp;
  /* 0x0008 */ struct _IO_STACK_LOCATION IoStackLocation;
} IRP_MINI_SNAPSHOT, *PIRP_MINI_SNAPSHOT; /* size: 0x0050 */

typedef struct _IOFCALLDRIVER_STACKDATA
{
  /* 0x0000 */ struct _IOV_SESSION_DATA* IovSessionData;
  /* 0x0008 */ struct _IOV_STACK_LOCATION* IovStackLocation;
  /* 0x0010 */ struct _IOV_REQUEST_PACKET* IovPacket;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ long Padding_85;
  /* 0x0020 */ struct _LIST_ENTRY SharedLocationList;
  /* 0x0030 */ void* DispatchRoutine /* function */;
  /* 0x0038 */ long ExpectedStatus;
  /* 0x003c */ long NewStatus;
  /* 0x0040 */ struct _DEVICE_OBJECT* RemovePdo;
  /* 0x0048 */ struct _IRP_MINI_SNAPSHOT IrpSnapshot;
  /* 0x0098 */ unsigned long Flags2;
  /* 0x009c */ unsigned char OriginalIrql;
  /* 0x009d */ unsigned char BugcheckIrql;
  /* 0x009e */ char Padding_86[2];
  /* 0x00a0 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x00a8 */ struct _IRP* Irp;
  /* 0x00b0 */ void* ReturnAddress;
  /* 0x00b8 */ long CallDriverStatus;
  union
  {
    struct
    {
      /* 0x00bc */ short KernelApcDisable;
      /* 0x00be */ short SpecialApcDisable;
    }; /* size: 0x0004 */
    /* 0x00bc */ unsigned long CombinedApcDisable;
  }; /* size: 0x0004 */
} IOFCALLDRIVER_STACKDATA, *PIOFCALLDRIVER_STACKDATA; /* size: 0x00c0 */

enum PCI_BUS_WIDTH
{
  BusWidth32Bits = 0,
  BusWidth64Bits = 1,
};

typedef struct _PO_HIBER_PERF
{
  /* 0x0000 */ unsigned __int64 IoTicks;
  /* 0x0008 */ unsigned __int64 InitTicks;
  /* 0x0010 */ unsigned __int64 CopyTicks;
  /* 0x0018 */ unsigned __int64 ElapsedTicks;
  /* 0x0020 */ unsigned __int64 CompressTicks;
  /* 0x0028 */ unsigned __int64 ResumeAppTime;
  /* 0x0030 */ unsigned __int64 HiberFileResumeTime;
  /* 0x0038 */ unsigned __int64 BytesCopied;
  /* 0x0040 */ unsigned __int64 PagesProcessed;
  /* 0x0048 */ unsigned long PagesWritten;
  /* 0x004c */ unsigned long DumpCount;
  /* 0x0050 */ unsigned long FileRuns;
  /* 0x0054 */ long __PADDING__[1];
} PO_HIBER_PERF, *PPO_HIBER_PERF; /* size: 0x0058 */

struct PO_MEMORY_IMAGE
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long ImageType;
  /* 0x0008 */ unsigned long CheckSum;
  /* 0x000c */ unsigned long LengthSelf;
  /* 0x0010 */ unsigned __int64 PageSelf;
  /* 0x0018 */ unsigned long PageSize;
  /* 0x001c */ long Padding_87;
  /* 0x0020 */ union _LARGE_INTEGER SystemTime;
  /* 0x0028 */ unsigned __int64 InterruptTime;
  /* 0x0030 */ unsigned long FeatureFlags;
  /* 0x0034 */ unsigned char HiberFlags;
  /* 0x0035 */ unsigned char spare[3];
  /* 0x0038 */ unsigned long NoHiberPtes;
  /* 0x003c */ long Padding_88;
  /* 0x0040 */ unsigned __int64 HiberVa;
  /* 0x0048 */ union _LARGE_INTEGER HiberPte;
  /* 0x0050 */ unsigned long NoFreePages;
  /* 0x0054 */ unsigned long FreeMapCheck;
  /* 0x0058 */ unsigned long WakeCheck;
  /* 0x005c */ long Padding_89;
  /* 0x0060 */ unsigned __int64 FirstTablePage;
  /* 0x0068 */ struct _PO_HIBER_PERF PerfInfo;
  /* 0x00c0 */ unsigned long FirmwareRuntimeInformationPages;
  /* 0x00c4 */ long Padding_90;
  /* 0x00c8 */ unsigned __int64 FirmwareRuntimeInformation[1];
  /* 0x00d0 */ unsigned long NoBootLoaderLogPages;
  /* 0x00d4 */ long Padding_91;
  /* 0x00d8 */ unsigned __int64 BootLoaderLogPages[8];
  /* 0x0118 */ unsigned long NotUsed;
  /* 0x011c */ unsigned long ResumeContextCheck;
  /* 0x0120 */ unsigned long ResumeContextPages;
  /* 0x0124 */ long __PADDING__[1];
}; /* size: 0x0128 */

typedef enum _WATCHDOG_HANDLER_ACTION
{
  WdActionSetTimeoutValue = 0,
  WdActionQueryTimeoutValue = 1,
  WdActionResetTimer = 2,
  WdActionStopTimer = 3,
  WdActionStartTimer = 4,
  WdActionSetTriggerAction = 5,
  WdActionQueryTriggerAction = 6,
  WdActionQueryState = 7,
  WdActionSleep = 8,
  WdActionWake = 9,
} WATCHDOG_HANDLER_ACTION, *PWATCHDOG_HANDLER_ACTION;

typedef enum _SHUTDOWN_ACTION
{
  ShutdownNoReboot = 0,
  ShutdownReboot = 1,
  ShutdownPowerOff = 2,
} SHUTDOWN_ACTION, *PSHUTDOWN_ACTION;

typedef struct _IMAGE_RESOURCE_DATA_ENTRY
{
  /* 0x0000 */ unsigned long OffsetToData;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ unsigned long CodePage;
  /* 0x000c */ unsigned long Reserved;
} IMAGE_RESOURCE_DATA_ENTRY, *PIMAGE_RESOURCE_DATA_ENTRY; /* size: 0x0010 */

typedef enum _DPFLTR_TYPE
{
  DPFLTR_SYSTEM_ID = 0,
  DPFLTR_SMSS_ID = 1,
  DPFLTR_SETUP_ID = 2,
  DPFLTR_NTFS_ID = 3,
  DPFLTR_FSTUB_ID = 4,
  DPFLTR_CRASHDUMP_ID = 5,
  DPFLTR_CDAUDIO_ID = 6,
  DPFLTR_CDROM_ID = 7,
  DPFLTR_CLASSPNP_ID = 8,
  DPFLTR_DISK_ID = 9,
  DPFLTR_REDBOOK_ID = 10,
  DPFLTR_STORPROP_ID = 11,
  DPFLTR_SCSIPORT_ID = 12,
  DPFLTR_SCSIMINIPORT_ID = 13,
  DPFLTR_CONFIG_ID = 14,
  DPFLTR_I8042PRT_ID = 15,
  DPFLTR_SERMOUSE_ID = 16,
  DPFLTR_LSERMOUS_ID = 17,
  DPFLTR_KBDHID_ID = 18,
  DPFLTR_MOUHID_ID = 19,
  DPFLTR_KBDCLASS_ID = 20,
  DPFLTR_MOUCLASS_ID = 21,
  DPFLTR_TWOTRACK_ID = 22,
  DPFLTR_WMILIB_ID = 23,
  DPFLTR_ACPI_ID = 24,
  DPFLTR_AMLI_ID = 25,
  DPFLTR_HALIA64_ID = 26,
  DPFLTR_VIDEO_ID = 27,
  DPFLTR_SVCHOST_ID = 28,
  DPFLTR_VIDEOPRT_ID = 29,
  DPFLTR_TCPIP_ID = 30,
  DPFLTR_DMSYNTH_ID = 31,
  DPFLTR_NTOSPNP_ID = 32,
  DPFLTR_FASTFAT_ID = 33,
  DPFLTR_SAMSS_ID = 34,
  DPFLTR_PNPMGR_ID = 35,
  DPFLTR_NETAPI_ID = 36,
  DPFLTR_SCSERVER_ID = 37,
  DPFLTR_SCCLIENT_ID = 38,
  DPFLTR_SERIAL_ID = 39,
  DPFLTR_SERENUM_ID = 40,
  DPFLTR_UHCD_ID = 41,
  DPFLTR_RPCPROXY_ID = 42,
  DPFLTR_AUTOCHK_ID = 43,
  DPFLTR_DCOMSS_ID = 44,
  DPFLTR_UNIMODEM_ID = 45,
  DPFLTR_SIS_ID = 46,
  DPFLTR_FLTMGR_ID = 47,
  DPFLTR_WMICORE_ID = 48,
  DPFLTR_BURNENG_ID = 49,
  DPFLTR_IMAPI_ID = 50,
  DPFLTR_SXS_ID = 51,
  DPFLTR_FUSION_ID = 52,
  DPFLTR_IDLETASK_ID = 53,
  DPFLTR_SOFTPCI_ID = 54,
  DPFLTR_TAPE_ID = 55,
  DPFLTR_MCHGR_ID = 56,
  DPFLTR_IDEP_ID = 57,
  DPFLTR_PCIIDE_ID = 58,
  DPFLTR_FLOPPY_ID = 59,
  DPFLTR_FDC_ID = 60,
  DPFLTR_TERMSRV_ID = 61,
  DPFLTR_W32TIME_ID = 62,
  DPFLTR_PREFETCHER_ID = 63,
  DPFLTR_RSFILTER_ID = 64,
  DPFLTR_FCPORT_ID = 65,
  DPFLTR_PCI_ID = 66,
  DPFLTR_DMIO_ID = 67,
  DPFLTR_DMCONFIG_ID = 68,
  DPFLTR_DMADMIN_ID = 69,
  DPFLTR_WSOCKTRANSPORT_ID = 70,
  DPFLTR_VSS_ID = 71,
  DPFLTR_PNPMEM_ID = 72,
  DPFLTR_PROCESSOR_ID = 73,
  DPFLTR_DMSERVER_ID = 74,
  DPFLTR_SR_ID = 75,
  DPFLTR_INFINIBAND_ID = 76,
  DPFLTR_IHVDRIVER_ID = 77,
  DPFLTR_IHVVIDEO_ID = 78,
  DPFLTR_IHVAUDIO_ID = 79,
  DPFLTR_IHVNETWORK_ID = 80,
  DPFLTR_IHVSTREAMING_ID = 81,
  DPFLTR_IHVBUS_ID = 82,
  DPFLTR_HPS_ID = 83,
  DPFLTR_RTLTHREADPOOL_ID = 84,
  DPFLTR_LDR_ID = 85,
  DPFLTR_TCPIP6_ID = 86,
  DPFLTR_ISAPNP_ID = 87,
  DPFLTR_SHPC_ID = 88,
  DPFLTR_STORPORT_ID = 89,
  DPFLTR_STORMINIPORT_ID = 90,
  DPFLTR_PRINTSPOOLER_ID = 91,
  DPFLTR_VSSDYNDISK_ID = 92,
  DPFLTR_VERIFIER_ID = 93,
  DPFLTR_VDS_ID = 94,
  DPFLTR_VDSBAS_ID = 95,
  DPFLTR_VDSDYN_ID = 96,
  DPFLTR_VDSDYNDR_ID = 97,
  DPFLTR_VDSLDR_ID = 98,
  DPFLTR_VDSUTIL_ID = 99,
  DPFLTR_DFRGIFC_ID = 100,
  DPFLTR_DEFAULT_ID = 101,
  DPFLTR_MM_ID = 102,
  DPFLTR_DFSC_ID = 103,
  DPFLTR_WOW64_ID = 104,
  DPFLTR_ALPC_ID = 105,
  DPFLTR_WDI_ID = 106,
  DPFLTR_PERFLIB_ID = 107,
  DPFLTR_KTM_ID = 108,
  DPFLTR_IOSTRESS_ID = 109,
  DPFLTR_HEAP_ID = 110,
  DPFLTR_WHEA_ID = 111,
  DPFLTR_USERGDI_ID = 112,
  DPFLTR_MMCSS_ID = 113,
  DPFLTR_TPM_ID = 114,
  DPFLTR_THREADORDER_ID = 115,
  DPFLTR_ENVIRON_ID = 116,
  DPFLTR_EMS_ID = 117,
  DPFLTR_WDT_ID = 118,
  DPFLTR_FVEVOL_ID = 119,
  DPFLTR_NDIS_ID = 120,
  DPFLTR_NVCTRACE_ID = 121,
  DPFLTR_LUAFV_ID = 122,
  DPFLTR_APPCOMPAT_ID = 123,
  DPFLTR_USBSTOR_ID = 124,
  DPFLTR_SBP2PORT_ID = 125,
  DPFLTR_COVERAGE_ID = 126,
  DPFLTR_CACHEMGR_ID = 127,
  DPFLTR_MOUNTMGR_ID = 128,
  DPFLTR_CFR_ID = 129,
  DPFLTR_TXF_ID = 130,
  DPFLTR_KSECDD_ID = 131,
  DPFLTR_FLTREGRESS_ID = 132,
  DPFLTR_MPIO_ID = 133,
  DPFLTR_MSDSM_ID = 134,
  DPFLTR_UDFS_ID = 135,
  DPFLTR_PSHED_ID = 136,
  DPFLTR_STORVSP_ID = 137,
  DPFLTR_LSASS_ID = 138,
  DPFLTR_SSPICLI_ID = 139,
  DPFLTR_CNG_ID = 140,
  DPFLTR_EXFAT_ID = 141,
  DPFLTR_FILETRACE_ID = 142,
  DPFLTR_XSAVE_ID = 143,
  DPFLTR_SE_ID = 144,
  DPFLTR_DRIVEEXTENDER_ID = 145,
  DPFLTR_ENDOFTABLE_ID = 146,
} DPFLTR_TYPE, *PDPFLTR_TYPE;

typedef enum _HV_STATS_OBJECT_TYPE
{
  HvStatsObjectLogicalProcessor = 2,
} HV_STATS_OBJECT_TYPE, *PHV_STATS_OBJECT_TYPE;

typedef enum _SE_AUDIT_OPERATION
{
  AuditPrivilegeObject = 0,
  AuditPrivilegeService = 1,
  AuditAccessCheck = 2,
  AuditOpenObject = 3,
  AuditOpenObjectWithTransaction = 4,
  AuditCloseObject = 5,
  AuditDeleteObject = 6,
  AuditOpenObjectForDelete = 7,
  AuditOpenObjectForDeleteWithTransaction = 8,
  AuditCloseNonObject = 9,
  AuditOpenNonObject = 10,
  AuditObjectReference = 11,
  AuditHandleCreation = 12,
} SE_AUDIT_OPERATION, *PSE_AUDIT_OPERATION;

typedef enum _PSW32JOBCALLOUTTYPE
{
  PsW32JobCalloutSetInformation = 0,
  PsW32JobCalloutAddProcess = 1,
  PsW32JobCalloutTerminate = 2,
} PSW32JOBCALLOUTTYPE, *PPSW32JOBCALLOUTTYPE;

enum SYSTEM_POWER_CONDITION
{
  PoAc = 0,
  PoDc = 1,
  PoHot = 2,
  PoConditionMaximum = 3,
};

typedef struct _VERIFIER_SHARED_EXPORT_THUNK
{
  /* 0x0000 */ void** IATEntry;
  /* 0x0008 */ void* VerifierRoutine /* function */;
} VERIFIER_SHARED_EXPORT_THUNK, *PVERIFIER_SHARED_EXPORT_THUNK; /* size: 0x0010 */

typedef enum _AMD64_UNWIND_OP_CODES
{
  AMD64_UWOP_PUSH_NONVOL = 0,
  AMD64_UWOP_ALLOC_LARGE = 1,
  AMD64_UWOP_ALLOC_SMALL = 2,
  AMD64_UWOP_SET_FPREG = 3,
  AMD64_UWOP_SAVE_NONVOL = 4,
  AMD64_UWOP_SAVE_NONVOL_FAR = 5,
  AMD64_UWOP_SAVE_XMM = 6,
  AMD64_UWOP_SAVE_XMM_FAR = 7,
  AMD64_UWOP_SAVE_XMM128 = 8,
  AMD64_UWOP_SAVE_XMM128_FAR = 9,
  AMD64_UWOP_PUSH_MACHFRAME = 10,
} AMD64_UNWIND_OP_CODES, *PAMD64_UNWIND_OP_CODES;

typedef enum _WHEA_PCIEXPRESS_DEVICE_TYPE
{
  WheaPciExpressEndpoint = 0,
  WheaPciExpressLegacyEndpoint = 1,
  WheaPciExpressRootPort = 4,
  WheaPciExpressUpstreamSwitchPort = 5,
  WheaPciExpressDownstreamSwitchPort = 6,
  WheaPciExpressToPciXBridge = 7,
  WheaPciXToExpressBridge = 8,
  WheaPciExpressRootComplexIntegratedEndpoint = 9,
  WheaPciExpressRootComplexEventCollector = 10,
} WHEA_PCIEXPRESS_DEVICE_TYPE, *PWHEA_PCIEXPRESS_DEVICE_TYPE;

typedef enum _IO_COMPLETION_ROUTINE_RESULT
{
  ContinueCompletion = 0,
  StopCompletion = -1073741802,
} IO_COMPLETION_ROUTINE_RESULT, *PIO_COMPLETION_ROUTINE_RESULT;

typedef enum _KD_OPTION
{
  KD_OPTION_SET_BLOCK_ENABLE = 0,
} KD_OPTION, *PKD_OPTION;

typedef enum _CLS_LOG_INFORMATION_CLASS
{
  ClfsLogBasicInformation = 0,
  ClfsLogBasicInformationPhysical = 1,
  ClfsLogPhysicalNameInformation = 2,
  ClfsLogStreamIdentifierInformation = 3,
  ClfsLogSystemMarkingInformation = 4,
  ClfsLogPhysicalLsnInformation = 5,
} CLS_LOG_INFORMATION_CLASS, *PCLS_LOG_INFORMATION_CLASS;

typedef struct _CM_HASH_ENTRY
{
  /* 0x0000 */ unsigned long ConvKey;
  /* 0x0004 */ long Padding_92;
  /* 0x0008 */ struct _UNICODE_STRING KeyName;
} CM_HASH_ENTRY, *PCM_HASH_ENTRY; /* size: 0x0018 */

typedef struct _MM_KERNEL_DUMP_CONTEXT
{
  /* 0x0000 */ void* Context;
  /* 0x0008 */ void* SetDumpRange /* function */;
  /* 0x0010 */ void* FreeDumpRange /* function */;
} MM_KERNEL_DUMP_CONTEXT, *PMM_KERNEL_DUMP_CONTEXT; /* size: 0x0018 */

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER
{
  LookasideSmallIrpList = 0,
  LookasideMediumIrpList = 1,
  LookasideLargeIrpList = 2,
  LookasideMdlList = 3,
  LookasideCreateInfoList = 4,
  LookasideNameBufferList = 5,
  LookasideTwilightList = 6,
  LookasideCompletionList = 7,
  LookasideScratchBufferList = 8,
  LookasideMaximumList = 9,
} PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _JOURNAL_INFORMATION_CLASS
{
  JournalAbsoluteInformation = 0,
  JournalClientInformation = 1,
  MaxJournalInformation = 2,
} JOURNAL_INFORMATION_CLASS, *PJOURNAL_INFORMATION_CLASS;

typedef enum _EXT_TDOP
{
  EXT_TDOP_COPY = 0,
  EXT_TDOP_RELEASE = 1,
  EXT_TDOP_SET_FROM_EXPR = 2,
  EXT_TDOP_SET_FROM_U64_EXPR = 3,
  EXT_TDOP_GET_FIELD = 4,
  EXT_TDOP_EVALUATE = 5,
  EXT_TDOP_GET_TYPE_NAME = 6,
  EXT_TDOP_OUTPUT_TYPE_NAME = 7,
  EXT_TDOP_OUTPUT_SIMPLE_VALUE = 8,
  EXT_TDOP_OUTPUT_FULL_VALUE = 9,
  EXT_TDOP_HAS_FIELD = 10,
  EXT_TDOP_GET_FIELD_OFFSET = 11,
  EXT_TDOP_GET_ARRAY_ELEMENT = 12,
  EXT_TDOP_GET_DEREFERENCE = 13,
  EXT_TDOP_GET_TYPE_SIZE = 14,
  EXT_TDOP_OUTPUT_TYPE_DEFINITION = 15,
  EXT_TDOP_GET_POINTER_TO = 16,
  EXT_TDOP_SET_FROM_TYPE_ID_AND_U64 = 17,
  EXT_TDOP_SET_PTR_FROM_TYPE_ID_AND_U64 = 18,
  EXT_TDOP_COUNT = 19,
} EXT_TDOP, *PEXT_TDOP;

typedef struct _CM_INT13_DRIVE_PARAMETER
{
  /* 0x0000 */ unsigned short DriveSelect;
  /* 0x0002 */ unsigned long MaxCylinders;
  /* 0x0006 */ unsigned short SectorsPerTrack;
  /* 0x0008 */ unsigned short MaxHeads;
  /* 0x000a */ unsigned short NumberDrives;
} CM_INT13_DRIVE_PARAMETER, *PCM_INT13_DRIVE_PARAMETER; /* size: 0x000c */

enum PS_CREATE_STATE
{
  PsCreateInitialState = 0,
  PsCreateFailOnFileOpen = 1,
  PsCreateFailOnSectionCreate = 2,
  PsCreateFailExeFormat = 3,
  PsCreateFailMachineMismatch = 4,
  PsCreateFailExeName = 5,
  PsCreateSuccess = 6,
  PsCreateMaximumStates = 7,
};

typedef enum _SYSTEM_MEMORY_LIST_COMMAND
{
  MemoryCaptureAccessedBits = 0,
  MemoryCaptureAndResetAccessedBits = 1,
  MemoryEmptyWorkingSets = 2,
  MemoryFlushModifiedList = 3,
  MemoryPurgeStandbyList = 4,
  MemoryPurgeLowPriorityStandbyList = 5,
  MemoryCommandMax = 6,
} SYSTEM_MEMORY_LIST_COMMAND, *PSYSTEM_MEMORY_LIST_COMMAND;

typedef enum _ACCESS_REASON_TYPE
{
  AccessReasonNone = 0,
  AccessReasonAllowedAce = 0x10000,
  AccessReasonDeniedAce = 0x20000,
  AccessReasonAllowedParentAce = 0x30000,
  AccessReasonDeniedParentAce = 0x40000,
  AccessReasonMissingPrivilege = 0x100000,
  AccessReasonFromPrivilege = 0x200000,
  AccessReasonIntegrityLevel = 0x300000,
  AccessReasonOwnership = 0x400000,
  AccessReasonNullDacl = 0x500000,
  AccessReasonEmptyDacl = 0x600000,
  AccessReasonNoSD = 0x700000,
  AccessReasonNoGrant = 0x800000,
} ACCESS_REASON_TYPE, *PACCESS_REASON_TYPE;

typedef struct _VF_SUSPECT_DRIVER_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Links;
  /* 0x0010 */ unsigned long Loads;
  /* 0x0014 */ unsigned long Unloads;
  /* 0x0018 */ struct _UNICODE_STRING BaseName;
} VF_SUSPECT_DRIVER_ENTRY, *PVF_SUSPECT_DRIVER_ENTRY; /* size: 0x0028 */

enum PO_WAKE_SOURCE_TYPE
{
  DeviceWakeSourceType = 0,
  FixedWakeSourceType = 1,
  TimerWakeSourceType = 2,
};

typedef struct _PS_ATTRIBUTE_LIST
{
  /* 0x0000 */ unsigned __int64 TotalLength;
  /* 0x0008 */ struct _PS_ATTRIBUTE Attributes[1];
} PS_ATTRIBUTE_LIST, *PPS_ATTRIBUTE_LIST; /* size: 0x0028 */

typedef enum _IO_CONTAINER_INFORMATION_CLASS
{
  IoSessionStateInformation = 0,
  IoMaxContainerInformationClass = 1,
} IO_CONTAINER_INFORMATION_CLASS, *PIO_CONTAINER_INFORMATION_CLASS;

typedef enum _DBGKD_MAJOR_TYPES
{
  DBGKD_MAJOR_NT = 0,
  DBGKD_MAJOR_XBOX = 1,
  DBGKD_MAJOR_BIG = 2,
  DBGKD_MAJOR_EXDI = 3,
  DBGKD_MAJOR_NTBD = 4,
  DBGKD_MAJOR_EFI = 5,
  DBGKD_MAJOR_TNT = 6,
  DBGKD_MAJOR_SINGULARITY = 7,
  DBGKD_MAJOR_HYPERVISOR = 8,
  DBGKD_MAJOR_MIDORI = 9,
  DBGKD_MAJOR_COUNT = 10,
} DBGKD_MAJOR_TYPES, *PDBGKD_MAJOR_TYPES;

typedef enum _TRANSACTION_OUTCOME
{
  TransactionOutcomeUndetermined = 1,
  TransactionOutcomeCommitted = 2,
  TransactionOutcomeAborted = 3,
} TRANSACTION_OUTCOME, *PTRANSACTION_OUTCOME;

typedef struct _GET_PEB_ADDRESS
{
  /* 0x0000 */ unsigned __int64 CurrentThread;
  /* 0x0008 */ unsigned __int64 Address;
} GET_PEB_ADDRESS, *PGET_PEB_ADDRESS; /* size: 0x0010 */

typedef enum _HV_CPUID_FUNCTION
{
  HvCpuIdFunctionVersionAndFeatures = 1,
  HvCpuIdFunctionHvVendorAndMaxFunction = 0x40000000,
  HvCpuIdFunctionHvInterface = 0x40000001,
  HvCpuIdFunctionMsHvVersion = 0x40000002,
  HvCpuIdFunctionMsHvFeatures = 0x40000003,
  HvCpuIdFunctionMsHvEnlightenmentInformation = 0x40000004,
  HvCpuIdFunctionMsHvImplementationLimits = 0x40000005,
} HV_CPUID_FUNCTION, *PHV_CPUID_FUNCTION;

typedef enum _SYSTEM_VA_TYPE
{
  SystemVaTypeAll = 0,
  SystemVaTypeNonPagedPool = 1,
  SystemVaTypePagedPool = 2,
  SystemVaTypeSystemCache = 3,
  SystemVaTypeSystemPtes = 4,
  SystemVaTypeSessionSpace = 5,
  SystemVaTypeMax = 6,
} SYSTEM_VA_TYPE, *PSYSTEM_VA_TYPE;

typedef enum _WORKING_SET_TRIMMER_STATE
{
  TrimmerStateNone = 0,
  TrimmerStateAttached = 1,
  TrimmerStateDetaching = 2,
  TrimmerStateInUse = 3,
} WORKING_SET_TRIMMER_STATE, *PWORKING_SET_TRIMMER_STATE;

typedef struct _PHYSICAL_MEMORY_RUN64
{
  /* 0x0000 */ unsigned __int64 BasePage;
  /* 0x0008 */ unsigned __int64 PageCount;
} PHYSICAL_MEMORY_RUN64, *PPHYSICAL_MEMORY_RUN64; /* size: 0x0010 */

typedef struct _PHYSICAL_MEMORY_DESCRIPTOR64
{
  /* 0x0000 */ unsigned long NumberOfRuns;
  /* 0x0004 */ long Padding_93;
  /* 0x0008 */ unsigned __int64 NumberOfPages;
  /* 0x0010 */ struct _PHYSICAL_MEMORY_RUN64 Run[1];
} PHYSICAL_MEMORY_DESCRIPTOR64, *PPHYSICAL_MEMORY_DESCRIPTOR64; /* size: 0x0020 */

typedef struct _EXCEPTION_RECORD64
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ unsigned __int64 ExceptionRecord;
  /* 0x0010 */ unsigned __int64 ExceptionAddress;
  /* 0x0018 */ unsigned long NumberParameters;
  /* 0x001c */ unsigned long __unusedAlignment;
  /* 0x0020 */ unsigned __int64 ExceptionInformation[15];
} EXCEPTION_RECORD64, *PEXCEPTION_RECORD64; /* size: 0x0098 */

typedef struct _DUMP_HEADER64
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long ValidDump;
  /* 0x0008 */ unsigned long MajorVersion;
  /* 0x000c */ unsigned long MinorVersion;
  /* 0x0010 */ unsigned __int64 DirectoryTableBase;
  /* 0x0018 */ unsigned __int64 PfnDataBase;
  /* 0x0020 */ unsigned __int64 PsLoadedModuleList;
  /* 0x0028 */ unsigned __int64 PsActiveProcessHead;
  /* 0x0030 */ unsigned long MachineImageType;
  /* 0x0034 */ unsigned long NumberProcessors;
  /* 0x0038 */ unsigned long BugCheckCode;
  /* 0x003c */ long Padding_94;
  /* 0x0040 */ unsigned __int64 BugCheckParameter1;
  /* 0x0048 */ unsigned __int64 BugCheckParameter2;
  /* 0x0050 */ unsigned __int64 BugCheckParameter3;
  /* 0x0058 */ unsigned __int64 BugCheckParameter4;
  /* 0x0060 */ char VersionUser[32];
  /* 0x0080 */ unsigned __int64 KdDebuggerDataBlock;
  union
  {
    /* 0x0088 */ struct _PHYSICAL_MEMORY_DESCRIPTOR64 PhysicalMemoryBlock;
    /* 0x0088 */ unsigned char PhysicalMemoryBlockBuffer[700];
  }; /* size: 0x02bc */
  /* 0x0344 */ long Padding_95;
  /* 0x0348 */ unsigned char ContextRecord[3000];
  /* 0x0f00 */ struct _EXCEPTION_RECORD64 Exception;
  /* 0x0f98 */ unsigned long DumpType;
  /* 0x0f9c */ long Padding_96;
  /* 0x0fa0 */ union _LARGE_INTEGER RequiredDumpSpace;
  /* 0x0fa8 */ union _LARGE_INTEGER SystemTime;
  /* 0x0fb0 */ char Comment[128];
  /* 0x1030 */ union _LARGE_INTEGER SystemUpTime;
  /* 0x1038 */ unsigned long MiniDumpFields;
  /* 0x103c */ unsigned long SecondaryDataState;
  /* 0x1040 */ unsigned long ProductType;
  /* 0x1044 */ unsigned long SuiteMask;
  /* 0x1048 */ unsigned long WriterStatus;
  /* 0x104c */ unsigned char Unused1;
  /* 0x104d */ unsigned char KdSecondaryVersion;
  /* 0x104e */ unsigned char Unused[2];
  /* 0x1050 */ unsigned char _reserved0[4016];
} DUMP_HEADER64, *PDUMP_HEADER64; /* size: 0x2000 */

typedef enum _HAL_DISPLAY_BIOS_INFORMATION
{
  HalDisplayInt10Bios = 0,
  HalDisplayEmulatedBios = 1,
  HalDisplayNoBios = 2,
} HAL_DISPLAY_BIOS_INFORMATION, *PHAL_DISPLAY_BIOS_INFORMATION;

enum PO_FIXED_WAKE_SOURCE_TYPE
{
  FixedWakeSourcePowerButton = 0,
  FixedWakeSourceSleepButton = 1,
  FixedWakeSourceRtc = 2,
  FixedWakeSourceDozeToHibernate = 3,
};

typedef enum _STORAGE_BUS_TYPE
{
  BusTypeUnknown = 0,
  BusTypeScsi = 1,
  BusTypeAtapi = 2,
  BusTypeAta = 3,
  BusType1394 = 4,
  BusTypeSsa = 5,
  BusTypeFibre = 6,
  BusTypeUsb = 7,
  BusTypeRAID = 8,
  BusTypeiScsi = 9,
  BusTypeSas = 10,
  BusTypeSata = 11,
  BusTypeSd = 12,
  BusTypeMmc = 13,
  BusTypeVirtual = 14,
  BusTypeFileBackedVirtual = 15,
  BusTypeMax = 16,
  BusTypeMaxReserved = 127,
} STORAGE_BUS_TYPE, *PSTORAGE_BUS_TYPE;

typedef struct _PERFINFO_WORKINGSETMANAGER_INFORMATION
{
  /* 0x0000 */ unsigned __int64 Available;
  /* 0x0008 */ unsigned __int64 DesiredFreeGoal;
  /* 0x0010 */ unsigned __int64 TotalClaim;
  /* 0x0018 */ unsigned __int64 TotalEstimatedAvailable;
  /* 0x0020 */ unsigned __int64 TotalDirtyPages;
  /* 0x0028 */ unsigned __int64 TotalDirtyPagesForPagefile;
  /* 0x0030 */ unsigned __int64 PlentyFreePages;
  /* 0x0038 */ unsigned long PageFaultCount;
  /* 0x003c */ unsigned long ZFODFaultCount;
  /* 0x0040 */ unsigned long StandbyRemoved;
  /* 0x0044 */ unsigned long AgeEstimationShift;
  /* 0x0048 */ unsigned char Replacing;
  /* 0x0049 */ char __PADDING__[7];
} PERFINFO_WORKINGSETMANAGER_INFORMATION, *PPERFINFO_WORKINGSETMANAGER_INFORMATION; /* size: 0x0050 */

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE
{
  NotifyTypeCreate = 0,
  NotifyTypeRetired = 1,
} FS_FILTER_STREAM_FO_NOTIFICATION_TYPE, *PFS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

enum INTERRUPT_CONNECTION_TYPE
{
  InterruptTypeControllerInput = 0,
  InterruptTypeXapicMessage = 1,
  InterruptTypeHypertransport = 2,
  InterruptTypeMessageRequest = 3,
};

typedef enum _RTL_UMS_SCHEDULER_REASON
{
  UmsSchedulerStartup = 0,
  UmsSchedulerThreadBlocked = 1,
  UmsSchedulerThreadYield = 2,
} RTL_UMS_SCHEDULER_REASON, *PRTL_UMS_SCHEDULER_REASON;

typedef enum _LSA_LOOKUP_DOMAIN_INFO_CLASS
{
  AccountDomainInformation = 5,
  DnsDomainInformation = 12,
} LSA_LOOKUP_DOMAIN_INFO_CLASS, *PLSA_LOOKUP_DOMAIN_INFO_CLASS;

typedef enum _FP_IEEE_OPERATION_CODE
{
  FpCodeUnspecified = 0,
  FpCodeAdd = 1,
  FpCodeSubtract = 2,
  FpCodeMultiply = 3,
  FpCodeDivide = 4,
  FpCodeSquareRoot = 5,
  FpCodeRemainder = 6,
  FpCodeCompare = 7,
  FpCodeConvert = 8,
  FpCodeRound = 9,
  FpCodeTruncate = 10,
  FpCodeFloor = 11,
  FpCodeCeil = 12,
  FpCodeAcos = 13,
  FpCodeAsin = 14,
  FpCodeAtan = 15,
  FpCodeAtan2 = 16,
  FpCodeCabs = 17,
  FpCodeCos = 18,
  FpCodeCosh = 19,
  FpCodeExp = 20,
  FpCodeFabs = 21,
  FpCodeFmod = 22,
  FpCodeFrexp = 23,
  FpCodeHypot = 24,
  FpCodeLdexp = 25,
  FpCodeLog = 26,
  FpCodeLog10 = 27,
  FpCodeModf = 28,
  FpCodePow = 29,
  FpCodeSin = 30,
  FpCodeSinh = 31,
  FpCodeTan = 32,
  FpCodeTanh = 33,
  FpCodeY0 = 34,
  FpCodeY1 = 35,
  FpCodeYn = 36,
} FP_IEEE_OPERATION_CODE, *PFP_IEEE_OPERATION_CODE;

typedef enum _FILE_OBJECT_EXTENSION_TYPE
{
  FoExtTypeTransactionParams = 0,
  FoExtTypeDeviceObjectHint = 1,
  FoExtTypeIosbRange = 2,
  FoExtTypeGeneric = 3,
  FoExtTypeSfio = 4,
  FoExtTypeSymlink = 5,
  FoExtTypeOplockKey = 6,
  MaxFoExtTypes = 7,
} FILE_OBJECT_EXTENSION_TYPE, *PFILE_OBJECT_EXTENSION_TYPE;

typedef struct _KAPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char SpareByte0;
  /* 0x0002 */ unsigned char Size;
  /* 0x0003 */ unsigned char SpareByte1;
  /* 0x0004 */ unsigned long SpareLong0;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x0010 */ struct _LIST_ENTRY ApcListEntry;
  /* 0x0020 */ void* KernelRoutine /* function */;
  /* 0x0028 */ void* RundownRoutine /* function */;
  /* 0x0030 */ void* NormalRoutine /* function */;
  /* 0x0038 */ void* NormalContext;
  /* 0x0040 */ void* SystemArgument1;
  /* 0x0048 */ void* SystemArgument2;
  /* 0x0050 */ char ApcStateIndex;
  /* 0x0051 */ char ApcMode;
  /* 0x0052 */ unsigned char Inserted;
  /* 0x0053 */ char __PADDING__[5];
} KAPC, *PKAPC; /* size: 0x0058 */

typedef enum _MEMORY_WORKING_SET_EX_LOCATION
{
  MemoryLocationInvalid = 0,
  MemoryLocationResident = 1,
  MemoryLocationPagefile = 2,
  MemoryLocationReserved = 3,
} MEMORY_WORKING_SET_EX_LOCATION, *PMEMORY_WORKING_SET_EX_LOCATION;

typedef struct _ACCESS_ALLOWED_OBJECT_ACE
{
  /* 0x0000 */ struct _ACE_HEADER Header;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _GUID ObjectType;
  /* 0x001c */ struct _GUID InheritedObjectType;
  /* 0x002c */ unsigned long SidStart;
} ACCESS_ALLOWED_OBJECT_ACE, *PACCESS_ALLOWED_OBJECT_ACE; /* size: 0x0030 */

typedef enum _VF_ISSUE_TYPE
{
  VF_ISSUE_NO_CANCEL_ROUTINE = 1,
  VF_ISSUE_IRP_TAKES_TOO_LONG = 2,
  VF_ISSUE_CANCEL_TAKES_TOO_LONG = 3,
} VF_ISSUE_TYPE, *PVF_ISSUE_TYPE;

typedef struct _CACHE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Level;
  /* 0x0001 */ unsigned char Associativity;
  /* 0x0002 */ unsigned short LineSize;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ enum _PROCESSOR_CACHE_TYPE Type;
} CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR; /* size: 0x000c */

typedef enum _WRITE_CACHE_TYPE
{
  WriteCacheTypeUnknown = 0,
  WriteCacheTypeNone = 1,
  WriteCacheTypeWriteBack = 2,
  WriteCacheTypeWriteThrough = 3,
} WRITE_CACHE_TYPE, *PWRITE_CACHE_TYPE;

typedef enum _TIMER_TYPE
{
  NotificationTimer = 0,
  SynchronizationTimer = 1,
} TIMER_TYPE, *PTIMER_TYPE;

typedef struct _LSA_DISPATCH_TABLE
{
  /* 0x0000 */ void* CreateLogonSession /* function */;
  /* 0x0008 */ void* DeleteLogonSession /* function */;
  /* 0x0010 */ void* AddCredential /* function */;
  /* 0x0018 */ void* GetCredentials /* function */;
  /* 0x0020 */ void* DeleteCredential /* function */;
  /* 0x0028 */ void* AllocateLsaHeap /* function */;
  /* 0x0030 */ void* FreeLsaHeap /* function */;
  /* 0x0038 */ void* AllocateClientBuffer /* function */;
  /* 0x0040 */ void* FreeClientBuffer /* function */;
  /* 0x0048 */ void* CopyToClientBuffer /* function */;
  /* 0x0050 */ void* CopyFromClientBuffer /* function */;
} LSA_DISPATCH_TABLE, *PLSA_DISPATCH_TABLE; /* size: 0x0058 */

typedef enum _ARBITER_ACTION
{
  ArbiterActionTestAllocation = 0,
  ArbiterActionRetestAllocation = 1,
  ArbiterActionCommitAllocation = 2,
  ArbiterActionRollbackAllocation = 3,
  ArbiterActionQueryAllocatedResources = 4,
  ArbiterActionWriteReservedResources = 5,
  ArbiterActionQueryConflict = 6,
  ArbiterActionQueryArbitrate = 7,
  ArbiterActionAddReserved = 8,
  ArbiterActionBootAllocation = 9,
} ARBITER_ACTION, *PARBITER_ACTION;

typedef struct _WIN32_PARSEMETHOD_PARAMETERS
{
  /* 0x0000 */ void* ParseObject;
  /* 0x0008 */ void* ObjectType;
  /* 0x0010 */ struct _ACCESS_STATE* AccessState;
  /* 0x0018 */ char AccessMode;
  /* 0x0019 */ char Padding_97[3];
  /* 0x001c */ unsigned long Attributes;
  /* 0x0020 */ struct _UNICODE_STRING* CompleteName;
  /* 0x0028 */ struct _UNICODE_STRING* RemainingName;
  /* 0x0030 */ void* Context;
  /* 0x0038 */ struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;
  /* 0x0040 */ void** Object;
} WIN32_PARSEMETHOD_PARAMETERS, *PWIN32_PARSEMETHOD_PARAMETERS; /* size: 0x0048 */

typedef enum _LSA_TOKEN_INFORMATION_TYPE
{
  LsaTokenInformationNull = 0,
  LsaTokenInformationV1 = 1,
  LsaTokenInformationV2 = 2,
} LSA_TOKEN_INFORMATION_TYPE, *PLSA_TOKEN_INFORMATION_TYPE;

typedef enum _TRANSACTION_INFORMATION_CLASS
{
  TransactionBasicInformation = 0,
  TransactionPropertiesInformation = 1,
  TransactionEnlistmentInformation = 2,
  TransactionSuperiorEnlistmentInformation = 3,
  TransactionBindInformation = 4,
  TransactionDTCPrivateInformation = 5,
} TRANSACTION_INFORMATION_CLASS, *PTRANSACTION_INFORMATION_CLASS;

typedef struct _REENUMERATE_SELF_INTERFACE_STANDARD
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ long Padding_98;
  /* 0x0008 */ void* Context;
  /* 0x0010 */ void* InterfaceReference /* function */;
  /* 0x0018 */ void* InterfaceDereference /* function */;
  /* 0x0020 */ void* SurpriseRemoveAndReenumerateSelf /* function */;
} REENUMERATE_SELF_INTERFACE_STANDARD, *PREENUMERATE_SELF_INTERFACE_STANDARD; /* size: 0x0028 */

typedef enum _POLICY_NOTIFICATION_INFORMATION_CLASS
{
  PolicyNotifyAuditEventsInformation = 1,
  PolicyNotifyAccountDomainInformation = 2,
  PolicyNotifyServerRoleInformation = 3,
  PolicyNotifyDnsDomainInformation = 4,
  PolicyNotifyDomainEfsInformation = 5,
  PolicyNotifyDomainKerberosTicketInformation = 6,
  PolicyNotifyMachineAccountPasswordInformation = 7,
  PolicyNotifyGlobalSaclInformation = 8,
  PolicyNotifyMax = 9,
} POLICY_NOTIFICATION_INFORMATION_CLASS, *PPOLICY_NOTIFICATION_INFORMATION_CLASS;

enum HAL_INTERRUPT_TARGET_TYPE
{
  InterruptTargetTypeApic = 0,
  InterruptTargetTypeApicRequest = 1,
  InterruptTargetTypeGlobal = 2,
  InterruptTargetTypeRemappingTable = 3,
};

typedef struct _KEY_VALUE_FULL_INFORMATION
{
  /* 0x0000 */ unsigned long TitleIndex;
  /* 0x0004 */ unsigned long Type;
  /* 0x0008 */ unsigned long DataOffset;
  /* 0x000c */ unsigned long DataLength;
  /* 0x0010 */ unsigned long NameLength;
  /* 0x0014 */ wchar_t Name[1];
  /* 0x0016 */ char __PADDING__[2];
} KEY_VALUE_FULL_INFORMATION, *PKEY_VALUE_FULL_INFORMATION; /* size: 0x0018 */

typedef enum _UNWIND_OP_CODES
{
  UWOP_PUSH_NONVOL = 0,
  UWOP_ALLOC_LARGE = 1,
  UWOP_ALLOC_SMALL = 2,
  UWOP_SET_FPREG = 3,
  UWOP_SAVE_NONVOL = 4,
  UWOP_SAVE_NONVOL_FAR = 5,
  UWOP_SPARE_CODE1 = 6,
  UWOP_SPARE_CODE2 = 7,
  UWOP_SAVE_XMM128 = 8,
  UWOP_SAVE_XMM128_FAR = 9,
  UWOP_PUSH_MACHFRAME = 10,
} UNWIND_OP_CODES, *PUNWIND_OP_CODES;

typedef struct _PROC_PERF_CONSTRAINT
{
  /* 0x0000 */ struct _KPRCB* Prcb;
  /* 0x0008 */ unsigned __int64 PerfContext;
  /* 0x0010 */ unsigned long PercentageCap;
  /* 0x0014 */ unsigned long ThermalCap;
  /* 0x0018 */ unsigned long TargetFrequency;
  /* 0x001c */ unsigned long AcumulatedFullFrequency;
  /* 0x0020 */ unsigned long AcumulatedZeroFrequency;
  /* 0x0024 */ unsigned long FrequencyHistoryTotal;
  /* 0x0028 */ unsigned long AverageFrequency;
  /* 0x002c */ long __PADDING__[1];
} PROC_PERF_CONSTRAINT, *PPROC_PERF_CONSTRAINT; /* size: 0x0030 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 0,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

enum LSA_FOREST_TRUST_COLLISION_RECORD_TYPE
{
  CollisionTdo = 0,
  CollisionXref = 1,
  CollisionOther = 2,
};

typedef struct _TEB_ACTIVE_FRAME_CONTEXT32
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long FrameName;
} TEB_ACTIVE_FRAME_CONTEXT32, *PTEB_ACTIVE_FRAME_CONTEXT32; /* size: 0x0008 */

typedef struct _TEB_ACTIVE_FRAME_CONTEXT_EX32
{
  /* 0x0000 */ struct _TEB_ACTIVE_FRAME_CONTEXT32 BasicContext;
  /* 0x0008 */ unsigned long SourceLocation;
} TEB_ACTIVE_FRAME_CONTEXT_EX32, *PTEB_ACTIVE_FRAME_CONTEXT_EX32; /* size: 0x000c */

typedef enum _TP_LOG_LEVEL
{
  TP_LOG_LEVEL_ERROR = 0,
  TP_LOG_LEVEL_WARNING = 1,
  TP_LOG_LEVEL_INFO = 2,
  TP_LOG_LEVEL_TRACE_ENTER = 3,
  TP_LOG_LEVEL_TRACE_LEAVE = 4,
} TP_LOG_LEVEL, *PTP_LOG_LEVEL;

typedef enum _MM_TRIM_WHILE_AGING_STATE
{
  MmTrimWhileAgingOff = 0,
  MmTrimWhileAgingLowPriority = 1,
  MmTrimWhileAgingPassive = 2,
  MmTrimWhileAgingNormal = 3,
  MmTrimWhileAgingAggressive = 4,
  MmTrimWhileAgingMax = 5,
} MM_TRIM_WHILE_AGING_STATE, *PMM_TRIM_WHILE_AGING_STATE;

typedef enum _EVENT_TRACE_INFORMATION_CLASS
{
  EventTraceKernelVersionInformation = 0,
  EventTraceGroupMaskInformation = 1,
  EventTracePerformanceInformation = 2,
  EventTraceTimeProfileInformation = 3,
  EventTraceSessionSecurityInformation = 4,
  EventTraceSpinlockInformation = 5,
  EventTraceStackTracingInformation = 6,
  EventTraceExecutiveResourceInformation = 7,
  EventTraceHeapTracingInformation = 8,
  EventTraceHeapSummaryTracingInformation = 9,
  EventTracePoolTagFilterInformation = 10,
  MaxEventTraceInfoClass = 11,
} EVENT_TRACE_INFORMATION_CLASS, *PEVENT_TRACE_INFORMATION_CLASS;

typedef enum _HARDERROR_RESPONSE
{
  ResponseReturnToCaller = 0,
  ResponseNotHandled = 1,
  ResponseAbort = 2,
  ResponseCancel = 3,
  ResponseIgnore = 4,
  ResponseNo = 5,
  ResponseOk = 6,
  ResponseRetry = 7,
  ResponseYes = 8,
  ResponseTryAgain = 9,
  ResponseContinue = 10,
} HARDERROR_RESPONSE, *PHARDERROR_RESPONSE;

typedef enum _MM_STORE_KEY_TYPE
{
  MmStoreKeyTypeProcess = 0,
  MmStoreKeyTypeSession = 1,
  MmStoreKeyTypeSystem = 2,
  MmStoreKeyTypeSection = 3,
  MmStoreKeyTypeMax = 4,
} MM_STORE_KEY_TYPE, *PMM_STORE_KEY_TYPE;

enum PCI_EXPRESS_ASPM_CONTROL
{
  L0sAndL1EntryDisabled = 0,
  L0sEntryEnabled = 1,
  L1EntryEnabled = 2,
  L0sAndL1EntryEnabled = 3,
};

typedef struct _ETW_CRITSEC_EVENT_INIT
{
  /* 0x0000 */ struct _SYSTEM_TRACE_HEADER Header;
  /* 0x0020 */ void* SpinCount;
  /* 0x0028 */ void* Address;
} ETW_CRITSEC_EVENT_INIT, *PETW_CRITSEC_EVENT_INIT; /* size: 0x0030 */

enum RTL_BSD_ITEM_TYPE
{
  RtlBsdItemVersionNumber = 0,
  RtlBsdItemProductType = 1,
  RtlBsdItemAabEnabled = 2,
  RtlBsdItemAabTimeout = 3,
  RtlBsdItemBootGood = 4,
  RtlBsdItemBootShutdown = 5,
  RtlBsdSleepInProgress = 6,
  RtlBsdPowerTransition = 7,
  RtlBsdItemMax = 8,
};

enum LATENCY_TIME
{
  LT_DONT_CARE = 0,
  LT_LOWEST_LATENCY = 1,
};

typedef struct _FILE_PIPE_ASSIGN_EVENT_BUFFER
{
  /* 0x0000 */ void* EventHandle;
  /* 0x0008 */ unsigned long KeyValue;
  /* 0x000c */ long __PADDING__[1];
} FILE_PIPE_ASSIGN_EVENT_BUFFER, *PFILE_PIPE_ASSIGN_EVENT_BUFFER; /* size: 0x0010 */

typedef enum _PFFI_CONFLICT_TYPE
{
  PfFiConflictCreate = 0,
  PfFiConflictTruncate = 1,
  PfFiConflictDelete = 2,
  PfFiConflictDeleteCreate = 3,
  PfFiConflictPurge = 4,
  PfFiConflictRename = 5,
  PfFiConflictRenameDirectory = 6,
  PfFiConflictSetLink = 7,
  PfFiConflictVolumeLock = 8,
  PfFiConflictVolumeDismount = 9,
  PfFiConflictTypeMax = 10,
} PFFI_CONFLICT_TYPE, *PPFFI_CONFLICT_TYPE;

typedef enum _PSPROCESSPRIORITYMODE
{
  PsProcessPriorityBackground = 0,
  PsProcessPriorityForeground = 1,
  PsProcessPrioritySpinning = 2,
} PSPROCESSPRIORITYMODE, *PPSPROCESSPRIORITYMODE;

enum VERIFIER_MODE
{
  VERIFIER_MODE_UNUSED = 0,
  VERIFIER_MODE_TRIAGE = 1,
  VERIFIER_MODE_FIELD = 2,
  VERIFIER_MODE_LOGO = 3,
  VERIFIER_MODE_TEST = 4,
};

enum BATTERY_QUERY_INFORMATION_LEVEL
{
  BatteryInformation = 0,
  BatteryGranularityInformation = 1,
  BatteryTemperature = 2,
  BatteryEstimatedTime = 3,
  BatteryDeviceName = 4,
  BatteryManufactureDate = 5,
  BatteryManufactureName = 6,
  BatteryUniqueID = 7,
};

typedef struct _INITIAL_PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[3];
} INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET; /* size: 0x002c */

typedef enum _ENLISTMENT_INFORMATION_CLASS
{
  EnlistmentBasicInformation = 0,
  EnlistmentRecoveryInformation = 1,
  EnlistmentCrmInformation = 2,
} ENLISTMENT_INFORMATION_CLASS, *PENLISTMENT_INFORMATION_CLASS;

typedef struct _RELATION_LIST_ENTRY
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long MaxCount;
  /* 0x0008 */ struct _DEVICE_OBJECT* Devices[1];
} RELATION_LIST_ENTRY, *PRELATION_LIST_ENTRY; /* size: 0x0010 */

typedef struct _FILE_LINK_INFORMATION
{
  /* 0x0000 */ unsigned char ReplaceIfExists;
  /* 0x0001 */ char Padding_99[7];
  /* 0x0008 */ void* RootDirectory;
  /* 0x0010 */ unsigned long FileNameLength;
  /* 0x0014 */ wchar_t FileName[1];
  /* 0x0016 */ char __PADDING__[2];
} FILE_LINK_INFORMATION, *PFILE_LINK_INFORMATION; /* size: 0x0018 */

typedef struct _COMPOUND_ACCESS_ALLOWED_ACE
{
  /* 0x0000 */ struct _ACE_HEADER Header;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ unsigned short CompoundAceType;
  /* 0x000a */ unsigned short Reserved;
  /* 0x000c */ unsigned long SidStart;
} COMPOUND_ACCESS_ALLOWED_ACE, *PCOMPOUND_ACCESS_ALLOWED_ACE; /* size: 0x0010 */

typedef enum _KBUGCHECK_DUMP_IO_TYPE
{
  KbDumpIoInvalid = 0,
  KbDumpIoHeader = 1,
  KbDumpIoBody = 2,
  KbDumpIoSecondaryData = 3,
  KbDumpIoComplete = 4,
} KBUGCHECK_DUMP_IO_TYPE, *PKBUGCHECK_DUMP_IO_TYPE;

typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Primary : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long ContainmentWarning : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Reset : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long ThresholdExceeded : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long ResourceNotAvailable : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long LatentError : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long Reserved : 26; /* bit position: 6 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS, *PWHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS; /* size: 0x0004 */

enum NOTIFY_MAPPED_WRITE_STATUS
{
  DisallowMappedWrite = 0,
  AllowMappedWriteNoCompletionCallback = 1,
  AllowMappedWriteWithCompletionCallback = 2,
};

typedef enum _RTL_STACK_TRACE_DATABASE_CONTROL
{
  BackTraceDatabaseCreate = 0,
  BackTraceDatabaseDelete = 1,
  BackTraceDatabaseFlush = 2,
  BackTraceDatabaseMaxControl = 3,
} RTL_STACK_TRACE_DATABASE_CONTROL, *PRTL_STACK_TRACE_DATABASE_CONTROL;

struct PPM_PERFSTATE_EVENT
{
  /* 0x0000 */ unsigned long State;
  /* 0x0004 */ unsigned long Status;
  /* 0x0008 */ unsigned long Latency;
  /* 0x000c */ unsigned long Speed;
  /* 0x0010 */ unsigned long Processor;
}; /* size: 0x0014 */

typedef enum _KPROFILE_SOURCE
{
  ProfileTime = 0,
  ProfileAlignmentFixup = 1,
  ProfileTotalIssues = 2,
  ProfilePipelineDry = 3,
  ProfileLoadInstructions = 4,
  ProfilePipelineFrozen = 5,
  ProfileBranchInstructions = 6,
  ProfileTotalNonissues = 7,
  ProfileDcacheMisses = 8,
  ProfileIcacheMisses = 9,
  ProfileCacheMisses = 10,
  ProfileBranchMispredictions = 11,
  ProfileStoreInstructions = 12,
  ProfileFpInstructions = 13,
  ProfileIntegerInstructions = 14,
  Profile2Issue = 15,
  Profile3Issue = 16,
  Profile4Issue = 17,
  ProfileSpecialInstructions = 18,
  ProfileTotalCycles = 19,
  ProfileIcacheIssues = 20,
  ProfileDcacheAccesses = 21,
  ProfileMemoryBarrierCycles = 22,
  ProfileLoadLinkedIssues = 23,
  ProfileMaximum = 24,
} KPROFILE_SOURCE, *PKPROFILE_SOURCE;

typedef struct _SLIST_ENTRY32
{
  /* 0x0000 */ unsigned long Next;
} SLIST_ENTRY32, *PSLIST_ENTRY32; /* size: 0x0004 */

typedef enum _ACL_INFORMATION_CLASS
{
  AclRevisionInformation = 1,
  AclSizeInformation = 2,
} ACL_INFORMATION_CLASS, *PACL_INFORMATION_CLASS;

typedef enum _CM_SERVICE_LOAD_TYPE
{
  BootLoad = 0,
  SystemLoad = 1,
  AutoLoad = 2,
  DemandLoad = 3,
  DisableLoad = 4,
} CM_SERVICE_LOAD_TYPE, *PCM_SERVICE_LOAD_TYPE;

typedef struct _KMUTANT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ struct _LIST_ENTRY MutantListEntry;
  /* 0x0028 */ struct _KTHREAD* OwnerThread;
  /* 0x0030 */ unsigned char Abandoned;
  /* 0x0031 */ unsigned char ApcDisable;
  /* 0x0032 */ char __PADDING__[6];
} KMUTANT, *PKMUTANT; /* size: 0x0038 */

typedef struct _PERFINFO_EVENT_MATCH_ID
{
  /* 0x0000 */ long UniqueID;
  /* 0x0004 */ unsigned short HookID;
  /* 0x0006 */ unsigned short Flags;
} PERFINFO_EVENT_MATCH_ID, *PPERFINFO_EVENT_MATCH_ID; /* size: 0x0008 */

enum PCI_EXPRESS_DEVICE_TYPE
{
  PciExpressEndpoint = 0,
  PciExpressLegacyEndpoint = 1,
  PciExpressRootPort = 4,
  PciExpressUpstreamSwitchPort = 5,
  PciExpressDownstreamSwitchPort = 6,
  PciExpressToPciXBridge = 7,
  PciXToExpressBridge = 8,
  PciExpressRootComplexIntegratedEndpoint = 9,
  PciExpressRootComplexEventCollector = 10,
};

typedef struct _DUMP_INITIALIZATION_CONTEXT
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* MemoryBlock;
  /* 0x0010 */ void* CommonBuffer[2];
  /* 0x0020 */ union _LARGE_INTEGER PhysicalAddress[2];
  /* 0x0030 */ void* StallRoutine /* function */;
  /* 0x0038 */ void* OpenRoutine /* function */;
  /* 0x0040 */ void* WriteRoutine /* function */;
  /* 0x0048 */ void* FinishRoutine /* function */;
  /* 0x0050 */ struct _ADAPTER_OBJECT* AdapterObject;
  /* 0x0058 */ void* MappedRegisterBase;
  /* 0x0060 */ void* PortConfiguration;
  /* 0x0068 */ unsigned char CrashDump;
  /* 0x0069 */ char Padding_100[3];
  /* 0x006c */ unsigned long MaximumTransferSize;
  /* 0x0070 */ unsigned long CommonBufferSize;
  /* 0x0074 */ long Padding_101;
  /* 0x0078 */ void* TargetAddress;
  /* 0x0080 */ void* WritePendingRoutine /* function */;
  /* 0x0088 */ unsigned long PartitionStyle;
  union
  {
    union
    {
      struct
      {
        /* 0x008c */ unsigned long Signature;
        /* 0x0090 */ unsigned long CheckSum;
      } /* size: 0x0008 */ Mbr;
      struct
      {
        /* 0x008c */ struct _GUID DiskId;
      } /* size: 0x0010 */ Gpt;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ DiskInfo;
  /* 0x009c */ long __PADDING__[1];
} DUMP_INITIALIZATION_CONTEXT, *PDUMP_INITIALIZATION_CONTEXT; /* size: 0x00a0 */

typedef struct _DUMP_STACK_CONTEXT
{
  /* 0x0000 */ struct _DUMP_INITIALIZATION_CONTEXT Init;
  /* 0x00a0 */ union _LARGE_INTEGER PartitionOffset;
  /* 0x00a8 */ void* DumpPointers;
  /* 0x00b0 */ unsigned long PointersLength;
  /* 0x00b4 */ long Padding_102;
  /* 0x00b8 */ unsigned short* ModulePrefix;
  /* 0x00c0 */ struct _LIST_ENTRY DriverList;
  /* 0x00d0 */ struct _STRING InitMsg;
  /* 0x00e0 */ struct _STRING ProgMsg;
  /* 0x00f0 */ struct _STRING DoneMsg;
  /* 0x0100 */ void* FileObject;
  /* 0x0108 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE UsageType;
  /* 0x010c */ long __PADDING__[1];
} DUMP_STACK_CONTEXT, *PDUMP_STACK_CONTEXT; /* size: 0x0110 */

typedef enum _SM_ENCRYPTION_SCOPE
{
  SmEncryptAll = 0,
  SmNoEncryptInternalIf = 1,
  SmNoEncryptInternal = 2,
  SmEncryptionScopeMax = 3,
} SM_ENCRYPTION_SCOPE, *PSM_ENCRYPTION_SCOPE;

enum IMAGE_AUX_SYMBOL_TYPE
{
  IMAGE_AUX_SYMBOL_TYPE_TOKEN_DEF = 1,
};

typedef struct _INTERRUPT_REMAPPING_INFO
{
  /* 0x0000 */ unsigned long IrtIndex;
} INTERRUPT_REMAPPING_INFO, *PINTERRUPT_REMAPPING_INFO; /* size: 0x0004 */

enum HAL_APIC_DESTINATION_MODE
{
  ApicDestinationModePhysical = 1,
  ApicDestinationModeLogicalFlat = 2,
  ApicDestinationModeLogicalClustered = 3,
  ApicDestinationModeUnknown = 4,
};

typedef struct _INTERRUPT_VECTOR_DATA
{
  /* 0x0000 */ enum INTERRUPT_CONNECTION_TYPE Type;
  /* 0x0004 */ unsigned long Vector;
  /* 0x0008 */ unsigned char Irql;
  /* 0x0009 */ char Padding_103[3];
  /* 0x000c */ enum _KINTERRUPT_POLARITY Polarity;
  /* 0x0010 */ enum _KINTERRUPT_MODE Mode;
  /* 0x0014 */ long Padding_104;
  /* 0x0018 */ struct _GROUP_AFFINITY TargetProcessors;
  /* 0x0028 */ struct _INTERRUPT_REMAPPING_INFO IntRemapInfo;
  /* 0x002c */ long Padding_105;
  union
  {
    struct
    {
      /* 0x0030 */ unsigned long Gsiv;
    } /* size: 0x0004 */ ControllerInput;
    struct
    {
      /* 0x0030 */ union _LARGE_INTEGER Address;
      /* 0x0038 */ unsigned long DataPayload;
      /* 0x003c */ long __PADDING__[1];
    } /* size: 0x0010 */ XapicMessage;
    struct
    {
      /* 0x0030 */ struct _INTERRUPT_HT_INTR_INFO IntrInfo;
    } /* size: 0x0008 */ Hypertransport;
    struct
    {
      /* 0x0030 */ union _LARGE_INTEGER Address;
      /* 0x0038 */ unsigned long DataPayload;
      /* 0x003c */ long __PADDING__[1];
    } /* size: 0x0010 */ GenericMessage;
    struct
    {
      struct
      {
        /* 0x0030 */ enum HAL_APIC_DESTINATION_MODE DestinationMode;
      } /* size: 0x0004 */ MessageRequest;
      /* 0x0034 */ long __PADDING__[3];
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
} INTERRUPT_VECTOR_DATA, *PINTERRUPT_VECTOR_DATA; /* size: 0x0040 */

typedef enum _WORK_QUEUE_TYPE
{
  CriticalWorkQueue = 0,
  DelayedWorkQueue = 1,
  HyperCriticalWorkQueue = 2,
  MaximumWorkQueue = 3,
} WORK_QUEUE_TYPE, *PWORK_QUEUE_TYPE;

typedef enum _IRQ_DEVICE_POLICY_USHORT
{
  IrqPolicyMachineDefault = 0,
  IrqPolicyAllCloseProcessors = 1,
  IrqPolicyOneCloseProcessor = 2,
  IrqPolicyAllProcessorsInMachine = 3,
  IrqPolicyAllProcessorsInGroup = 3,
  IrqPolicySpecifiedProcessors = 4,
  IrqPolicySpreadMessagesAcrossAllProcessors = 5,
} IRQ_DEVICE_POLICY_USHORT, *PIRQ_DEVICE_POLICY_USHORT;

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef struct _PCI_MSI_MESSAGE_ADDRESS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Reserved : 2; /* bit position: 0 */
    /* 0x0000 */ unsigned long Address : 30; /* bit position: 2 */
  }; /* bitfield */
} PCI_MSI_MESSAGE_ADDRESS, *PPCI_MSI_MESSAGE_ADDRESS; /* size: 0x0004 */

typedef struct _PERFINFO_BOOT_PREFETCH_INFORMATION
{
  /* 0x0000 */ long Action;
  /* 0x0004 */ long Status;
  /* 0x0008 */ long Pages;
} PERFINFO_BOOT_PREFETCH_INFORMATION, *PPERFINFO_BOOT_PREFETCH_INFORMATION; /* size: 0x000c */

typedef enum _CONFIGURATION_CLASS
{
  SystemClass = 0,
  ProcessorClass = 1,
  CacheClass = 2,
  AdapterClass = 3,
  ControllerClass = 4,
  PeripheralClass = 5,
  MemoryClass = 6,
  MaximumClass = 7,
} CONFIGURATION_CLASS, *PCONFIGURATION_CLASS;

typedef enum _PF_PHASED_SCENARIO_TYPE
{
  PfScenarioTypeNone = 0,
  PfScenarioTypeStandby = 1,
  PfScenarioTypeHibernate = 2,
  PfScenarioTypeFUS = 3,
  PfScenarioTypeLogon = 4,
  PfScenarioTypeMax = 5,
} PF_PHASED_SCENARIO_TYPE, *PPF_PHASED_SCENARIO_TYPE;

typedef enum _PSW32THREADCALLOUTTYPE
{
  PsW32ThreadCalloutInitialize = 0,
  PsW32ThreadCalloutExit = 1,
} PSW32THREADCALLOUTTYPE, *PPSW32THREADCALLOUTTYPE;

typedef struct _EMP_RULE_PARSER_STACK
{
  /* 0x0000 */ unsigned long TotalElements;
  /* 0x0004 */ long Padding_106;
  /* 0x0008 */ struct _SINGLE_LIST_ENTRY StackListHead;
} EMP_RULE_PARSER_STACK, *PEMP_RULE_PARSER_STACK; /* size: 0x0010 */

typedef enum _MM_FLUSH_REASON
{
  FlushOnly = 0,
  SystemFailure = 1,
} MM_FLUSH_REASON, *PMM_FLUSH_REASON;

typedef struct _TXN_PARAMETER_BLOCK
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short TxFsContext;
  /* 0x0004 */ long Padding_107;
  /* 0x0008 */ void* TransactionObject;
} TXN_PARAMETER_BLOCK, *PTXN_PARAMETER_BLOCK; /* size: 0x0010 */

typedef enum _TRACE_INFORMATION_CLASS
{
  TraceIdClass = 0,
  TraceHandleClass = 1,
  TraceEnableFlagsClass = 2,
  TraceEnableLevelClass = 3,
  GlobalLoggerHandleClass = 4,
  EventLoggerHandleClass = 5,
  AllLoggerHandlesClass = 6,
  TraceHandleByNameClass = 7,
  LoggerEventsLostClass = 8,
  TraceSessionSettingsClass = 9,
  LoggerEventsLoggedClass = 10,
  MaxTraceInformationClass = 11,
} TRACE_INFORMATION_CLASS, *PTRACE_INFORMATION_CLASS;

typedef enum _WORKERFACTORYINFOCLASS
{
  WorkerFactoryTimeout = 0,
  WorkerFactoryRetryTimeout = 1,
  WorkerFactoryIdleTimeout = 2,
  WorkerFactoryBindingCount = 3,
  WorkerFactoryThreadMinimum = 4,
  WorkerFactoryThreadMaximum = 5,
  WorkerFactoryPaused = 6,
  WorkerFactoryBasicInformation = 7,
  WorkerFactoryAdjustThreadGoal = 8,
  WorkerFactoryLongRunningSwitch = 9,
  WorkerFactoryStackInformation = 10,
  MaxWorkerFactoryInfoClass = 11,
} WORKERFACTORYINFOCLASS, *PWORKERFACTORYINFOCLASS;

typedef enum _CRASHDMP_EVENTS
{
  CRASHDMP_EVENT_NONE = 0,
  CRASHDMP_EVENT_CRASH_BEGIN = 1,
  CRASHDMP_EVENT_CRASH_END = 2,
  CRASHDMP_EVENT_HIBERNATE_BEGIN = 3,
  CRASHDMP_EVENT_HIBERNATE_END = 4,
} CRASHDMP_EVENTS, *PCRASHDMP_EVENTS;

typedef enum _MANDATORY_LEVEL
{
  MandatoryLevelUntrusted = 0,
  MandatoryLevelLow = 1,
  MandatoryLevelMedium = 2,
  MandatoryLevelHigh = 3,
  MandatoryLevelSystem = 4,
  MandatoryLevelSecureProcess = 5,
  MandatoryLevelCount = 6,
} MANDATORY_LEVEL, *PMANDATORY_LEVEL;

typedef enum _LOCK_OPERATION
{
  IoReadAccess = 0,
  IoWriteAccess = 1,
  IoModifyAccess = 2,
} LOCK_OPERATION, *PLOCK_OPERATION;

typedef enum _RM_COMMAND_NUMBER
{
  RmDummyCommand = 0,
  RmAuditSetCommand = 1,
  RmCreateLogonSession = 2,
  RmDeleteLogonSession = 3,
  RmAddLogonSessionInfo = 4,
  RmGlobalSaclSetCommand = 5,
  RmMaxCommand = 6,
} RM_COMMAND_NUMBER, *PRM_COMMAND_NUMBER;

typedef enum _LSA_SID_NAME_MAPPING_OPERATION_ERROR
{
  LsaSidNameMappingOperation_Success = 0,
  LsaSidNameMappingOperation_NonMappingError = 1,
  LsaSidNameMappingOperation_NameCollision = 2,
  LsaSidNameMappingOperation_SidCollision = 3,
  LsaSidNameMappingOperation_DomainNotFound = 4,
  LsaSidNameMappingOperation_DomainSidPrefixMismatch = 5,
  LsaSidNameMappingOperation_MappingNotFound = 6,
} LSA_SID_NAME_MAPPING_OPERATION_ERROR, *PLSA_SID_NAME_MAPPING_OPERATION_ERROR;

typedef enum _POLICY_AUDIT_EVENT_TYPE
{
  AuditCategorySystem = 0,
  AuditCategoryLogon = 1,
  AuditCategoryObjectAccess = 2,
  AuditCategoryPrivilegeUse = 3,
  AuditCategoryDetailedTracking = 4,
  AuditCategoryPolicyChange = 5,
  AuditCategoryAccountManagement = 6,
  AuditCategoryDirectoryServiceAccess = 7,
  AuditCategoryAccountLogon = 8,
} POLICY_AUDIT_EVENT_TYPE, *PPOLICY_AUDIT_EVENT_TYPE;

typedef enum _TP_DEBUG_CLASS
{
  TP_DEBUG_CLASS_POOL = 0,
} TP_DEBUG_CLASS, *PTP_DEBUG_CLASS;

typedef enum _KRESOURCEMANAGER_STATE
{
  KResourceManagerUninitialized = 0,
  KResourceManagerOffline = 1,
  KResourceManagerOnline = 2,
} KRESOURCEMANAGER_STATE, *PKRESOURCEMANAGER_STATE;

typedef enum _UMS_THREAD_STATE
{
  UmsThreadNoStateTransition = 0,
  UmsThreadSuspendedState = 1,
  UmsThreadTerminatedState = 2,
  UmsThreadResumedState = 3,
  UmsThreadMaximumState = 4,
} UMS_THREAD_STATE, *PUMS_THREAD_STATE;

typedef enum _DEVICE_REMOVAL_POLICY
{
  RemovalPolicyNotDetermined = 0,
  RemovalPolicyExpectNoRemoval = 1,
  RemovalPolicyExpectOrderlyRemoval = 2,
  RemovalPolicyExpectSurpriseRemoval = 3,
  RemovalPolicySuggestOrderlyRemoval = 4,
  RemovalPolicySuggestSurpriseRemoval = 5,
  RemovalPolicyUnspecified = 6,
} DEVICE_REMOVAL_POLICY, *PDEVICE_REMOVAL_POLICY;

typedef enum _KOBJECTS
{
  EventNotificationObject = 0,
  EventSynchronizationObject = 1,
  MutantObject = 2,
  ProcessObject = 3,
  QueueObject = 4,
  SemaphoreObject = 5,
  ThreadObject = 6,
  GateObject = 7,
  TimerNotificationObject = 8,
  TimerSynchronizationObject = 9,
  Spare2Object = 10,
  Spare3Object = 11,
  Spare4Object = 12,
  Spare5Object = 13,
  Spare6Object = 14,
  Spare7Object = 15,
  Spare8Object = 16,
  Spare9Object = 17,
  ApcObject = 18,
  DpcObject = 19,
  DeviceQueueObject = 20,
  EventPairObject = 21,
  InterruptObject = 22,
  ProfileObject = 23,
  ThreadedDpcObject = 24,
  MaximumKernelObject = 25,
} KOBJECTS, *PKOBJECTS;

typedef enum _CRASHDUMP_CONFIGURATION
{
  CrashDumpDisable = 0,
  CrashDumpReconfigure = 1,
} CRASHDUMP_CONFIGURATION, *PCRASHDUMP_CONFIGURATION;

typedef enum _LSA_COMMAND_NUMBER
{
  LsapDummyCommand = 0,
  LsapWriteAuditMessageCommand = 1,
  LsapComponentTestCommand = 2,
  LsapLogonSessionDeletedCommand = 3,
} LSA_COMMAND_NUMBER, *PLSA_COMMAND_NUMBER;

typedef enum _KTBFLUSH_TYPE
{
  FlushKernel = 0,
  FlushUser = 1,
  FlushSession = 2,
  FlushEntire = 3,
} KTBFLUSH_TYPE, *PKTBFLUSH_TYPE;

typedef struct _LSA_SID_NAME_MAPPING_OPERATION_GENERIC_OUTPUT
{
  /* 0x0000 */ enum _LSA_SID_NAME_MAPPING_OPERATION_ERROR ErrorCode;
} LSA_SID_NAME_MAPPING_OPERATION_GENERIC_OUTPUT, *PLSA_SID_NAME_MAPPING_OPERATION_GENERIC_OUTPUT; /* size: 0x0004 */

typedef union _LSA_SID_NAME_MAPPING_OPERATION_OUTPUT
{
  union
  {
    /* 0x0000 */ struct _LSA_SID_NAME_MAPPING_OPERATION_GENERIC_OUTPUT AddOutput;
    /* 0x0000 */ struct _LSA_SID_NAME_MAPPING_OPERATION_GENERIC_OUTPUT RemoveOutput;
    /* 0x0000 */ struct _LSA_SID_NAME_MAPPING_OPERATION_GENERIC_OUTPUT AddMultipleOutput;
  }; /* size: 0x0004 */
} LSA_SID_NAME_MAPPING_OPERATION_OUTPUT, *PLSA_SID_NAME_MAPPING_OPERATION_OUTPUT; /* size: 0x0004 */

enum POWER_PLATFORM_ROLE
{
  PlatformRoleUnspecified = 0,
  PlatformRoleDesktop = 1,
  PlatformRoleMobile = 2,
  PlatformRoleWorkstation = 3,
  PlatformRoleEnterpriseServer = 4,
  PlatformRoleSOHOServer = 5,
  PlatformRoleAppliancePC = 6,
  PlatformRolePerformanceServer = 7,
  PlatformRoleMaximum = 8,
};

typedef struct _KQUEUE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ struct _LIST_ENTRY EntryListHead;
  /* 0x0028 */ volatile unsigned long CurrentCount;
  /* 0x002c */ unsigned long MaximumCount;
  /* 0x0030 */ struct _LIST_ENTRY ThreadListHead;
} KQUEUE, *PKQUEUE; /* size: 0x0040 */

union EX_QUEUE_WORKER_INFO
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long QueueDisabled : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long MakeThreadsAsNecessary : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long WaitMode : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long WorkerCount : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ long QueueWorkerInfo;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

typedef struct _EX_WORK_QUEUE
{
  /* 0x0000 */ struct _KQUEUE WorkerQueue;
  /* 0x0040 */ unsigned long DynamicThreadCount;
  /* 0x0044 */ unsigned long WorkItemsProcessed;
  /* 0x0048 */ unsigned long WorkItemsProcessedLastPass;
  /* 0x004c */ unsigned long QueueDepthLastPass;
  /* 0x0050 */ union EX_QUEUE_WORKER_INFO Info;
  /* 0x0054 */ long __PADDING__[1];
} EX_WORK_QUEUE, *PEX_WORK_QUEUE; /* size: 0x0058 */

typedef enum _HEAP_INFORMATION_CLASS
{
  HeapCompatibilityInformation = 0,
  HeapEnableTerminationOnCorruption = 1,
  HeapExtendedInformation = 2,
  HeapDetailedFailureInformation = -2147483647,
  HeapSetDebuggingInformation = -2147483646,
} HEAP_INFORMATION_CLASS, *PHEAP_INFORMATION_CLASS;

typedef struct _EVENT_INSTANCE_HEADER
{
  /* 0x0000 */ unsigned short Size;
  union
  {
    /* 0x0002 */ unsigned short FieldTypeFlags;
    struct
    {
      /* 0x0002 */ unsigned char HeaderType;
      /* 0x0003 */ unsigned char MarkerFlags;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  union
  {
    /* 0x0004 */ unsigned long Version;
    struct
    {
      /* 0x0004 */ unsigned char Type;
      /* 0x0005 */ unsigned char Level;
      /* 0x0006 */ unsigned short Version;
    } /* size: 0x0004 */ Class;
  }; /* size: 0x0004 */
  /* 0x0008 */ unsigned long ThreadId;
  /* 0x000c */ unsigned long ProcessId;
  /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0018 */ unsigned __int64 RegHandle;
  /* 0x0020 */ unsigned long InstanceId;
  /* 0x0024 */ unsigned long ParentInstanceId;
  union
  {
    struct
    {
      /* 0x0028 */ unsigned long KernelTime;
      /* 0x002c */ unsigned long UserTime;
    }; /* size: 0x0008 */
    /* 0x0028 */ unsigned __int64 ProcessorTime;
    struct
    {
      /* 0x0028 */ unsigned long EventId;
      /* 0x002c */ unsigned long Flags;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  /* 0x0030 */ unsigned __int64 ParentRegHandle;
} EVENT_INSTANCE_HEADER, *PEVENT_INSTANCE_HEADER; /* size: 0x0038 */

typedef enum _IA64_FUNCTION_TABLE_TYPE
{
  IA64_RF_SORTED = 0,
  IA64_RF_UNSORTED = 1,
  IA64_RF_CALLBACK = 2,
} IA64_FUNCTION_TABLE_TYPE, *PIA64_FUNCTION_TABLE_TYPE;

typedef enum _SEP_ACL_TYPE
{
  SepAclTypeDacl = 1,
  SepAclTypeSacl = 2,
  SepAclTypeMacl = 3,
} SEP_ACL_TYPE, *PSEP_ACL_TYPE;

typedef struct _ETW_UMS_EVENT_PARK
{
  /* 0x0000 */ unsigned long ProcessId;
  /* 0x0004 */ unsigned long ScheduledThreadId;
  /* 0x0008 */ unsigned long ParkFlags;
} ETW_UMS_EVENT_PARK, *PETW_UMS_EVENT_PARK; /* size: 0x000c */

enum PCI_EXPRESS_POWER_STATE
{
  PowerOn = 0,
  PowerOff = 1,
};

typedef enum _EX_HOST_CALLBACK_REASON
{
  ExHostCallbackPreBind = 0,
  ExHostCallbackPostBind = 1,
  ExHostCallbackPreUnbind = 2,
  ExHostCallbackPostUnbind = 3,
  ExHostCallbackMax = 4,
} EX_HOST_CALLBACK_REASON, *PEX_HOST_CALLBACK_REASON;

enum ST_STORE<SM_TRAITS>::_ST_LAZY_WORK_TYPE
{
  StLazyWorkCompaction = 1,
  StLazyWorkUnpersistRestore = 2,
  StLazyWorkEtaRefresh = 3,
  StLazyWorkTypeMax = 4,
};

struct ST_STORE<SM_TRAITS>::_ST_LAZY_WORK
{
  /* 0x0000 */ enum ST_STORE<SM_TRAITS>::_ST_LAZY_WORK_TYPE Type;
}; /* size: 0x0004 */

enum IMPORT_OBJECT_NAME_TYPE
{
  IMPORT_OBJECT_ORDINAL = 0,
  IMPORT_OBJECT_NAME = 1,
  IMPORT_OBJECT_NAME_NO_PREFIX = 2,
  IMPORT_OBJECT_NAME_UNDECORATE = 3,
};

typedef enum _HV_HYPERVISOR_INTERFACE
{
  HvMicrosoftHypervisorInterface = 0x31237648,
} HV_HYPERVISOR_INTERFACE, *PHV_HYPERVISOR_INTERFACE;

typedef struct _RTL_SPLAY_LINKS
{
  /* 0x0000 */ struct _RTL_SPLAY_LINKS* Parent;
  /* 0x0008 */ struct _RTL_SPLAY_LINKS* LeftChild;
  /* 0x0010 */ struct _RTL_SPLAY_LINKS* RightChild;
} RTL_SPLAY_LINKS, *PRTL_SPLAY_LINKS; /* size: 0x0018 */

typedef enum _INTERLOCKED_RESULT
{
  ResultNegative = 1,
  ResultZero = 0,
  ResultPositive = 2,
} INTERLOCKED_RESULT, *PINTERLOCKED_RESULT;

typedef enum _ACTIVATION_CONTEXT_INFO_CLASS
{
  ActivationContextBasicInformation = 1,
  ActivationContextDetailedInformation = 2,
  AssemblyDetailedInformationInActivationContext = 3,
  FileInformationInAssemblyOfAssemblyInActivationContext = 4,
  RunlevelInformationInActivationContext = 5,
  CompatibilityInformationInActivationContext = 6,
  ActivationContextManifestResourceName = 7,
  MaxActivationContextInfoClass = 8,
  AssemblyDetailedInformationInActivationContxt = 3,
  FileInformationInAssemblyOfAssemblyInActivationContxt = 4,
} ACTIVATION_CONTEXT_INFO_CLASS, *PACTIVATION_CONTEXT_INFO_CLASS;

typedef enum _TOKEN_ELEVATION_TYPE
{
  TokenElevationTypeDefault = 1,
  TokenElevationTypeFull = 2,
  TokenElevationTypeLimited = 3,
} TOKEN_ELEVATION_TYPE, *PTOKEN_ELEVATION_TYPE;

typedef enum _MMLISTS
{
  ZeroedPageList = 0,
  FreePageList = 1,
  StandbyPageList = 2,
  ModifiedPageList = 3,
  ModifiedNoWritePageList = 4,
  BadPageList = 5,
  ActiveAndValid = 6,
  TransitionPage = 7,
} MMLISTS, *PMMLISTS;

typedef enum _STORAGE_IDENTIFIER_CODE_SET
{
  StorageIdCodeSetReserved = 0,
  StorageIdCodeSetBinary = 1,
  StorageIdCodeSetAscii = 2,
  StorageIdCodeSetUtf8 = 3,
} STORAGE_IDENTIFIER_CODE_SET, *PSTORAGE_IDENTIFIER_CODE_SET;

typedef enum _TP_CALLBACK_PRIORITY
{
  TP_CALLBACK_PRIORITY_HIGH = 0,
  TP_CALLBACK_PRIORITY_NORMAL = 1,
  TP_CALLBACK_PRIORITY_LOW = 2,
  TP_CALLBACK_PRIORITY_INVALID = 3,
} TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2,
} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

enum ACTCTX_REQUESTED_RUN_LEVEL
{
  ACTCTX_RUN_LEVEL_UNSPECIFIED = 0,
  ACTCTX_RUN_LEVEL_AS_INVOKER = 1,
  ACTCTX_RUN_LEVEL_HIGHEST_AVAILABLE = 2,
  ACTCTX_RUN_LEVEL_REQUIRE_ADMIN = 3,
  ACTCTX_RUN_LEVEL_NUMBERS = 4,
};

typedef enum _MEMORY_RESERVE_TYPE
{
  MemoryReserveUserApc = 0,
  MemoryReserveIoCompletion = 1,
  MemoryReserveTypeMax = 2,
} MEMORY_RESERVE_TYPE, *PMEMORY_RESERVE_TYPE;

typedef struct _LPCP_MESSAGE
{
  union
  {
    /* 0x0000 */ struct _LIST_ENTRY Entry;
    struct
    {
      /* 0x0000 */ struct _SINGLE_LIST_ENTRY FreeEntry;
      /* 0x0008 */ unsigned long Reserved0;
    }; /* size: 0x000c */
  }; /* size: 0x0010 */
  /* 0x0010 */ void* SenderPort;
  /* 0x0018 */ struct _ETHREAD* RepliedToThread;
  /* 0x0020 */ void* PortContext;
  /* 0x0028 */ struct _PORT_MESSAGE Request;
} LPCP_MESSAGE, *PLPCP_MESSAGE; /* size: 0x0050 */

typedef enum _MONITOR_DISPLAY_STATE
{
  PowerMonitorOff = 0,
  PowerMonitorOn = 1,
  PowerMonitorDim = 2,
} MONITOR_DISPLAY_STATE, *PMONITOR_DISPLAY_STATE;

typedef enum _WOW64_FUNCTION_CODE64
{
  WOW64_FUNCTION_NOP = 0,
  WOW64_FUNCTION_QUERY_PROCESS_DEBUG_INFO = 1,
  WOW64_FUNCTION_MAXIMUM = 2,
} WOW64_FUNCTION_CODE64, *PWOW64_FUNCTION_CODE64;

typedef enum _CM_SERVICE_NODE_TYPE
{
  DriverType = 1,
  FileSystemType = 2,
  Win32ServiceOwnProcess = 16,
  Win32ServiceShareProcess = 32,
  AdapterType = 4,
  RecognizerType = 8,
} CM_SERVICE_NODE_TYPE, *PCM_SERVICE_NODE_TYPE;

typedef struct _KDPC_DATA
{
  /* 0x0000 */ struct _LIST_ENTRY DpcListHead;
  /* 0x0010 */ unsigned __int64 DpcLock;
  /* 0x0018 */ volatile long DpcQueueDepth;
  /* 0x001c */ unsigned long DpcCount;
} KDPC_DATA, *PKDPC_DATA; /* size: 0x0020 */

enum ETWTRACECONTROLCODE
{
  EtwStartLoggerCode = 1,
  EtwStopLoggerCode = 2,
  EtwQueryLoggerCode = 3,
  EtwUpdateLoggerCode = 4,
  EtwFlushLoggerCode = 5,
  EtwActivityIdCreate = 12,
  EtwWdiScenarioCode = 13,
  EtwWdiSemUpdate = 20,
};

typedef enum _STORAGE_MEDIA_TYPE
{
  DDS_4mm = 32,
  MiniQic = 33,
  Travan = 34,
  QIC = 35,
  MP_8mm = 36,
  AME_8mm = 37,
  AIT1_8mm = 38,
  DLT = 39,
  NCTP = 40,
  IBM_3480 = 41,
  IBM_3490E = 42,
  IBM_Magstar_3590 = 43,
  IBM_Magstar_MP = 44,
  STK_DATA_D3 = 45,
  SONY_DTF = 46,
  DV_6mm = 47,
  DMI = 48,
  SONY_D2 = 49,
  CLEANER_CARTRIDGE = 50,
  CD_ROM = 51,
  CD_R = 52,
  CD_RW = 53,
  DVD_ROM = 54,
  DVD_R = 55,
  DVD_RW = 56,
  MO_3_RW = 57,
  MO_5_WO = 58,
  MO_5_RW = 59,
  MO_5_LIMDOW = 60,
  PC_5_WO = 61,
  PC_5_RW = 62,
  PD_5_RW = 63,
  ABL_5_WO = 64,
  PINNACLE_APEX_5_RW = 65,
  SONY_12_WO = 66,
  PHILIPS_12_WO = 67,
  HITACHI_12_WO = 68,
  CYGNET_12_WO = 69,
  KODAK_14_WO = 70,
  MO_NFR_525 = 71,
  NIKON_12_RW = 72,
  IOMEGA_ZIP = 73,
  IOMEGA_JAZ = 74,
  SYQUEST_EZ135 = 75,
  SYQUEST_EZFLYER = 76,
  SYQUEST_SYJET = 77,
  AVATAR_F2 = 78,
  MP2_8mm = 79,
  DST_S = 80,
  DST_M = 81,
  DST_L = 82,
  VXATape_1 = 83,
  VXATape_2 = 84,
  STK_9840 = 85,
  LTO_Ultrium = 86,
  LTO_Accelis = 87,
  DVD_RAM = 88,
  AIT_8mm = 89,
  ADR_1 = 90,
  ADR_2 = 91,
  STK_9940 = 92,
  SAIT = 93,
  VXATape = 94,
} STORAGE_MEDIA_TYPE, *PSTORAGE_MEDIA_TYPE;

typedef enum _HV_CPU_COUNTER
{
  StLpCounterGlobalTime = 1,
  StLpCounterTotalRunTime = 2,
  StLpCounterHypervisorRunTime = 3,
} HV_CPU_COUNTER, *PHV_CPU_COUNTER;

typedef enum _PHYSICAL_COUNTER_RESOURCE_DESCRIPTOR_TYPE
{
  ResourceTypeSingle = 0,
  ResourceTypeRange = 1,
  ResourceTypeExtendedCounterConfiguration = 2,
  ResourceTypeOverflow = 3,
  ResourceTypeMax = 4,
} PHYSICAL_COUNTER_RESOURCE_DESCRIPTOR_TYPE, *PPHYSICAL_COUNTER_RESOURCE_DESCRIPTOR_TYPE;

typedef enum _IOP_PRIORITY_HINT
{
  IopIoPriorityNotSet = 0,
  IopIoPriorityVeryLow = 1,
  IopIoPriorityLow = 2,
  IopIoPriorityNormal = 3,
  IopIoPriorityHigh = 4,
  IopIoPriorityCritical = 5,
  MaxIopIoPriorityTypes = 6,
} IOP_PRIORITY_HINT, *PIOP_PRIORITY_HINT;

typedef enum _ALPC_MESSAGE_INFORMATION_CLASS
{
  AlpcMessageSidInformation = 0,
  AlpcMessageTokenModifiedIdInformation = 1,
} ALPC_MESSAGE_INFORMATION_CLASS, *PALPC_MESSAGE_INFORMATION_CLASS;

typedef enum _IO_ACCESS_TYPE
{
  ReadAccess = 0,
  WriteAccess = 1,
  ModifyAccess = 2,
} IO_ACCESS_TYPE, *PIO_ACCESS_TYPE;

typedef enum _STORAGE_IDENTIFIER_TYPE
{
  StorageIdTypeVendorSpecific = 0,
  StorageIdTypeVendorId = 1,
  StorageIdTypeEUI64 = 2,
  StorageIdTypeFCPHName = 3,
  StorageIdTypePortRelative = 4,
  StorageIdTypeTargetPortGroup = 5,
  StorageIdTypeLogicalUnitGroup = 6,
  StorageIdTypeMD5LogicalUnitIdentifier = 7,
  StorageIdTypeScsiNameString = 8,
} STORAGE_IDENTIFIER_TYPE, *PSTORAGE_IDENTIFIER_TYPE;

typedef struct _PROCESSOR_IDLE_STATE
{
  /* 0x0000 */ unsigned char StateType;
  /* 0x0001 */ char Padding_108[3];
  /* 0x0004 */ unsigned long StateFlags;
  /* 0x0008 */ unsigned long HardwareLatency;
  /* 0x000c */ unsigned long Power;
  /* 0x0010 */ unsigned __int64 Context;
  /* 0x0018 */ void* Handler /* function */;
} PROCESSOR_IDLE_STATE, *PPROCESSOR_IDLE_STATE; /* size: 0x0020 */

typedef struct _PROCESSOR_IDLE_STATES
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Revision;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ unsigned long Type;
  /* 0x0010 */ unsigned __int64 TargetProcessors;
  /* 0x0018 */ struct _PROCESSOR_IDLE_STATE State[1];
} PROCESSOR_IDLE_STATES, *PPROCESSOR_IDLE_STATES; /* size: 0x0038 */

typedef enum _TIMER_INFORMATION_CLASS
{
  TimerBasicInformation = 0,
} TIMER_INFORMATION_CLASS, *PTIMER_INFORMATION_CLASS;

typedef enum _REG_ACTION
{
  KeyAdded = 0,
  KeyRemoved = 1,
  KeyModified = 2,
} REG_ACTION, *PREG_ACTION;

typedef enum _STORAGE_PORT_CODE_SET
{
  StoragePortCodeSetReserved = 0,
  StoragePortCodeSetStorport = 1,
  StoragePortCodeSetSCSIport = 2,
} STORAGE_PORT_CODE_SET, *PSTORAGE_PORT_CODE_SET;

typedef struct _MMVAD_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 CommitCharge : 51; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 NoChange : 1; /* bit position: 51 */
    /* 0x0000 */ unsigned __int64 VadType : 3; /* bit position: 52 */
    /* 0x0000 */ unsigned __int64 MemCommit : 1; /* bit position: 55 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 56 */
    /* 0x0000 */ unsigned __int64 Spare : 2; /* bit position: 61 */
    /* 0x0000 */ unsigned __int64 PrivateMemory : 1; /* bit position: 63 */
  }; /* bitfield */
} MMVAD_FLAGS, *PMMVAD_FLAGS; /* size: 0x0008 */

typedef struct _MMVAD_FLAGS3
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 PreferredNode : 6; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Teb : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned __int64 Spare : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned __int64 SequentialAccess : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned __int64 LastSequentialTrim : 15; /* bit position: 9 */
    /* 0x0000 */ unsigned __int64 Spare2 : 8; /* bit position: 24 */
    /* 0x0000 */ unsigned __int64 LargePageCreating : 1; /* bit position: 32 */
    /* 0x0000 */ unsigned __int64 Spare3 : 31; /* bit position: 33 */
  }; /* bitfield */
} MMVAD_FLAGS3, *PMMVAD_FLAGS3; /* size: 0x0008 */

typedef struct _MMVAD_FLAGS2
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned int FileOffset : 24; /* bit position: 0 */
    /* 0x0000 */ unsigned int SecNoChange : 1; /* bit position: 24 */
    /* 0x0000 */ unsigned int OneSecured : 1; /* bit position: 25 */
    /* 0x0000 */ unsigned int MultipleSecured : 1; /* bit position: 26 */
    /* 0x0000 */ unsigned int Spare : 1; /* bit position: 27 */
    /* 0x0000 */ unsigned int LongVad : 1; /* bit position: 28 */
    /* 0x0000 */ unsigned int ExtendableFile : 1; /* bit position: 29 */
    /* 0x0000 */ unsigned int Inherit : 1; /* bit position: 30 */
    /* 0x0000 */ unsigned int CopyOnWrite : 1; /* bit position: 31 */
  }; /* bitfield */
} MMVAD_FLAGS2, *PMMVAD_FLAGS2; /* size: 0x0004 */

typedef struct _MMSECURE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long ReadOnly : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long NoWrite : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Spare : 10; /* bit position: 2 */
  }; /* bitfield */
} MMSECURE_FLAGS, *PMMSECURE_FLAGS; /* size: 0x0004 */

typedef struct _MMADDRESS_LIST
{
  union
  {
    union
    {
      /* 0x0000 */ struct _MMSECURE_FLAGS Flags;
      /* 0x0000 */ void* StartVa;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u1;
  /* 0x0008 */ void* EndVa;
} MMADDRESS_LIST, *PMMADDRESS_LIST; /* size: 0x0010 */

typedef struct _MMVAD_LONG
{
  union
  {
    union
    {
      /* 0x0000 */ __int64 Balance : 2; /* bit position: 0 */
      /* 0x0000 */ struct _MMVAD* Parent;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u1;
  /* 0x0008 */ struct _MMVAD* LeftChild;
  /* 0x0010 */ struct _MMVAD* RightChild;
  /* 0x0018 */ unsigned __int64 StartingVpn;
  /* 0x0020 */ unsigned __int64 EndingVpn;
  union
  {
    union
    {
      /* 0x0028 */ unsigned __int64 LongFlags;
      /* 0x0028 */ struct _MMVAD_FLAGS VadFlags;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u;
  /* 0x0030 */ struct _EX_PUSH_LOCK PushLock;
  union
  {
    union
    {
      /* 0x0038 */ unsigned __int64 LongFlags3;
      /* 0x0038 */ struct _MMVAD_FLAGS3 VadFlags3;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u5;
  union
  {
    union
    {
      /* 0x0040 */ unsigned long LongFlags2;
      /* 0x0040 */ struct _MMVAD_FLAGS2 VadFlags2;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u2;
  /* 0x0044 */ long Padding_109;
  /* 0x0048 */ struct _SUBSECTION* Subsection;
  /* 0x0050 */ struct _MMPTE* FirstPrototypePte;
  /* 0x0058 */ struct _MMPTE* LastContiguousPte;
  /* 0x0060 */ struct _LIST_ENTRY ViewLinks;
  /* 0x0070 */ struct _EPROCESS* VadsProcess;
  union
  {
    union
    {
      /* 0x0078 */ struct _LIST_ENTRY List;
      /* 0x0078 */ struct _MMADDRESS_LIST Secured;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ u3;
  union
  {
    union
    {
      /* 0x0088 */ struct _MMBANKED_SECTION* Banked;
      /* 0x0088 */ struct _MMEXTEND_INFO* ExtendedInfo;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u4;
} MMVAD_LONG, *PMMVAD_LONG; /* size: 0x0090 */

typedef struct _PROC_PERF_DOMAIN
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0010 */ struct _KPRCB* Master;
  /* 0x0018 */ struct _KAFFINITY_EX Members;
  /* 0x0040 */ void* FeedbackHandler /* function */;
  /* 0x0048 */ void* GetFFHThrottleState /* function */;
  /* 0x0050 */ void* BoostPolicyHandler /* function */;
  /* 0x0058 */ void* PerfSelectionHandler /* function */;
  /* 0x0060 */ void* PerfHandler /* function */;
  /* 0x0068 */ struct _PROC_PERF_CONSTRAINT* Processors;
  /* 0x0070 */ unsigned __int64 PerfChangeTime;
  /* 0x0078 */ unsigned long ProcessorCount;
  /* 0x007c */ unsigned long PreviousFrequencyMhz;
  /* 0x0080 */ unsigned long CurrentFrequencyMhz;
  /* 0x0084 */ unsigned long PreviousFrequency;
  /* 0x0088 */ unsigned long CurrentFrequency;
  /* 0x008c */ unsigned long CurrentPerfContext;
  /* 0x0090 */ unsigned long DesiredFrequency;
  /* 0x0094 */ unsigned long MaxFrequency;
  /* 0x0098 */ unsigned long MinPerfPercent;
  /* 0x009c */ unsigned long MinThrottlePercent;
  /* 0x00a0 */ unsigned long MaxPercent;
  /* 0x00a4 */ unsigned long MinPercent;
  /* 0x00a8 */ unsigned long ConstrainedMaxPercent;
  /* 0x00ac */ unsigned long ConstrainedMinPercent;
  /* 0x00b0 */ unsigned char Coordination;
  /* 0x00b1 */ char Padding_110[3];
  /* 0x00b4 */ volatile long PerfChangeIntervalCount;
} PROC_PERF_DOMAIN, *PPROC_PERF_DOMAIN; /* size: 0x00b8 */

typedef enum _ARBITER_RESULT
{
  ArbiterResultUndefined = -1,
  ArbiterResultSuccess = 0,
  ArbiterResultExternalConflict = 1,
  ArbiterResultNullRequest = 2,
} ARBITER_RESULT, *PARBITER_RESULT;

typedef union _KWAIT_STATUS_REGISTER
{
  union
  {
    /* 0x0000 */ unsigned char Flags;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char State : 2; /* bit position: 0 */
      /* 0x0000 */ unsigned char Affinity : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned char Priority : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned char Apc : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned char UserApc : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned char Alert : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned char Unused : 1; /* bit position: 7 */
    }; /* bitfield */
  }; /* size: 0x0001 */
} KWAIT_STATUS_REGISTER, *PKWAIT_STATUS_REGISTER; /* size: 0x0001 */

typedef struct _KAPC_STATE
{
  /* 0x0000 */ struct _LIST_ENTRY ApcListHead[2];
  /* 0x0020 */ struct _KPROCESS* Process;
  /* 0x0028 */ unsigned char KernelApcInProgress;
  /* 0x0029 */ unsigned char KernelApcPending;
  /* 0x002a */ unsigned char UserApcPending;
  /* 0x002b */ char __PADDING__[5];
} KAPC_STATE, *PKAPC_STATE; /* size: 0x0030 */

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ union _ULARGE_INTEGER DueTime;
  /* 0x0020 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0030 */ struct _KDPC* Dpc;
  /* 0x0038 */ unsigned long Processor;
  /* 0x003c */ unsigned long Period;
} KTIMER, *PKTIMER; /* size: 0x0040 */

typedef struct _KWAIT_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY WaitListEntry;
  /* 0x0010 */ struct _KTHREAD* Thread;
  /* 0x0018 */ void* Object;
  /* 0x0020 */ struct _KWAIT_BLOCK* NextWaitBlock;
  /* 0x0028 */ unsigned short WaitKey;
  /* 0x002a */ unsigned char WaitType;
  /* 0x002b */ volatile unsigned char BlockState;
  /* 0x002c */ long SpareLong;
} KWAIT_BLOCK, *PKWAIT_BLOCK; /* size: 0x0030 */

typedef struct _KSEMAPHORE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ long Limit;
  /* 0x001c */ long __PADDING__[1];
} KSEMAPHORE, *PKSEMAPHORE; /* size: 0x0020 */

typedef struct _KTHREAD
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ volatile unsigned __int64 CycleTime;
  /* 0x0020 */ unsigned __int64 QuantumTarget;
  /* 0x0028 */ void* InitialStack;
  /* 0x0030 */ void* volatile StackLimit;
  /* 0x0038 */ void* KernelStack;
  /* 0x0040 */ unsigned __int64 ThreadLock;
  /* 0x0048 */ union _KWAIT_STATUS_REGISTER WaitRegister;
  /* 0x0049 */ volatile unsigned char Running;
  /* 0x004a */ unsigned char Alerted[2];
  union
  {
    struct /* bitfield */
    {
      /* 0x004c */ unsigned long KernelStackResident : 1; /* bit position: 0 */
      /* 0x004c */ unsigned long ReadyTransition : 1; /* bit position: 1 */
      /* 0x004c */ unsigned long ProcessReadyQueue : 1; /* bit position: 2 */
      /* 0x004c */ unsigned long WaitNext : 1; /* bit position: 3 */
      /* 0x004c */ unsigned long SystemAffinityActive : 1; /* bit position: 4 */
      /* 0x004c */ unsigned long Alertable : 1; /* bit position: 5 */
      /* 0x004c */ unsigned long GdiFlushActive : 1; /* bit position: 6 */
      /* 0x004c */ unsigned long UserStackWalkActive : 1; /* bit position: 7 */
      /* 0x004c */ unsigned long ApcInterruptRequest : 1; /* bit position: 8 */
      /* 0x004c */ unsigned long ForceDeferSchedule : 1; /* bit position: 9 */
      /* 0x004c */ unsigned long QuantumEndMigrate : 1; /* bit position: 10 */
      /* 0x004c */ unsigned long UmsDirectedSwitchEnable : 1; /* bit position: 11 */
      /* 0x004c */ unsigned long TimerActive : 1; /* bit position: 12 */
      /* 0x004c */ unsigned long Reserved : 19; /* bit position: 13 */
    }; /* bitfield */
    /* 0x004c */ long MiscFlags;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0050 */ struct _KAPC_STATE ApcState;
    struct
    {
      /* 0x0050 */ unsigned char ApcStateFill[43];
      /* 0x007b */ char Priority;
      /* 0x007c */ volatile unsigned long NextProcessor;
    }; /* size: 0x0030 */
  }; /* size: 0x0030 */
  /* 0x0080 */ volatile unsigned long DeferredProcessor;
  /* 0x0084 */ long Padding_111;
  /* 0x0088 */ unsigned __int64 ApcQueueLock;
  /* 0x0090 */ volatile __int64 WaitStatus;
  /* 0x0098 */ struct _KWAIT_BLOCK* WaitBlockList;
  union
  {
    /* 0x00a0 */ struct _LIST_ENTRY WaitListEntry;
    /* 0x00a0 */ struct _SINGLE_LIST_ENTRY SwapListEntry;
  }; /* size: 0x0010 */
  /* 0x00b0 */ struct _KQUEUE* volatile Queue;
  /* 0x00b8 */ void* Teb;
  /* 0x00c0 */ struct _KTIMER Timer;
  union
  {
    struct /* bitfield */
    {
      /* 0x0100 */ volatile unsigned long AutoAlignment : 1; /* bit position: 0 */
      /* 0x0100 */ volatile unsigned long DisableBoost : 1; /* bit position: 1 */
      /* 0x0100 */ volatile unsigned long EtwStackTraceApc1Inserted : 1; /* bit position: 2 */
      /* 0x0100 */ volatile unsigned long EtwStackTraceApc2Inserted : 1; /* bit position: 3 */
      /* 0x0100 */ volatile unsigned long CalloutActive : 1; /* bit position: 4 */
      /* 0x0100 */ volatile unsigned long ApcQueueable : 1; /* bit position: 5 */
      /* 0x0100 */ volatile unsigned long EnableStackSwap : 1; /* bit position: 6 */
      /* 0x0100 */ volatile unsigned long GuiThread : 1; /* bit position: 7 */
      /* 0x0100 */ volatile unsigned long UmsPerformingSyscall : 1; /* bit position: 8 */
      /* 0x0100 */ volatile unsigned long ReservedFlags : 23; /* bit position: 9 */
    }; /* bitfield */
    /* 0x0100 */ volatile long ThreadFlags;
  }; /* size: 0x0004 */
  /* 0x0104 */ unsigned long Spare0;
  union
  {
    /* 0x0108 */ struct _KWAIT_BLOCK WaitBlock[4];
    struct
    {
      /* 0x0108 */ unsigned char WaitBlockFill4[44];
      /* 0x0134 */ unsigned long ContextSwitches;
    }; /* size: 0x0030 */
    struct
    {
      /* 0x0108 */ unsigned char WaitBlockFill5[92];
      /* 0x0164 */ volatile unsigned char State;
      /* 0x0165 */ char NpxState;
      /* 0x0166 */ unsigned char WaitIrql;
      /* 0x0167 */ char WaitMode;
    }; /* size: 0x0060 */
    struct
    {
      /* 0x0108 */ unsigned char WaitBlockFill6[140];
      /* 0x0194 */ unsigned long WaitTime;
    }; /* size: 0x0090 */
    struct
    {
      /* 0x0108 */ unsigned char WaitBlockFill7[168];
      /* 0x01b0 */ void* TebMappedLowVa;
      /* 0x01b8 */ struct _UMS_CONTROL_BLOCK* Ucb;
    }; /* size: 0x00b8 */
    struct
    {
      /* 0x0108 */ unsigned char WaitBlockFill8[188];
      union
      {
        struct
        {
          /* 0x01c4 */ short KernelApcDisable;
          /* 0x01c6 */ short SpecialApcDisable;
        }; /* size: 0x0004 */
        /* 0x01c4 */ unsigned long CombinedApcDisable;
      }; /* size: 0x0004 */
    }; /* size: 0x00c0 */
  }; /* size: 0x00c0 */
  /* 0x01c8 */ struct _LIST_ENTRY QueueListEntry;
  /* 0x01d8 */ struct _KTRAP_FRAME* TrapFrame;
  /* 0x01e0 */ void* FirstArgument;
  union
  {
    /* 0x01e8 */ void* CallbackStack;
    /* 0x01e8 */ unsigned __int64 CallbackDepth;
  }; /* size: 0x0008 */
  /* 0x01f0 */ unsigned char ApcStateIndex;
  /* 0x01f1 */ char BasePriority;
  union
  {
    /* 0x01f2 */ char PriorityDecrement;
    struct /* bitfield */
    {
      /* 0x01f2 */ unsigned char ForegroundBoost : 4; /* bit position: 0 */
      /* 0x01f2 */ unsigned char UnusualBoost : 4; /* bit position: 4 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x01f3 */ unsigned char Preempted;
  /* 0x01f4 */ unsigned char AdjustReason;
  /* 0x01f5 */ char AdjustIncrement;
  /* 0x01f6 */ char PreviousMode;
  /* 0x01f7 */ char Saturation;
  /* 0x01f8 */ unsigned long SystemCallNumber;
  /* 0x01fc */ unsigned long FreezeCount;
  /* 0x0200 */ volatile struct _GROUP_AFFINITY UserAffinity;
  /* 0x0210 */ struct _KPROCESS* Process;
  /* 0x0218 */ volatile struct _GROUP_AFFINITY Affinity;
  /* 0x0228 */ unsigned long IdealProcessor;
  /* 0x022c */ unsigned long UserIdealProcessor;
  /* 0x0230 */ struct _KAPC_STATE* ApcStatePointer[2];
  union
  {
    /* 0x0240 */ struct _KAPC_STATE SavedApcState;
    struct
    {
      /* 0x0240 */ unsigned char SavedApcStateFill[43];
      /* 0x026b */ unsigned char WaitReason;
      /* 0x026c */ char SuspendCount;
      /* 0x026d */ char Spare1;
      /* 0x026e */ unsigned char CodePatchInProgress;
    }; /* size: 0x002f */
  }; /* size: 0x0030 */
  /* 0x0270 */ void* volatile Win32Thread;
  /* 0x0278 */ void* StackBase;
  union
  {
    /* 0x0280 */ struct _KAPC SuspendApc;
    struct
    {
      /* 0x0280 */ unsigned char SuspendApcFill0[1];
      /* 0x0281 */ unsigned char ResourceIndex;
    }; /* size: 0x0002 */
    struct
    {
      /* 0x0280 */ unsigned char SuspendApcFill1[3];
      /* 0x0283 */ unsigned char QuantumReset;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0280 */ unsigned char SuspendApcFill2[4];
      /* 0x0284 */ unsigned long KernelTime;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0280 */ unsigned char SuspendApcFill3[64];
      /* 0x02c0 */ struct _KPRCB* volatile WaitPrcb;
    }; /* size: 0x0048 */
    struct
    {
      /* 0x0280 */ unsigned char SuspendApcFill4[72];
      /* 0x02c8 */ void* LegoData;
    }; /* size: 0x0050 */
    struct
    {
      /* 0x0280 */ unsigned char SuspendApcFill5[83];
      /* 0x02d3 */ unsigned char LargeStack;
      /* 0x02d4 */ unsigned long UserTime;
    }; /* size: 0x0058 */
  }; /* size: 0x0058 */
  union
  {
    /* 0x02d8 */ struct _KSEMAPHORE SuspendSemaphore;
    struct
    {
      /* 0x02d8 */ unsigned char SuspendSemaphorefill[28];
      /* 0x02f4 */ unsigned long SListFaultCount;
    }; /* size: 0x0020 */
  }; /* size: 0x0020 */
  /* 0x02f8 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0308 */ struct _LIST_ENTRY MutantListHead;
  /* 0x0318 */ void* SListFaultAddress;
  /* 0x0320 */ __int64 ReadOperationCount;
  /* 0x0328 */ __int64 WriteOperationCount;
  /* 0x0330 */ __int64 OtherOperationCount;
  /* 0x0338 */ __int64 ReadTransferCount;
  /* 0x0340 */ __int64 WriteTransferCount;
  /* 0x0348 */ __int64 OtherTransferCount;
  /* 0x0350 */ struct _KTHREAD_COUNTERS* ThreadCounters;
  /* 0x0358 */ struct _XSTATE_SAVE* XStateSave;
} KTHREAD, *PKTHREAD; /* size: 0x0360 */

typedef enum _PNP_QUERY_RELATION
{
  PnpQueryEjectRelations = 0,
  PnpQueryRemovalRelations = 1,
  PnpQueryPowerRelations = 2,
  PnpQueryBusRelations = 3,
  PnpQueryTransportRelations = 4,
  MaxPnpQueryRelations = 5,
} PNP_QUERY_RELATION, *PPNP_QUERY_RELATION;

typedef enum _SID_NAME_USE
{
  SidTypeUser = 1,
  SidTypeGroup = 2,
  SidTypeDomain = 3,
  SidTypeAlias = 4,
  SidTypeWellKnownGroup = 5,
  SidTypeDeletedAccount = 6,
  SidTypeInvalid = 7,
  SidTypeUnknown = 8,
  SidTypeComputer = 9,
  SidTypeLabel = 10,
} SID_NAME_USE, *PSID_NAME_USE;

typedef enum _MM_SYSTEM_SIZE
{
  MmSmallSystem = 0,
  MmMediumSystem = 1,
  MmLargeSystem = 2,
} MM_SYSTEM_SIZE, *PMM_SYSTEM_SIZE;

typedef enum _HV_SERVICE_BRANCH
{
  HvServiceBranchGdr = 0,
  HvServiceBranchQfe = 1,
} HV_SERVICE_BRANCH, *PHV_SERVICE_BRANCH;

typedef enum _KAPC_ENVIRONMENT
{
  OriginalApcEnvironment = 0,
  AttachedApcEnvironment = 1,
  CurrentApcEnvironment = 2,
  InsertApcEnvironment = 3,
} KAPC_ENVIRONMENT, *PKAPC_ENVIRONMENT;

typedef enum _IO_SESSION_STATE
{
  IoSessionStateCreated = 1,
  IoSessionStateInitialized = 2,
  IoSessionStateConnected = 3,
  IoSessionStateDisconnected = 4,
  IoSessionStateDisconnectedLoggedOn = 5,
  IoSessionStateLoggedOn = 6,
  IoSessionStateLoggedOff = 7,
  IoSessionStateTerminated = 8,
  IoSessionStateMax = 9,
} IO_SESSION_STATE, *PIO_SESSION_STATE;

typedef enum _ACCESS_MASK_FORMAT
{
  AccessMask_Format_NewLine_Indent = 0,
  AccessMask_Format_NewLine = 1,
  AccessMask_Format_Colon_TAB = 2,
} ACCESS_MASK_FORMAT, *PACCESS_MASK_FORMAT;

typedef enum _HARDERROR_RESPONSE_OPTION
{
  OptionAbortRetryIgnore = 0,
  OptionOk = 1,
  OptionOkCancel = 2,
  OptionRetryCancel = 3,
  OptionYesNo = 4,
  OptionYesNoCancel = 5,
  OptionShutdownSystem = 6,
  OptionOkNoWait = 7,
  OptionCancelTryContinue = 8,
} HARDERROR_RESPONSE_OPTION, *PHARDERROR_RESPONSE_OPTION;

typedef enum _PS_RESOURCE_TYPE
{
  PsResourceNonPagedPool = 0,
  PsResourcePagedPool = 1,
  PsResourcePageFile = 2,
  PsResourceWorkingSet = 3,
  PsResourceCpuRate = 4,
  PsResourceMax = 5,
} PS_RESOURCE_TYPE, *PPS_RESOURCE_TYPE;

enum DEVICE_REGISTRY_PROPERTY
{
  DevicePropertyDeviceDescription = 0,
  DevicePropertyHardwareID = 1,
  DevicePropertyCompatibleIDs = 2,
  DevicePropertyBootConfiguration = 3,
  DevicePropertyBootConfigurationTranslated = 4,
  DevicePropertyClassName = 5,
  DevicePropertyClassGuid = 6,
  DevicePropertyDriverKeyName = 7,
  DevicePropertyManufacturer = 8,
  DevicePropertyFriendlyName = 9,
  DevicePropertyLocationInformation = 10,
  DevicePropertyPhysicalDeviceObjectName = 11,
  DevicePropertyBusTypeGuid = 12,
  DevicePropertyLegacyBusType = 13,
  DevicePropertyBusNumber = 14,
  DevicePropertyEnumeratorName = 15,
  DevicePropertyAddress = 16,
  DevicePropertyUINumber = 17,
  DevicePropertyInstallState = 18,
  DevicePropertyRemovalPolicy = 19,
  DevicePropertyResourceRequirements = 20,
  DevicePropertyAllocatedResources = 21,
  DevicePropertyContainerID = 22,
};

typedef enum _IRQ_GROUP_POLICY
{
  GroupAffinityAllGroupZero = 0,
  GroupAffinityDontCare = 1,
} IRQ_GROUP_POLICY, *PIRQ_GROUP_POLICY;

enum SA_AttrTarget
{
  SA_All = 0xffffffff,
  SA_Assembly = 1,
  SA_Class = 4,
  SA_Constructor = 32,
  SA_Delegate = 4096,
  SA_Enum = 16,
  SA_Event = 512,
  SA_Field = 256,
  SA_GenericParameter = 16384,
  SA_Interface = 1024,
  SA_Method = 64,
  SA_Module = 2,
  SA_Parameter = 2048,
  SA_Property = 128,
  SA_ReturnValue = 8192,
  SA_Struct = 8,
  SA_This = 0xffff8000,
};

typedef enum _KWAIT_REASON
{
  Executive = 0,
  FreePage = 1,
  PageIn = 2,
  PoolAllocation = 3,
  DelayExecution = 4,
  Suspended = 5,
  UserRequest = 6,
  WrExecutive = 7,
  WrFreePage = 8,
  WrPageIn = 9,
  WrPoolAllocation = 10,
  WrDelayExecution = 11,
  WrSuspended = 12,
  WrUserRequest = 13,
  WrEventPair = 14,
  WrQueue = 15,
  WrLpcReceive = 16,
  WrLpcReply = 17,
  WrVirtualMemory = 18,
  WrPageOut = 19,
  WrRendezvous = 20,
  WrKeyedEvent = 21,
  WrTerminated = 22,
  WrProcessInSwap = 23,
  WrCpuRateControl = 24,
  WrCalloutStack = 25,
  WrKernel = 26,
  WrResource = 27,
  WrPushLock = 28,
  WrMutex = 29,
  WrQuantumEnd = 30,
  WrDispatchInt = 31,
  WrPreempted = 32,
  WrYieldExecution = 33,
  WrFastMutex = 34,
  WrGuardedMutex = 35,
  WrRundown = 36,
  MaximumWaitReason = 37,
} KWAIT_REASON, *PKWAIT_REASON;

typedef enum _VF_ERROR_ID
{
  DCERROR_UNSPECIFIED = 512,
  DCERROR_DELETE_WHILE_ATTACHED = 513,
  DCERROR_DETACH_NOT_ATTACHED = 514,
  DCERROR_CANCELROUTINE_FORWARDED = 515,
  DCERROR_NULL_DEVOBJ_FORWARDED = 516,
  DCERROR_QUEUED_IRP_FORWARDED = 517,
  DCERROR_IRPSP_COPIED = 519,
  DCERROR_INSUFFICIENT_STACK_LOCATIONS = 520,
  DCERROR_QUEUED_IRP_COMPLETED = 521,
  DCERROR_FREE_OF_INUSE_IRP = 523,
  DCERROR_FREE_OF_THREADED_IRP = 524,
  DCERROR_REINIT_OF_ALLOCATED_IRP_WITH_QUOTA = 525,
  DCERROR_PNP_IRP_BAD_INITIAL_STATUS = 526,
  DCERROR_POWER_IRP_BAD_INITIAL_STATUS = 527,
  DCERROR_WMI_IRP_BAD_INITIAL_STATUS = 528,
  DCERROR_SKIPPED_DEVICE_OBJECT = 529,
  DCERROR_BOGUS_FUNC_TRASHED = 530,
  DCERROR_BOGUS_STATUS_TRASHED = 531,
  DCERROR_BOGUS_INFO_TRASHED = 532,
  DCERROR_PNP_FAILURE_FORWARDED = 533,
  DCERROR_PNP_IRP_STATUS_RESET = 534,
  DCERROR_PNP_IRP_NEEDS_HANDLING = 535,
  DCERROR_PNP_IRP_HANDS_OFF = 536,
  DCERROR_POWER_FAILURE_FORWARDED = 537,
  DCERROR_POWER_IRP_STATUS_RESET = 538,
  DCERROR_SHOULDVE_DETACHED = 541,
  DCERROR_MISSING_DISPATCH_FUNCTION = 543,
  DCERROR_WMI_IRP_NOT_FORWARDED = 544,
  DCERROR_DELETED_PRESENT_PDO = 545,
  DCERROR_BUS_FILTER_ERRONEOUSLY_DELETED = 547,
  DCERROR_INCONSISTANT_STATUS = 548,
  DCERROR_UNINITIALIZED_STATUS = 549,
  DCERROR_IRP_RETURNED_WITHOUT_COMPLETION = 550,
  DCERROR_COMPLETION_ROUTINE_PAGABLE = 551,
  DCERROR_PENDING_BIT_NOT_MIGRATED = 552,
  DCERROR_PNP_IRP_NEEDS_PDO_HANDLING = 554,
  DCERROR_TARGET_RELATION_LIST_EMPTY = 555,
  DCERROR_BOGUS_PNP_IRP_COMPLETED = 557,
  DCERROR_SUCCESSFUL_PNP_IRP_NOT_FORWARDED = 558,
  DCERROR_UNTOUCHED_PNP_IRP_NOT_FORWARDED = 559,
  DCERROR_PNP_QUERY_CAP_BAD_VERSION = 563,
  DCERROR_PNP_QUERY_CAP_BAD_SIZE = 564,
  DCERROR_PNP_QUERY_CAP_BAD_ADDRESS = 565,
  DCERROR_PNP_QUERY_CAP_BAD_UI_NUM = 566,
  DCERROR_BOGUS_MINOR_STATUS_TRASHED = 571,
  DCERROR_PENDING_RETURNED_NOT_MARKED = 573,
  DCERROR_PENDING_MARKED_NOT_RETURNED = 574,
  DCERROR_DOUBLE_DELETION = 576,
  DCERROR_DETACHED_IN_SURPRISE_REMOVAL = 577,
  DCERROR_DELETED_IN_SURPRISE_REMOVAL = 578,
  DCERROR_NON_PDO_RETURNED_IN_RELATION = 584,
  DCERROR_DUPLICATE_ENUMERATION = 585,
  DCERROR_FILE_IO_AT_BAD_IRQL = 586,
  DCERROR_MISHANDLED_TARGET_DEVICE_RELATIONS = 587,
  DCERROR_PENDING_RETURNED_NOT_MARKED_2 = 588,
  DCERROR_DDI_REQUIRES_PDO = 589,
  DCERROR_INVALID_STATUS_2 = 768,
  DCERROR_IOCALLDRIVER_ABOVE_DISPATCH_LEVEL = 769,
  DCERROR_IOCALLDRIVER_ABOVE_PASSIVE_LEVEL = 770,
  DCERROR_REMOVE_DEVICE_FAILED = 774,
} VF_ERROR_ID, *PVF_ERROR_ID;

typedef enum _PF_FUS_PHASE_ID
{
  PfFUSPhaseBegin = 0,
  PfFUSPhaseEnd = 1,
  PfFUSPhaseMax = 2,
} PF_FUS_PHASE_ID, *PPF_FUS_PHASE_ID;

typedef enum _POWER_REQUEST_TYPE
{
  PowerRequestDisplayRequired = 0,
  PowerRequestSystemRequired = 1,
  PowerRequestAwayModeRequired = 2,
} POWER_REQUEST_TYPE, *PPOWER_REQUEST_TYPE;

typedef enum _SYSTEM_FIRMWARE_TABLE_ACTION
{
  SystemFirmwareTable_Enumerate = 0,
  SystemFirmwareTable_Get = 1,
} SYSTEM_FIRMWARE_TABLE_ACTION, *PSYSTEM_FIRMWARE_TABLE_ACTION;

typedef enum _PF_ACCESS_TRACING_COMMAND
{
  PfComponentEnable = 0,
  PfComponentDisable = 1,
  PfComponentCommandMax = 2,
} PF_ACCESS_TRACING_COMMAND, *PPF_ACCESS_TRACING_COMMAND;

typedef enum _TP_TRACE_TYPE
{
  TpTraceThreadPriority = 1,
  TpTraceThreadAffinity = 2,
  MaxTpTraceType = 3,
} TP_TRACE_TYPE, *PTP_TRACE_TYPE;

typedef struct _WDBGEXTS_QUERY_INTERFACE
{
  /* 0x0000 */ const struct _GUID* Iid;
  /* 0x0008 */ void* Iface;
} WDBGEXTS_QUERY_INTERFACE, *PWDBGEXTS_QUERY_INTERFACE; /* size: 0x0010 */

typedef struct _EISA_IRQ_DESCRIPTOR
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char Interrupt : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned char Reserved : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char LevelTriggered : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char Shared : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char MoreEntries : 1; /* bit position: 7 */
  }; /* bitfield */
} EISA_IRQ_DESCRIPTOR, *PEISA_IRQ_DESCRIPTOR; /* size: 0x0001 */

typedef struct _EISA_IRQ_CONFIGURATION
{
  /* 0x0000 */ struct _EISA_IRQ_DESCRIPTOR ConfigurationByte;
  /* 0x0001 */ unsigned char Reserved;
} EISA_IRQ_CONFIGURATION, *PEISA_IRQ_CONFIGURATION; /* size: 0x0002 */

typedef enum _CM_ERROR_CONTROL_TYPE
{
  IgnoreError = 0,
  NormalError = 1,
  SevereError = 2,
  CriticalError = 3,
} CM_ERROR_CONTROL_TYPE, *PCM_ERROR_CONTROL_TYPE;

typedef union _UMS_APC_CONTROL
{
  union
  {
    /* 0x0000 */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long ContextHeaderReady : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long RelinquishComplete : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long PrimaryJoinPending : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long LockAcquired : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long TerminateRequested : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long PrimaryContinueRequested : 1; /* bit position: 5 */
    }; /* bitfield */
  }; /* size: 0x0004 */
} UMS_APC_CONTROL, *PUMS_APC_CONTROL; /* size: 0x0004 */

typedef enum _PF_TRACE_TYPE
{
  PfTraceTypePageAccess = 0,
  PfTraceTypeNameLogging = 1,
  PfTraceTypeMax = 2,
} PF_TRACE_TYPE, *PPF_TRACE_TYPE;

typedef enum _POLICY_INFORMATION_CLASS
{
  PolicyAuditLogInformation = 1,
  PolicyAuditEventsInformation = 2,
  PolicyPrimaryDomainInformation = 3,
  PolicyPdAccountInformation = 4,
  PolicyAccountDomainInformation = 5,
  PolicyLsaServerRoleInformation = 6,
  PolicyReplicaSourceInformation = 7,
  PolicyDefaultQuotaInformation = 8,
  PolicyModificationInformation = 9,
  PolicyAuditFullSetInformation = 10,
  PolicyAuditFullQueryInformation = 11,
  PolicyDnsDomainInformation = 12,
  PolicyDnsDomainInformationInt = 13,
  PolicyLocalAccountDomainInformation = 14,
  PolicyLastEntry = 15,
} POLICY_INFORMATION_CLASS, *PPOLICY_INFORMATION_CLASS;

typedef enum _AMD64_FUNCTION_TABLE_TYPE
{
  AMD64_RF_SORTED = 0,
  AMD64_RF_UNSORTED = 1,
  AMD64_RF_CALLBACK = 2,
} AMD64_FUNCTION_TABLE_TYPE, *PAMD64_FUNCTION_TABLE_TYPE;

typedef struct _MI_PHYSICAL_VIEW
{
  union
  {
    union
    {
      /* 0x0000 */ __int64 Balance : 2; /* bit position: 0 */
      /* 0x0000 */ struct _MMADDRESS_NODE* Parent;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u1;
  /* 0x0008 */ struct _MMADDRESS_NODE* LeftChild;
  /* 0x0010 */ struct _MMADDRESS_NODE* RightChild;
  /* 0x0018 */ unsigned __int64 StartingVpn;
  /* 0x0020 */ unsigned __int64 EndingVpn;
  /* 0x0028 */ struct _MMVAD* Vad;
  /* 0x0030 */ enum _MI_VAD_TYPE VadType;
  /* 0x0034 */ long Padding_112;
  union
  {
    union
    {
      /* 0x0038 */ struct _MMPTE* MappingPte;
      /* 0x0038 */ struct _RTL_BITMAP_EX* BitMap;
      /* 0x0038 */ struct _MMIO_TRACKER* IoTracker;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u;
  /* 0x0040 */ struct _MMINPAGE_SUPPORT* InPageSupport;
} MI_PHYSICAL_VIEW, *PMI_PHYSICAL_VIEW; /* size: 0x0048 */

typedef enum _TAG_UNNAMED_4
{
  DDILOCK_UNREGISTERED = 0,
  DDILOCK_REGISTERING = 1,
  DDILOCK_REGISTERED = 2,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

typedef enum _KTRANSACTION_STATE
{
  KTransactionUninitialized = 0,
  KTransactionActive = 1,
  KTransactionPreparing = 2,
  KTransactionPrepared = 3,
  KTransactionInDoubt = 4,
  KTransactionCommitted = 5,
  KTransactionAborted = 6,
  KTransactionDelegated = 7,
  KTransactionPrePreparing = 8,
  KTransactionForgotten = 9,
  KTransactionRecovering = 10,
  KTransactionPrePrepared = 11,
} KTRANSACTION_STATE, *PKTRANSACTION_STATE;

typedef enum _ATOM_INFORMATION_CLASS
{
  AtomBasicInformation = 0,
  AtomTableInformation = 1,
} ATOM_INFORMATION_CLASS, *PATOM_INFORMATION_CLASS;

typedef enum _DBG_STATE
{
  DbgIdle = 0,
  DbgReplyPending = 1,
  DbgCreateThreadStateChange = 2,
  DbgCreateProcessStateChange = 3,
  DbgExitThreadStateChange = 4,
  DbgExitProcessStateChange = 5,
  DbgExceptionStateChange = 6,
  DbgBreakpointStateChange = 7,
  DbgSingleStepStateChange = 8,
  DbgLoadDllStateChange = 9,
  DbgUnloadDllStateChange = 10,
} DBG_STATE, *PDBG_STATE;

enum PCI_EXPRESS_MRL_STATE
{
  MRLClosed = 0,
  MRLOpen = 1,
};

typedef struct _SCATTER_GATHER_ELEMENT
{
  /* 0x0000 */ union _LARGE_INTEGER Address;
  /* 0x0008 */ unsigned long Length;
  /* 0x000c */ long Padding_113;
  /* 0x0010 */ unsigned __int64 Reserved;
} SCATTER_GATHER_ELEMENT, *PSCATTER_GATHER_ELEMENT; /* size: 0x0018 */

typedef enum _HV_GUEST_OS_VENDOR
{
  HvGuestOsVendorMicrosoft = 1,
} HV_GUEST_OS_VENDOR, *PHV_GUEST_OS_VENDOR;

enum EM_RULE_STATE
{
  STATE_FALSE = 0,
  STATE_UNKNOWN = 1,
  STATE_TRUE = 2,
};

typedef struct _PROCESS_HANDLE_INFORMATION
{
  /* 0x0000 */ unsigned long HandleCount;
  /* 0x0004 */ unsigned long HandleCountHighWatermark;
} PROCESS_HANDLE_INFORMATION, *PPROCESS_HANDLE_INFORMATION; /* size: 0x0008 */

typedef enum _PS_ATTRIBUTE_NUM
{
  PsAttributeParentProcess = 0,
  PsAttributeDebugObject = 1,
  PsAttributeToken = 2,
  PsAttributeClientId = 3,
  PsAttributeTebAddress = 4,
  PsAttributeImageName = 5,
  PsAttributeImageInfo = 6,
  PsAttributeMemoryReserve = 7,
  PsAttributePriorityClass = 8,
  PsAttributeErrorMode = 9,
  PsAttributeStdHandleInfo = 10,
  PsAttributeHandleList = 11,
  PsAttributeGroupAffinity = 12,
  PsAttributePreferredNode = 13,
  PsAttributeIdealProcessor = 14,
  PsAttributeUmsThread = 15,
  PsAttributeExecuteOptions = 16,
  PsAttributeMax = 17,
} PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

enum WELL_KNOWN_SID_TYPE
{
  WinNullSid = 0,
  WinWorldSid = 1,
  WinLocalSid = 2,
  WinCreatorOwnerSid = 3,
  WinCreatorGroupSid = 4,
  WinCreatorOwnerServerSid = 5,
  WinCreatorGroupServerSid = 6,
  WinNtAuthoritySid = 7,
  WinDialupSid = 8,
  WinNetworkSid = 9,
  WinBatchSid = 10,
  WinInteractiveSid = 11,
  WinServiceSid = 12,
  WinAnonymousSid = 13,
  WinProxySid = 14,
  WinEnterpriseControllersSid = 15,
  WinSelfSid = 16,
  WinAuthenticatedUserSid = 17,
  WinRestrictedCodeSid = 18,
  WinTerminalServerSid = 19,
  WinRemoteLogonIdSid = 20,
  WinLogonIdsSid = 21,
  WinLocalSystemSid = 22,
  WinLocalServiceSid = 23,
  WinNetworkServiceSid = 24,
  WinBuiltinDomainSid = 25,
  WinBuiltinAdministratorsSid = 26,
  WinBuiltinUsersSid = 27,
  WinBuiltinGuestsSid = 28,
  WinBuiltinPowerUsersSid = 29,
  WinBuiltinAccountOperatorsSid = 30,
  WinBuiltinSystemOperatorsSid = 31,
  WinBuiltinPrintOperatorsSid = 32,
  WinBuiltinBackupOperatorsSid = 33,
  WinBuiltinReplicatorSid = 34,
  WinBuiltinPreWindows2000CompatibleAccessSid = 35,
  WinBuiltinRemoteDesktopUsersSid = 36,
  WinBuiltinNetworkConfigurationOperatorsSid = 37,
  WinAccountAdministratorSid = 38,
  WinAccountGuestSid = 39,
  WinAccountKrbtgtSid = 40,
  WinAccountDomainAdminsSid = 41,
  WinAccountDomainUsersSid = 42,
  WinAccountDomainGuestsSid = 43,
  WinAccountComputersSid = 44,
  WinAccountControllersSid = 45,
  WinAccountCertAdminsSid = 46,
  WinAccountSchemaAdminsSid = 47,
  WinAccountEnterpriseAdminsSid = 48,
  WinAccountPolicyAdminsSid = 49,
  WinAccountRasAndIasServersSid = 50,
  WinNTLMAuthenticationSid = 51,
  WinDigestAuthenticationSid = 52,
  WinSChannelAuthenticationSid = 53,
  WinThisOrganizationSid = 54,
  WinOtherOrganizationSid = 55,
  WinBuiltinIncomingForestTrustBuildersSid = 56,
  WinBuiltinPerfMonitoringUsersSid = 57,
  WinBuiltinPerfLoggingUsersSid = 58,
  WinBuiltinAuthorizationAccessSid = 59,
  WinBuiltinTerminalServerLicenseServersSid = 60,
  WinBuiltinDCOMUsersSid = 61,
  WinBuiltinIUsersSid = 62,
  WinIUserSid = 63,
  WinBuiltinCryptoOperatorsSid = 64,
  WinUntrustedLabelSid = 65,
  WinLowLabelSid = 66,
  WinMediumLabelSid = 67,
  WinHighLabelSid = 68,
  WinSystemLabelSid = 69,
  WinWriteRestrictedCodeSid = 70,
  WinCreatorOwnerRightsSid = 71,
  WinCacheablePrincipalsGroupSid = 72,
  WinNonCacheablePrincipalsGroupSid = 73,
  WinEnterpriseReadonlyControllersSid = 74,
  WinAccountReadonlyControllersSid = 75,
  WinBuiltinEventLogReadersGroup = 76,
  WinNewEnterpriseReadonlyControllersSid = 77,
  WinBuiltinCertSvcDComAccessGroup = 78,
  WinMediumPlusLabelSid = 79,
  WinLocalLogonSid = 80,
  WinConsoleLogonSid = 81,
  WinThisOrganizationCertificateSid = 82,
};

typedef enum _SECTION_INFORMATION_CLASS
{
  SectionBasicInformation = 0,
  SectionImageInformation = 1,
  SectionRelocationInformation = 2,
  MaxSectionInfoClass = 3,
} SECTION_INFORMATION_CLASS, *PSECTION_INFORMATION_CLASS;

typedef struct _SUPPORTED_RANGE
{
  /* 0x0000 */ struct _SUPPORTED_RANGE* Next;
  /* 0x0008 */ unsigned long SystemAddressSpace;
  /* 0x000c */ long Padding_114;
  /* 0x0010 */ __int64 SystemBase;
  /* 0x0018 */ __int64 Base;
  /* 0x0020 */ __int64 Limit;
} SUPPORTED_RANGE, *PSUPPORTED_RANGE; /* size: 0x0028 */

enum POP_SUBSTITUTION_POLICY
{
  SubstituteLightenSleep = 0,
  SubstituteLightestOverallDownwardBounded = 1,
  SubstituteDeepenSleep = 2,
};

typedef struct _SMBIOS_STRUCT_HEADER
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Length;
  /* 0x0002 */ unsigned short Handle;
  /* 0x0004 */ unsigned char* Data /* zero-length array */;
} SMBIOS_STRUCT_HEADER, *PSMBIOS_STRUCT_HEADER; /* size: 0x0004 */

enum VF_EVENTS
{
  VF_EVENT_BOOT = 0,
  VF_EVENT_SHUTDOWN = 1,
  VF_EVENT_BUGCHECK = 2,
  VF_EVENT_ENTER_DEBUGGER = 3,
  VF_EVENT_EXIT_DEBUGGER = 4,
  VF_EVENT_PHASE1_INIT_COMPLETE = 5,
};

enum VF_OBJECT_TYPE
{
  VFOBJTYPE_DRIVER = 0,
  VFOBJTYPE_DEVICE = 1,
  VFOBJTYPE_SYSTEM_BIOS = 2,
};

typedef struct _AMD64_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Pad[3];
  /* 0x0006 */ unsigned short Limit;
  /* 0x0008 */ unsigned __int64 Base;
} AMD64_DESCRIPTOR, *PAMD64_DESCRIPTOR; /* size: 0x0010 */

enum LSA_FOREST_TRUST_RECORD_TYPE
{
  ForestTrustTopLevelName = 0,
  ForestTrustTopLevelNameEx = 1,
  ForestTrustDomainInfo = 2,
  ForestTrustRecordTypeLast = 2,
};

enum IO_DEVICE_RELATIONSHIP
{
  IoParentDevice = 0,
  IoChildDevice = 1,
  IoSiblingDevice = 2,
};

enum PCI_EXPRESS_INDICATOR_STATE
{
  IndicatorOn = 1,
  IndicatorBlink = 2,
  IndicatorOff = 3,
};

enum PCI_EXPRESS_MAX_PAYLOAD_SIZE
{
  MaxPayload128Bytes = 0,
  MaxPayload256Bytes = 1,
  MaxPayload512Bytes = 2,
  MaxPayload1024Bytes = 3,
  MaxPayload2048Bytes = 4,
  MaxPayload4096Bytes = 5,
};

enum VfBugcheckWorkaroundType
{
  VfBugcheckAllocZeroBytes = 1,
};

enum BATTERY_SET_INFORMATION_LEVEL
{
  BatteryCriticalBias = 0,
  BatteryCharge = 1,
  BatteryDischarge = 2,
};

typedef enum _PERFINFO_CCSWAP_TYPE
{
  PerfCSwapIdleShort = 0,
  PerfCSwapIdle = 1,
  PerfCSwapLite = 2,
  PerfCSwapFull = 3,
} PERFINFO_CCSWAP_TYPE, *PPERFINFO_CCSWAP_TYPE;

typedef enum _POLICY_DOMAIN_INFORMATION_CLASS
{
  PolicyDomainEfsInformation = 2,
  PolicyDomainKerberosTicketInformation = 3,
} POLICY_DOMAIN_INFORMATION_CLASS, *PPOLICY_DOMAIN_INFORMATION_CLASS;

typedef struct _HANDLE_TRACE_DB_ENTRY
{
  /* 0x0000 */ struct _CLIENT_ID ClientId;
  /* 0x0010 */ void* Handle;
  /* 0x0018 */ unsigned long Type;
  /* 0x001c */ long Padding_115;
  /* 0x0020 */ void* StackTrace[16];
} HANDLE_TRACE_DB_ENTRY, *PHANDLE_TRACE_DB_ENTRY; /* size: 0x00a0 */

typedef union _WHEA_XPF_BUS_CHECK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 TransactionTypeValid : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 OperationValid : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 LevelValid : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 ProcessorContextCorruptValid : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 UncorrectedValid : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 PreciseIPValid : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned __int64 RestartableIPValid : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned __int64 OverflowValid : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned __int64 ParticipationValid : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 TimeoutValid : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned __int64 AddressSpaceValid : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned __int64 ReservedValid : 5; /* bit position: 11 */
      /* 0x0000 */ unsigned __int64 TransactionType : 2; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Operation : 4; /* bit position: 18 */
      /* 0x0000 */ unsigned __int64 Level : 3; /* bit position: 22 */
      /* 0x0000 */ unsigned __int64 ProcessorContextCorrupt : 1; /* bit position: 25 */
      /* 0x0000 */ unsigned __int64 Uncorrected : 1; /* bit position: 26 */
      /* 0x0000 */ unsigned __int64 PreciseIP : 1; /* bit position: 27 */
      /* 0x0000 */ unsigned __int64 RestartableIP : 1; /* bit position: 28 */
      /* 0x0000 */ unsigned __int64 Overflow : 1; /* bit position: 29 */
      /* 0x0000 */ unsigned __int64 Participation : 2; /* bit position: 30 */
      /* 0x0000 */ unsigned __int64 Timeout : 1; /* bit position: 32 */
      /* 0x0000 */ unsigned __int64 AddressSpace : 2; /* bit position: 33 */
      /* 0x0000 */ unsigned __int64 Reserved : 29; /* bit position: 35 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 XpfBusCheck;
  }; /* size: 0x0008 */
} WHEA_XPF_BUS_CHECK, *PWHEA_XPF_BUS_CHECK; /* size: 0x0008 */

enum ST_STORE<SM_TRAITS>::_ST_PERSIST_PHASE
{
  PersistNone = 0,
  PersistPersisted = 1,
  PersistUnpersisting = 2,
  PersistSyncing = 3,
  PersistStateMax = 4,
};

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  MaxJobObjectInfoClass = 12,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef union _KGDTENTRY64
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short LimitLow;
      /* 0x0002 */ unsigned short BaseLow;
      union
      {
        struct
        {
          /* 0x0004 */ unsigned char BaseMiddle;
          /* 0x0005 */ unsigned char Flags1;
          /* 0x0006 */ unsigned char Flags2;
          /* 0x0007 */ unsigned char BaseHigh;
        } /* size: 0x0004 */ Bytes;
        struct
        {
          struct
          {
            struct /* bitfield */
            {
              /* 0x0004 */ unsigned long BaseMiddle : 8; /* bit position: 0 */
              /* 0x0004 */ unsigned long Type : 5; /* bit position: 8 */
              /* 0x0004 */ unsigned long Dpl : 2; /* bit position: 13 */
              /* 0x0004 */ unsigned long Present : 1; /* bit position: 15 */
              /* 0x0004 */ unsigned long LimitHigh : 4; /* bit position: 16 */
              /* 0x0004 */ unsigned long System : 1; /* bit position: 20 */
              /* 0x0004 */ unsigned long LongMode : 1; /* bit position: 21 */
              /* 0x0004 */ unsigned long DefaultBig : 1; /* bit position: 22 */
              /* 0x0004 */ unsigned long Granularity : 1; /* bit position: 23 */
              /* 0x0004 */ unsigned long BaseHigh : 8; /* bit position: 24 */
            }; /* bitfield */
          } /* size: 0x0004 */ Bits;
          /* 0x0008 */ unsigned long BaseUpper;
          /* 0x000c */ unsigned long MustBeZero;
        }; /* size: 0x000c */
      }; /* size: 0x000c */
    }; /* size: 0x0010 */
    /* 0x0000 */ unsigned __int64 Alignment;
  }; /* size: 0x0010 */
} KGDTENTRY64, *PKGDTENTRY64; /* size: 0x0010 */

typedef enum _DBGKM_APINUMBER
{
  DbgKmExceptionApi = 0,
  DbgKmCreateThreadApi = 1,
  DbgKmCreateProcessApi = 2,
  DbgKmExitThreadApi = 3,
  DbgKmExitProcessApi = 4,
  DbgKmLoadDllApi = 5,
  DbgKmUnloadDllApi = 6,
  DbgKmErrorReportApi = 7,
  DbgKmMaxApiNumber = 8,
} DBGKM_APINUMBER, *PDBGKM_APINUMBER;

typedef enum _PROCESSINFOCLASS
{
  ProcessBasicInformation = 0,
  ProcessQuotaLimits = 1,
  ProcessIoCounters = 2,
  ProcessVmCounters = 3,
  ProcessTimes = 4,
  ProcessBasePriority = 5,
  ProcessRaisePriority = 6,
  ProcessDebugPort = 7,
  ProcessExceptionPort = 8,
  ProcessAccessToken = 9,
  ProcessLdtInformation = 10,
  ProcessLdtSize = 11,
  ProcessDefaultHardErrorMode = 12,
  ProcessIoPortHandlers = 13,
  ProcessPooledUsageAndLimits = 14,
  ProcessWorkingSetWatch = 15,
  ProcessUserModeIOPL = 16,
  ProcessEnableAlignmentFaultFixup = 17,
  ProcessPriorityClass = 18,
  ProcessWx86Information = 19,
  ProcessHandleCount = 20,
  ProcessAffinityMask = 21,
  ProcessPriorityBoost = 22,
  ProcessDeviceMap = 23,
  ProcessSessionInformation = 24,
  ProcessForegroundInformation = 25,
  ProcessWow64Information = 26,
  ProcessImageFileName = 27,
  ProcessLUIDDeviceMapsEnabled = 28,
  ProcessBreakOnTermination = 29,
  ProcessDebugObjectHandle = 30,
  ProcessDebugFlags = 31,
  ProcessHandleTracing = 32,
  ProcessIoPriority = 33,
  ProcessExecuteFlags = 34,
  ProcessTlsInformation = 35,
  ProcessCookie = 36,
  ProcessImageInformation = 37,
  ProcessCycleTime = 38,
  ProcessPagePriority = 39,
  ProcessInstrumentationCallback = 40,
  ProcessThreadStackAllocation = 41,
  ProcessWorkingSetWatchEx = 42,
  ProcessImageFileNameWin32 = 43,
  ProcessImageFileMapping = 44,
  ProcessAffinityUpdateMode = 45,
  ProcessMemoryAllocationMode = 46,
  ProcessGroupInformation = 47,
  ProcessTokenVirtualizationEnabled = 48,
  ProcessConsoleHostProcess = 49,
  ProcessWindowInformation = 50,
  MaxProcessInfoClass = 51,
} PROCESSINFOCLASS, *PPROCESSINFOCLASS;

struct tagAHCACHESTATS
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long OperationLookup;
  /* 0x0008 */ unsigned long OperationRemove;
  /* 0x000c */ unsigned long OperationUpdate;
  /* 0x0010 */ unsigned long OperationFlush;
  /* 0x0014 */ unsigned long OperationDump;
  /* 0x0018 */ unsigned long OperationStartedService;
  /* 0x001c */ unsigned long OperationStoppingService;
  /* 0x0020 */ unsigned long OperationForward;
  /* 0x0024 */ unsigned long OperationQuery;
  /* 0x0028 */ unsigned long LookupHits;
  /* 0x002c */ unsigned long LookupMisses;
  /* 0x0030 */ unsigned long Inserted;
  /* 0x0034 */ unsigned long Replaced;
  /* 0x0038 */ unsigned long Updated;
  /* 0x003c */ unsigned long DropDueToServiceUnAvailability;
  /* 0x0040 */ unsigned long DropDueToInvalidServicePort;
  /* 0x0044 */ unsigned long DropDueToServiceRequestError;
  /* 0x0048 */ unsigned long DropDueToServiceDisabled;
  /* 0x004c */ unsigned long DropDueToTimeout;
  /* 0x0050 */ unsigned long DropDueToBufferOverflow;
  /* 0x0054 */ unsigned long SumQueued;
  /* 0x0058 */ unsigned long SumExceedHeapQuota;
  /* 0x005c */ unsigned long SumDroppedQueueLimit;
  /* 0x0060 */ unsigned long SumSent;
  /* 0x0064 */ unsigned long SumDroppedService;
  /* 0x0068 */ unsigned long SumServiceConnectFailures;
  /* 0x006c */ unsigned long Padding1;
  /* 0x0070 */ unsigned __int64 SumBytesAllocated;
}; /* size: 0x0078 */

struct tagSTOREDCACHEHEADER
{
  /* 0x0000 */ unsigned long dwMagic;
  /* 0x0004 */ unsigned long dwCount;
  /* 0x0008 */ struct tagAHCACHESTATS Stats;
}; /* size: 0x0080 */

typedef struct _PROCESSOR_PERF_INFO
{
  /* 0x0000 */ struct _PROCESSOR_NUMBER Number;
  /* 0x0004 */ long Padding_116;
  /* 0x0008 */ unsigned __int64 PerfContext;
  /* 0x0010 */ unsigned long PercentageCap;
  /* 0x0014 */ long __PADDING__[1];
} PROCESSOR_PERF_INFO, *PPROCESSOR_PERF_INFO; /* size: 0x0018 */

typedef struct _KGATE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KGATE, *PKGATE; /* size: 0x0018 */

